==Events==
 457  Leo I the Thracian becomes emperor of the Byzantine Empire.
 987  Bardas Phokas the Younger and Bardas Skleros, Byzantine generals of the military elite, begin a Rebellion of Bardas Phokas the Younger|wide-scale rebellion against Emperor Basil II.
1074  Pandulf IV of Benevento is killed battling the invading Normans at the Battle of Montesarchio.
1301  Edward of Caernarfon|Caernarvon (later king Edward II of England) becomes the first English Prince of Wales.
1497  The Bonfire of the Vanities occurs, during which supporters of Girolamo Savonarola burn cosmetics, art, and books in Florence, Italy.
1783  American Revolutionary War: French and Spanish forces lift the Great Siege of Gibraltar.
1795  The Eleventh Amendment to the United States Constitution|11th Amendment to the United States Constitution is ratification|ratified.
1807  Napoleonic Wars: Napoleon finds Levin August, Count von Bennigsen|Bennigsen's Russian forces taking a stand at Battle of Eylau|Eylau. After bitter fighting, the French take the town, but the Russians resume the battle the next day.
1812  The strongest in 1811–12 New Madrid earthquakes|a series of earthquakes strikes New Madrid, Missouri.
1813  In the action of 7 February 1813 near the Îles de Los, the frigates ''French frigate Aréthuse (1812)|Aréthuse'' and HMS Amelia (1796)|''Amelia'' batter each other, but neither can gain the upper hand.
1819  Sir Thomas Stamford Raffles leaves Singapore after just taking it over, leaving it in the hands of William Farquhar.
1842  Battle of Debre Tabor: Ras Ali II of Yejju|Ali Alula, Regent of the Emperor of Ethiopia defeats warlord Wube Haile Maryam of Semien.
1854  A law is approved to found the ETH Zurich|Swiss Federal Institute of Technology. Lectures started October 16, 1855.
1863  {{HMS|Orpheus|1860|6}} sinks off the coast of Auckland, New Zealand, killing 189.
1894  The Cripple Creek miners' strike of 1894|Cripple Creek miner's strike, led by the Western Federation of Miners, begins in Cripple Creek, Colorado.
1898  Dreyfus affair: Émile Zola is brought to trial for libel for publishing ''J'accuse''.
1900  Second Boer War: United Kingdom of Great Britain and Ireland|British troops fail in their Battle of Vaal Krantz|third attempt to lift the Siege of Ladysmith.
1900    A Chinese immigrant in San Francisco falls ill to bubonic plague in the San Francisco plague of 1900–1904|first plague epidemic in the continental United States.<ref>{{cite journal |last=Kalisch |first=Philip A. |title=The Black Death in Chinatown: Plague and Politics in San Francisco 1900–1904 |work=Arizona and the West |volume=14 |number=2 |date=Summer 1972 |pages=113–136 |publisher=Journal of the Southwest |jstor=40168068}}</ref>
1904  A Great Baltimore Fire|fire in Baltimore, Maryland destroys over 1,500 buildings in 30 hours.
1940  The second full-length animated Walt Disney film, ''Pinocchio (1940 film)|Pinocchio'', premieres.
1943  World War II: Imperial Japanese Navy forces complete the evacuation of Imperial Japanese Army troops from Guadalcanal during Operation Ke, ending Japanese attempts to retake the island from Allies of World War II|Allied forces in the Guadalcanal Campaign.
1944  World War II: In Anzio, Italy, German forces launch a counteroffensive during the Allied Operation Shingle.
1951  Korean War: More than 700 suspected communist sympathizers Sancheong-Hamyang massacre|are massacred by Republic of Korea Army|South Korean forces.
1962  The United States United States embargo against Cuba|bans all Cuban imports and exports.
1974  Grenada gains independence from the United Kingdom.
1979  Pluto moves inside Neptune's orbit for the first time since either was discovered.
1984  Space Shuttle program: STS-41-B Mission: Astronauts Bruce McCandless II and Robert L. Stewart make the first untethered space walk using the Manned Maneuvering Unit (MMU).
1986  Twenty-eight years of one-family rule end in Haiti, when President Jean-Claude Duvalier flees the Caribbean nation.
1990  Dissolution of the Soviet Union: The Central Committee of the Soviet Communist Party agrees to give up its monopoly on power.
1991  Haiti's first democratically elected president, Jean-Bertrand Aristide, is sworn in.
1991    The Troubles: The Provisional IRA launched Downing Street mortar attack|a mortar attack on 10 Downing Street in London, the headquarters of the British government.
1992  The Maastricht Treaty is signed, leading to the creation of the European Union.
1995  Ramzi Yousef, the mastermind of the 1993 World Trade Center bombing, is arrested in Islamabad|Islamabad, Pakistan.
1997  NeXT merges with Apple Inc.|Apple Computer, starting the path to OS X|Mac OS X.
1999  Abdullah II of Jordan|Crown Prince Abdullah becomes the King of Jordan on the death of his father, King Hussein of Jordan|Hussein.
2009  Black Saturday bushfires|Bushfires in Victoria leave 173 dead in the worst natural disaster in Australia's history.
2012  President Mohamed Nasheed of the Maldives|Republic of Maldives resigns, after 23 days of anti-governmental protests calling for the release of Chief Judge unlawfully arrested by the military.
2013  The U.S. state of Mississippi officially certifies the Thirteenth Amendment to the United States Constitution|Thirteenth Amendment, becoming the last state to approve the abolition of slavery. The Thirteenth Amendment was formally ratified by Mississippi in 1995.
2014  Scientists announce that the Happisburgh footprints in Norfolk, England, date back to more than 800,000 years ago, making them the oldest known hominid footprints outside Africa.<ref>{{cite journal|doi=10.1371/journal.pone.0088329|pmid=24516637|title=Hominin Footprints from Early Pleistocene Deposits at Happisburgh, UK|journal=PLoS ONE|volume=9|issue=2|pages=e88329|year=2014|last1=Ashton|first1=Nick|last2=Lewis|first2=Simon G|last3=De Groote|first3=Isabelle|last4=Duffy|first4=Sarah M|last5=Bates|first5=Martin|last6=Bates|first6=Richard|last7=Hoare|first7=Peter|last8=Lewis|first8=Mark|last9=Parfitt|first9=Simon A|last10=Peglar|first10=Sylvia|last11=Williams|first11=Craig|last12=Stringer|first12=Chris}}</ref>
2016  North Korea launches Kwangmyŏngsŏng-4 into outer space violating multiple UN treaties and prompting condemnation from around the world.
==Births==
 574  Prince Shōtoku of Japan (d. 622)
1102  Empress Matilda, Holy Roman Empress and claimant to the English throne (d. 1167)
1478  Thomas More, English lawyer and politician, Lord Chancellor|Lord Chancellor of the United Kingdom (d. 1535)
1487  Queen Dangyeong, Korean royal consort (d. 1557)
1500  João de Castro, viceroy of Portuguese India (d. 1548)
1612  Thomas Killigrew, English playwright and manager (d. 1683)
1622  Vittoria della Rovere, Italian noble (d. 1694)
1693  Empress Anna of Russia (d. 1740)
1726  Margaret Fownes-Luttrell, English painter (d. 1766)
1741  Henry Fuseli, Swiss-English painter and academic (d. 1825)
1758  Benedikt Schack, Czech tenor and composer (d. 1826)
1768  Antoine-Athanase Royer-Collard, French physician (d. 1825)
1796  Thomas Gregson, English-Australian lawyer and politician, 2nd Premier of Tasmania (d. 1874)
1804  John Deere (inventor)|John Deere, American blacksmith and businessman, founded Deere & Company (d. 1886)
1812  Charles Dickens, English novelist and critic (d. 1870)
1825  Karl Möbius, German zoologist and ecologist (d. 1908)
1834 -- Alfred-Philibert Aldrophe, French architect (d. 1895)
1837  James Murray (lexicographer)|James Murray, Scottish lexicographer and philologist (d. 1915)
1842  Alexandre Ribot, French academic and politician, Prime Minister of France (d. 1923)
1864  Arthur Collins (singer)|Arthur Collins, American baritone singer (d. 1933)
1867  Laura Ingalls Wilder, American author (d. 1957)
1870  Alfred Adler, Austrian-Scottish psychologist and therapist (d. 1937)
1871  Wilhelm Stenhammar, Swedish pianist, composer, and conductor (d. 1927)
1873  Thomas Andrews (shipbuilder)|Thomas Andrews, Irish shipbuilder and businessman, designed the RMS Titanic|RMS ''Titanic'' (d. 1912)
1877  G. H. Hardy, English mathematician and geneticist (d. 1947)
1878  Ossip Gabrilowitsch, Russian-American pianist and conductor (d. 1936)
1885  Sinclair Lewis, American novelist, short-story writer, and playwright, Nobel Prize in Literature|Nobel Prize laureate (d. 1951)
1885    Hugo Sperrle, German field marshal (d. 1953)
1887  Eubie Blake, American pianist and composer (d. 1983)
1889  Harry Nyquist, Swedish-American engineer and theorist (d. 1976)
1893  Joseph Algernon Pearce, Canadian astrophysicist and astronomer (d. 1988)
1895  Anita Stewart, American actress (d. 1961)
1898  Dock Boggs, American folk singer-songwriter and banjo player (d. 1971)
1901  Arnold Nordmeyer, New Zealand minister and politician, 30th Minister of Finance (New Zealand)|New Zealand Minister of Finance (d. 1989)
1904  Ernest E. Debs, American politician, California State Assembly member, Los Angeles city councilman, and a member of the Los Angeles County Board of Supervisors (d. 2002)
1905  Paul Nizan, French philosopher and author (d. 1940)
1905    Ulf von Euler, Swedish physiologist and academic, Nobel Prize in Physiology or Medicine|Nobel Prize laureate (d. 1983)
1906  Puyi, Chinese emperor (d. 1967)
1906    Oleg Konstantinovich Antonov, Russian engineer, founded the Antonov|Antonov Aircraft Company (d. 1984)
1908  Buster Crabbe, American swimmer and actor (d. 1983)
1908    Manmath Nath Gupta, Indian journalist and author (d. 2000)
1909  Hélder Câmara, Brazilian archbishop (d. 1999)
1909    Amedeo Guillet, Italian soldier (d. 2010)
1912  Russell Drysdale, English-Australian painter (d. 1981)
1915  Teoctist Arăpașu, Romanian patriarch (d. 2007)
1915    Eddie Bracken, American actor and singer (d. 2002)
1916  Frank Hyde, Australian rugby player, coach, and sportscaster (d. 2007)
1919  Jock Mahoney, American actor and stuntman (d. 1989)
1919  Desmond Doss, American army corporal and combat medic, Medal of Honor recipient (d. 2006)
1920  Oscar Brand, Canadian-American singer-songwriter and author (d. 2016)
1920    An Wang, Chinese-American engineer and businessman, founded Wang Laboratories (d. 1990)
1921  Athol Rowan, South African cricketer (d. 1998)
1922  Hattie Jacques, English actress (d. 1980)
1923  Dora Bryan, English actress and restaurateur (d. 2014)
1925  Hans Schmidt (wrestler)|Hans Schmidt, Canadian wrestler (d. 2012)
1926  Konstantin Feoktistov, Russian engineer and astronaut (d. 2009)
1926    Bill Hoest, American cartoonist (d. 1988)
1927  Juliette Gréco, French singer and actress
1927    Vladimir Kuts, Ukrainian-Russian runner and coach (d. 1975)
1928  Lincoln D. Faurer, American general (d. 2014)
1932  Gay Talese, American journalist and memoirist
1932    Alfred Worden, American colonel, pilot, and astronaut
1933  K. N. Choksy, Sri Lankan lawyer and politician, Minister of Finance (Sri Lanka)|Sri Lankan Minister of Finance (d. 2015)
1934  Eddie Fenech Adami, Maltese lawyer and politician, 7th President of Malta
1934    King Curtis, American saxophonist and producer (d. 1971)
1934    Earl King, American singer-songwriter, guitarist, and producer (d. 2003)
1935  Herb Kohl, American businessman and politician
1935    Jörg Schneider, Swiss actor and author (d. 2015)
1936  Jas Gawronski, Italian journalist and politician
1937  Peter Jay (diplomat)|Peter Jay, English economist, journalist, and diplomat, List of Ambassadors of the United Kingdom to the United States|British Ambassador to the United States
1937    Juan Pizarro (baseball)|Juan Pizarro, Puerto Rican baseball player
1940  Tony Tan, Singaporean academic and politician, 7th President of Singapore
1941  Kevin Crossley-Holland, English author and poet
1943  Eric Foner, American historian, author, and academic
1943    Gareth Hunt, English actor (d. 2007)
1945  Gerald Davies, Welsh rugby player and journalist
1946  Héctor Babenco, Argentinian-Brazilian director, producer, and screenwriter (d. 2016)
1946    Sammy Johns, American country music singer-songwriter (d. 2013)
1946    Pete Postlethwaite, English actor (d. 2011)
1946    Gérard Jean-Juste, Haitian priest and activist (d. 2009)
1948  Jimmy Greenspoon, American singer-songwriter and keyboard player (d. 2015)
1949  Jacques Duchesneau, Canadian police officer and politician
1949    Joe English (musician)|Joe English, American drummer and songwriter
1949    Alan Lancaster, English bass player and songwriter
1950  Karen Joy Fowler, American author
1953  Dan Quisenberry, American baseball player and poet (d. 1998)
1954  Dieter Bohlen, German singer-songwriter and producer
1955  Rolf Benirschke, American football player and game show host
1955    Miguel Ferrer, American actor and director (d. 2017)
1956  John Nielsen (racing driver) | John Nielsen, Danish racing driver
1956    Mark St. John, American guitarist (d. 2007)
1957  Carney Lansford, American baseball player and coach
1958  Giuseppe Baresi, Italian footballer and manager
1958    Terry Marsh (boxer)|Terry Marsh, English boxer and politician
1958    Matt Ridley, English journalist, author, and politician
1959  Mick McCarthy, English footballer, manager, and sportscaster
1960  Robert Smigel, American actor, producer, and screenwriter
1960    James Spader, American actor and producer
1962  Garth Brooks, American singer-songwriter and guitarist
1962    David Bryan, American keyboard player and songwriter
1962    Eddie Izzard, English comedian, actor, and producer
1963  Heidemarie Stefanyshyn-Piper, American Naval officer and astronaut
1964  Ashok Banker, Indian journalist, author, and screenwriter
1965  Chris Rock, American actor, director, producer, and screenwriter
1966  Kristin Otto, German swimmer
1968  Peter Bondra, Ukrainian-Slovak ice hockey player and manager
1968    Sully Erna, American singer-songwriter and guitarist
1968    Mark Tewksbury, Canadian swimmer and sportscaster
1969  Andrew Micallef, Maltese painter and musician<ref>{{cite book|last1=Schiavone|first1=Michael J.|title=Dictionary of Maltese Biographies Vol. II G-Z|date=2009|publisher=Pubblikazzjonijiet Indipendenza|location=Pietà, Malta|Pietà|isbn=9789993291329|page=1126}}</ref>
1971  Anita Tsoy, Russian singer-songwriter
1972  Robyn Lively, American actress
1973  Juwan Howard, American basketball player and coach
1974  J Dilla, American rapper and producer (d. 2006)
1974    Nujabes, Japanese record producer, DJ, composer and arranger (d. 2010)
1974    Danny Goffey, English singer-songwriter and drummer
1974    Steve Nash, South African-Canadian basketball player
1975  Wes Borland, American singer-songwriter and guitarist
1975    Alexandre Daigle, Canadian ice hockey player
1975    Rémi Gaillard, French comedian and actor
1976  Chito Miranda, Filipino singer-songwriter
1977  Tsuneyasu Miyamoto, Japanese footballer
1978  David Aebischer, Swiss ice hockey player
1978    Endy Chávez, Venezuelan baseball player
1978    Ashton Kutcher, American model, actor, producer, and entrepreneur
1978    Daniel Van Buyten, Belgian football player
1979  Daniel Bierofka, German footballer and coach
1979    Tawakkol Karman, Yemeni journalist and activist, Nobel Peace Prize|Nobel Prize laureate
1981  Darcy Dolce Neto, Brazilian footballer
1981    Lee Ok-sung, South Korean boxer
1982  Osamu Mukai, Japanese actor
1982    Mickaël Piétrus, French basketball player
1983  Sho Kamogawa, Japanese footballer
1983    Christian Klien, Austrian race car driver
1983    Federico Marchetti, Italian footballer
1984  Trey Hardee, American decathlete
1985  Tina Majorino, American actress
1988  Albin Hodža, French footballer
1988    Ai Kago, Japanese singer and actress
1988    Matthew Stafford, American football player
1989  Nick Calathes, Greek basketball player
1989    Elia Viviani, Italian cyclist
1989    Isaiah Thomas (basketball)|Isaiah Thomas, American basketball player
1990  Neil Etheridge, English-Filipino footballer
1990    Gianluca Lapadula, Italian footballer
1990    Steven Stamkos, Canadian ice hockey player
1990    Jacksepticeye, Irish&nbsp;Internet celebrity|internet personality
1991  Ryan O'Reilly (ice hockey)|Ryan O'Reilly, Canadian ice hockey player
1992  Sergi Roberto, Spanish footballer
1992    Ksenia Stolbova, Russian figure skater
1992    Maimi Yajima, Japanese singer and actress
1993  Diego Laxalt, Uruguayan footballer
1993    Chris Mears (diver)|Chris Mears, English diver and musician
1994  Riley Barber, American ice hockey player<ref>{{cite web|title=Riley Barber Stats and News|url=https://www.nhl.com/player/riley-barber-8477003|website=NHL.com|publisher=National Hockey League|accessdate=8 February 2018}}</ref>
1994    Nathan Walker, Welsh-Australian ice hockey player
1995  Roberto Osuna, Mexican baseball player
1995    Shani Tarashaj, Swiss footballer
1997  Nicolò Barella, Italian footballer
1999  Bea Miller, American singer-songwriter and actress
==Deaths==
 199  Lü Bu, Chinese warlord
 318  Emperor Min of Jin|Jin Mindi, emperor of the Jin Dynasty (265-420)|Jin Dynasty (b. 300)
 590  Pope Pelagius II (b. 520)
 812  Li Ning (Tang dynasty)|Li Ning, Chinese prince (b. 793)
 999  Boleslaus II the Pious, Duke of Bohemia (b. 932)
1045  Emperor Go-Suzaku of Japan (b. 1009)
1065  Siegfried I, Count of Sponheim (b. c. 1010)
1127  Ava (poet)|Ava, German poet (b. 1060)
1165  Marshal Stephen of Armenia
1259  Thomas, Count of Flanders
1317  Robert, Count of Clermont (b. 1256)
1320  Jan Muskata, Bishop of Kraków (b. 1250)
1333  Nikkō (priest)|Nikko, Japanese priest, founder of Nichiren Shoshu Buddhism (b. 1246)
1520  Alfonsina Orsini|Alfonsina de' Medici, Regent of Florence (b. 1472)
1560  Bartolommeo Bandinelli, Florentine sculptor (b. 1493)
1603  Bartholomäus Sastrow, German politician (b. 1520)
1626  William V, Duke of Bavaria (b. 1548)
1642  William Bedell, English bishop and academic (b. 1571)
1693  Paul Pellisson, French lawyer and author (b. 1624)
1736  Stephen Gray (scientist)|Stephen Gray, English astronomer and physicist (b. 1666)
1779  William Boyce (composer)|William Boyce, English organist and composer (b. 1711)
1799  Qianlong Emperor of China (b. 1711)
1801  Daniel Chodowiecki, Polish-German painter and academic (b. 1726)
1819  August Wilhelm Hupel, German-Estonian linguist and author (b. 1737)
1823  Ann Radcliffe, English author (b. 1764)
1837  Gustav IV Adolf of Sweden (b. 1778)
1862  Francisco de Paula Martínez de la Rosa y Berdejo, Spanish playwright and politician, Prime Minister of Spain (b. 1787)
1864  Vuk Karadžić, Serbian philologist and linguist (b. 1787)
1871  Henry E. Steinway, German-American businessman, founded Steinway & Sons (b. 1797)
1873  Sheridan Le Fanu, Irish author (b. 1814)
1878  Pope Pius IX (b. 1792)
1891  Marie Louise Andrews, American story writer and journalist  (b. 1849)
1897  Galileo Ferraris, Italian physicist and engineer (b. 1847)
1919  William Halford, English-American lieutenant, Medal of Honor recipient (b. 1841)
1920  Alexander Kolchak, Russian admiral and explorer (b. 1874)
1920    Charles Langelier, Canadian journalist, judge, and politician (b. 1850)
1921  John J. Gardner, American politician (b. 1845)
1937  Elihu Root, American lawyer and politician, 38th United States Secretary of State, Nobel Peace Prize|Nobel Prize laureate (b. 1845)
1938  Harvey Samuel Firestone, American businessman, founded the Firestone Tire and Rubber Company (b. 1868)
1939  Boris Grigoriev, Russian painter and illustrator (b. 1886)
1942  Ivan Bilibin, Russian illustrator and stage designer (b. 1876)
1944  Lina Cavalieri, Italian soprano and actress (b. 1874)
1959  Nap Lajoie, American baseball player and manager (b. 1874)
1959    Daniel François Malan, South African minister and politician, 5th Prime Minister of South Africa (b. 1874)
1959    Guitar Slim, American singer and guitarist (b. 1926)
1960  Igor Kurchatov, Russian physicist and academic (b. 1903)
1963  Learco Guerra, Italian cyclist and manager (b. 1902)
1964  Sofoklis Venizelos, Greek captain and politician, 133rd Prime Minister of Greece (b. 1894)
1968  Nick Adams (actor, born 1931)|Nick Adams, American actor and screenwriter (b. 1931)
1972  Walter Lang, American director and screenwriter (b. 1896)
1979  Josef Mengele, German SS officer and physician (b. 1911)
1986  Cheikh Anta Diop, Senegalese historian, anthropologist, and physicist (b. 1923)
1990  Alan Perlis, American computer scientist and academic (b. 1922)
1990    Alfredo M. Santos, Filipino general (b. 1905)
1991  Amos Yarkoni, Israeli colonel (b. 1920)
1994  Witold Lutosławski, Polish composer and conductor (b. 1913)
1996  Phillip Davidson, American general (b. 1915)
1999  Hussein of Jordan|King Hussein of Jordan (b. 1935)
1999    Bobby Troup, American actor, pianist, and composer (b. 1918)
2000  Doug Henning, Canadian magician and politician (b. 1947)
2001  Dale Evans, American singer-songwriter and actress (b. 1912)
2001    Anne Morrow Lindbergh, American author and pilot (b. 1906)
2003  Augusto Monterroso, Guatemalan author (b. 1921)
2005  Atli Dam, Faroese engineer and politician, 5th Prime Minister of the Faroe Islands (b. 1932)
2006  Princess Durru Shehvar of the Ottoman Empire (b. 1914)
2009  Blossom Dearie, American singer and pianist (b. 1924)
2010  Franco Ballerini, Italian cyclist and coach (b. 1964)
2012  Harry Keough, American soccer player and coach (b. 1927)
2013  Krsto Papić, Croatian director and screenwriter (b. 1933)
2014  Doug Mohns, Canadian-American ice hockey player (b. 1933)
2015  Billy Casper, American golfer and architect (b. 1931)
2015    Marshall Rosenberg, American psychologist and author (b. 1934)
2015    Dean Smith, American basketball player and coach (b. 1931)
2015    John C. Whitehead, American banker and politician, 9th United States Deputy Secretary of State (b. 1922)
2017  Richard Hatch (actor)|Richard Hatch, American actor (b. 1945)
2017    Hans Rosling, Swedish academic (b. 1948)
2017    Tzvetan Todorov, Bulgarian philosopher (b. 1939)
==Holidays and observances==
Christian feast day:
Richard the Pilgrim
Beatification|Blessed Eugénie Smet
Beatification|Blessed Pope Pius IX
Chrysolius
Egidio Maria of Saint Joseph
Colette of Corbie
February 7 (Eastern Orthodox liturgics)
New Martyrs and Confessors of the Russian Orthodox Church Typically observed on the Sunday closest to January 25 (O.S.)/February 7 (N.S.)
Independence Day (Grenada), celebrates the independence of Grenada from the United Kingdom in 1974.
AIDS.gov#External_links|National Black HIV/AIDS Awareness Day (United States)
==References==
==External links==
 [http://news.bbc.co.uk/onthisday/hi/dates/stories/february/7 BBC: On This Day]
 {{NYT On this day|month=02|day=07}}
 [http://canadachannel.ca/todayincanadianhistory/index.php/February_7 Today in Canadian History]
