==Events==
 624  Battle of Badr: a key battle between Muhammad's army  the new followers of Islam and the Quraysh of Mecca. The Muslims won this battle, known as the turning point of Islam, which took place in the Hejaz region of western Arabia.
 874  The bones of Saint Nicephorus are interred in the Church of the Holy Apostles, Constantinople.
 1138  Cardinal Gregorio Conti is elected Antipope as Antipope Victor IV (1138)|Victor IV, succeeding Antipope Anacletus II|Anacletus II.
 1567  The Battle of Oosterweel, traditionally regarded as the start of the Eighty Years' War, commences.
 1591  Battle of Tondibi: In Mali, Morocco|Moroccan forces of the Saadi dynasty led by Judar Pasha defeat the Songhai Empire, despite being outnumbered by at least five to one.
 1639  Harvard College is named after clergyman John Harvard (clergyman)|John Harvard.
 1697  Nojpetén, capital of the last independent Itza people|Maya kingdom, fell to Spanish conquistadors, the final step in the Spanish conquest of Guatemala.
 1781  William Herschel discovers Uranus.
 1809  Gustav IV Adolf of Sweden is deposed in a coup d'état.
 1845  Felix Mendelssohn's Violin Concerto (Mendelssohn)|Violin Concerto receives its première performance in Leipzig with Ferdinand David (musician)|Ferdinand David as soloist.
 1848  The German revolutions of 1848–49 begin in Vienna.
 1862  American Civil War: The U.S. Federal government of the United States|federal government forbids all Union (American Civil War)|Union army officers from returning fugitive slaves, thus effectively annulling the Fugitive Slave Act of 1850 and setting the stage for the Emancipation Proclamation.
 1865  American Civil War: The Confederate States of America agree to the use of African-American troops.
 1881  Alexander II of Russia is killed near his palace when a bomb is thrown at him (this is the Gregorian date; it was March 1 in the Julian calendar then in use in Russia).
 1884  The Siege of Khartoum begins. It lasts until January 26, 1885.
 1900  Second Boer War: British forces occupy Bloemfontein, Orange Free State.
 1920  The Kapp Putsch briefly ousts the Weimar Republic government from Berlin.
 1921  Mongolia is proclaimed an independent monarchy, ruled by Russian military officer Roman von Ungern-Sternberg as a dictator.
 1930  The news of the discovery of Pluto is telegraphed to the Harvard College Observatory.
 1933  Great Depression: Banks in the U.S. begin to re-open after President of the United States|President Franklin D. Roosevelt mandates a \"bank holiday\".
 1940  The Russo-Finnish Winter War ends.
 1943  The Holocaust: Nazi Germany|German forces liquidate the Kraków Ghetto|Jewish ghetto in Kraków.
 1954  First Indochina War: Viet Minh forces under Võ Nguyên Giáp unleashed a massive artillery barrage on the French to begin the Battle of Dien Bien Phu|Battle of Điện Biên Phủ, the climactic battle in the First Indochina War.
 1957  Cuban student revolutionaries storm the Museum of the Revolution (Cuba)|presidential palace in Havana in a failed attempt on the life of List of Presidents of Cuba|President Fulgencio Batista.
 1962  Lyman Lemnitzer, chairman of the Joint Chiefs of Staff, delivers a proposal, called Operation Northwoods, regarding performing terrorist attacks upon Guantanamo Bay Naval Base, to United States Secretary of Defense|Secretary of Defense Robert McNamara. The proposal is scrapped and President John F. Kennedy removes Lemnitzer from his position.
 1969  Apollo program: Apollo 9 returns safely to Earth after testing the Apollo Lunar Module|Lunar Module.
 1979  The New Jewel Movement, headed by Maurice Bishop, ousts Prime Minister of Grenada|Prime Minister Eric Gairy in a nearly bloodless coup d'état in Grenada.
 1985  1985 Kenilworth Road riot|The Kenilworth Road riot takes place at an association football match at Kenilworth Road in Luton, England with disturbances before, during and after an FA Cup 6th Round tie between Luton Town F.C. and Millwall F.C..
 1988  The Seikan Tunnel, the longest undersea tunnel in the world, opens between Aomori, Aomori|Aomori and Hakodate, Hokkaido|Hakodate, Japan.
 1991  The United States Department of Justice announces that Exxon has agreed to pay $1&nbsp;billion for the clean-up of the Exxon Valdez oil spill in Alaska.
 1992  The {{M|w}} 6.7 1992 Erzincan earthquake|Erzincan earthquake strikes eastern Turkey with a maximum Mercalli intensity scale|Mercalli intensity of VIII (''Severe''). At least 498 were killed in this strike-slip event on the North Anatolian Fault.
 1996  Dunblane school massacre: in Dunblane, Scotland, 16 primary school children and one teacher are shot dead by a spree killer, Thomas Watt Hamilton, who later commits suicide.
 1997  India's Missionaries of Charity chooses Sister Nirmala to succeed Mother Teresa as its leader.
1997    The Phoenix Lights are seen over Phoenix, Arizona by hundreds of people, and by millions on television.
 2003  The journal ''Nature (journal)|Nature'' reports that Ciampate del Diavolo|350,000-year-old footprints have been found in Italy.
 2008  Gold prices on the New York Mercantile Exchange hit $1,000 per ounce for the first time.
 2012  At least 28 people are killed in a Sierre coach crash|bus crash in a motorway tunnel near the town of Sierre in the Swiss canton of Valais.
 2013  Pope Francis is elected, in the Papal conclave, 2013|papal conclave, as the List of popes|266th Pope of the Catholic Church.
 2016  An March 2016 Ankara bombing|explosion occurs in central Ankara, Turkey, with at least 37 people killed and 127 wounded.
2016    Three gunmen 2016 Grand-Bassam shootings|attack two hotels in the Ivory Coast town of Grand-Bassam, killing at least 18 people and injuring 33 others.
==Births==
963  Anna Porphyrogenita, Grand Princess of Kiev (d. 1011)
1372  Louis I, Duke of Orléans (d. 1407)
1479  Lazarus Spengler, German hymnwriter (d. 1534)
1560  William Louis, Count of Nassau-Dillenburg, Dutch count (d. 1620)
1593  Georges de La Tour, French painter (d. 1652)
1599  John Berchmans, Belgian Jesuit scholastic and saint (d. 1621)
1615  Pope Innocent XII|Innocent XII, pope of the Catholic Church (d. 1700)
1648  Anne Henriette of Bavaria, princess of Condé (d. 1723)
1683  John Theophilus Desaguliers, French-English philosopher and translator (d. 1744)
1683  Johann Wilhelm Weinmann, botanist (d. 1741)
1700  Michel Blavet, French flute player and composer (d. 1768)
1719  John Griffin, 4th Baron Howard de Walden, English field marshal and politician, Lord Lieutenant of Essex (d. 1797)
1720  Charles Bonnet, Swiss historian and author (d. 1793)
1741  Joseph II, Holy Roman Emperor (d. 1790)
1753  Louise Marie Adélaïde de Bourbon-Penthièvre, Duchess of Orléans (d. 1821)
1763  Guillaume Brune, French general and diplomat (d. 1815)
1764  Charles Grey, 2nd Earl Grey, English politician, Prime Minister of the United Kingdom (d. 1845)
1770  Daniel Lambert, English animal breeder (d. 1809)
1781  Karl Friedrich Schinkel, German painter and architect, designed the Konzerthaus Berlin (d. 1841)
1798  Abigail Fillmore, American wife of Millard Fillmore, 14th First Lady of the United States (d. 1853)
1800  Mustafa Reşid Pasha, Ottoman politician, 212th List of Ottoman Grand Viziers|Grand Vizier of the Ottoman Empire (d. 1858)
1815  James Curtis Hepburn, American physician, linguist, and missionary (d. 1911)
1825  Hans Gude, Norwegian-German painter and academic (d. 1903)
1855  Percival Lowell, American astronomer and mathematician (d. 1916)
1857  B. H. Roberts, English-American historian and politician (d. 1933)
1860  Hugo Wolf, Slovene-Austrian composer (d. 1903)
1862  Paul Prosper Henrys, French general (d. 1943)
1864  Alexej von Jawlensky, Russian-German painter (d. 1941)
1870  Henri Étiévant, French actor and director (d. 1953)
1870  William Glackens, American painter and illustrator (d. 1938)
1874  Ellery Harding Clark, American jumper, coach, and lawyer (d. 1949)
1880  Josef Gočár, Czech architect (d. 1945)
1883  Enrico Toselli, Italian pianist and composer (d. 1926)
1884  Hugh Walpole, New Zealand-English author and educator (d. 1941)
1886  Home Run Baker, American baseball player and manager (d. 1963)
1886  Albert William Stevens, American captain and photographer (d. 1949)
1888  Paul Morand, French author and diplomat (d. 1976)
1889  Jüri Vilms, Estonian lawyer and politician (d. 1918)
1890  Fritz Busch, German conductor and director (d. 1951)
1892  Janet Flanner, American journalist and author (d. 1978)
1897  Yeghishe Charents, Armenian poet and activist (d. 1937)
1898  Henry Hathaway, American director and producer (d. 1985)
1899  Béla Guttmann, Hungarian footballer and coach (d. 1981)
1899  John Hasbrouck Van Vleck, American physicist and mathematician, Nobel Prize in Physics|Nobel Prize laureate (d. 1980)
1899  Jan Lechoń, Polish poet and critic (d. 1956)
1899  Pancho Vladigerov, Bulgarian pianist and composer (d. 1978)
1900 – Andrée Bosquet, Belgian painter (d. 1980)<ref>{{Cite web|url=http://www.galeriedupistoletdor.com/gdpo/Bosquet.htm|title=Andree Bosquet - Groupe Nervia - Frans Depooter - Le Bon vouloir  - Galerie du Pistolet d'Or|website=www.galeriedupistoletdor.com|access-date=2017-10-24}}</ref>
1900  Giorgos Seferis, Greek poet and diplomat, Nobel Prize in Literature|Nobel Prize laureate (d. 1971)
1902  Mohammed Abdel Wahab, Egyptian singer-songwriter (d. 1991)
1902  Hans Bellmer, German-French painter and sculptor (d. 1975)
1904  Clifford Roach, Trinidadian cricketer and footballer (d. 1988)
1906  Evald Tipner, Estonian footballer and ice hockey player (d. 1947)
1908  Walter Annenberg, American publisher, philanthropist, and diplomat, United States Ambassador to the United Kingdom (d. 2002)
1908  Myrtle Bachelder, American chemist and Women's Army Corps officer (d. 1997)
1910  Sammy Kaye, American saxophonist, songwriter, and bandleader (d. 1987)
1910  Kemal Tahir, Turkish journalist and author (d. 1973)
1911  José Ardévol, Cuban composer and conductor (d. 1981)
1911  L. Ron Hubbard, American religious leader and author, founded the Church of Scientology (d. 1986)
1911  Dorothy Tangney, Australian politician (d. 1985)
1913  William J. Casey, American politician, 13th Director of Central Intelligence (d. 1987)
1913  Joe Kelly (racing driver)|Joe Kelly, Irish-English race car driver and businessman (d. 1993)
1913  Sergey Mikhalkov, Russian author and playwright (d. 2009)
1914  W. O. Mitchell, Canadian author and playwright (d. 1998)
1914  Edward O'Hare, American lieutenant and pilot, Medal of Honor recipient (d. 1943)
1916  Lindy Boggs, American educator and politician, 5th United States Ambassador to the Holy See (d. 2013)
1916  Jacque Fresco, American engineer and academic (d. 2017)
1918  Grigory Pomerants, Russian philosopher and author (d. 2013)
1920  Ralph J. Roberts, American businessman, co-founded Comcast (d. 2015)
1921  Al Jaffee, American cartoonist
1923  Dimitrios Ioannidis, Greek general (d. 2010)
1925  Roy Haynes, American drummer and composer
1926  Carlos Roberto Reina, Honduran lawyer and politician, President of Honduras (d. 2003)
1927  Robert Denning, American interior designer and art collector (d. 2005)
1928  Ellen Raskin, American author and illustrator (d. 1984)
1929  Zbigniew Messner, Polish economist and politician, 9th List of Prime Ministers of Poland|Prime Minister of the Republic of Poland (d. 2014)
1930  Blue Mitchell, American trumpet player (d. 1979)
1933  Mahdi Elmandjra, Moroccan economist and sociologist (d. 2014)
1933  Mike Stoller, American songwriter and producer
1933  Gero von Wilpert, German author and academic (d. 2009)
1934  Barry Hughart, American author and screenwriter
1935  David Nobbs, English author and screenwriter (d. 2015)
1936  José Mojica Marins, Brazilian actor, director, and screenwriter
1938  Erma Franklin, American gospel and R&B singer (d. 2002)
1938  Robert Gammage, American captain and politician (d. 2012)
1938  Tochinoumi Teruyoshi, Japanese sumo wrestler, the 49th Makuuchi#Yokozuna|Yokozuna
1939  Neil Sedaka, American singer-songwriter and pianist
1941  Mahmoud Darwish, Palestinian poet and author (d. 2008)
1941  Donella Meadows, American environmentalist, author, and academic (d. 2001)
1942  Dave Cutler, American computer scientist and engineer
1942  Scatman John, American music artist (d. 1999)
1944  Terence Burns, Baron Burns, English economist and academic
1945  Anatoly Fomenko, Russian mathematician and academic
1946  Yonatan Netanyahu, American-Israeli colonel (d. 1976)
1947  Lesley Collier, English ballerina and educator
1947  Beat Richner, Swiss pediatrician and cellist
1947  Lyn St. James, American race car driver
1949  Ze'ev Bielski, Israeli politician
1949  Sian Elias, New Zealand lawyer and politician, 12th Chief Justice of New Zealand
1949  Julia Migenes, American soprano and actress
1950  Bernard Julien, Trinidadian cricketer
1950  Charles Krauthammer, American physician, journalist, and author
1950  William H. Macy, American actor, director, and screenwriter
1951  Charo, Spanish-American singer, guitarist, and actress
1952  Wolfgang Rihm, German composer and educator
1952  Tim Sebastian, English journalist and author
1953  Andy Bean, American golfer
1953  Michael Bruce Curry, 27th presiding bishop of the Episcopal Church
1953  Nicola Davies (judge)|Nicola Davies, Welsh lawyer and judge
1954  Valerie Amos, Baroness Amos, Guyanese-English politician and diplomat, Secretary of State for International Development
1954  Robin Duke, Canadian actress and screenwriter
1955  Bruno Conti, Italian footballer and manager
1955  Glenne Headly, American actress (d. 2017)
1955  Olga Rukavishnikova, Russian pentathlete
1956  Dana Delany, American actress and producer
1956  Jamie Dimon, American banker and businessman
1956  Jonathan Rutherford, English political scientist and academic
1957  John Hoeven, American banker and politician, 31st Governor of North Dakota
1957  Moses Hogan, American composer and conductor (d. 2003)
1958  Mágico González, Salvadoran footballer
1958  Rick Lazio, American lawyer and politician
1958  Caryl Phillips, Caribbean-English author and playwright
1959  Kathy Hilton, American actress and fashion designer
1959  Dirk Wellham, Australian cricketer
1960  Yurii Andrukhovych, Ukrainian poet and author
1960  Adam Clayton, English-born Irish musician and songwriter
1960  Joe Ranft, American animator, screenwriter, and voice actor (d. 2005)
1962  Terence Blanchard, American trumpet player and composer
1962  Seyhan Erözçelik, Turkish poet and author (d. 2011)
1963  Vance Johnson, American football player
1963  Willi Schneider (skeleton racer)|Willi Schneider, German skeleton racer
1963  Fito Páez, Argentinian singer-songwriter, pianist, and director
1964  Will Clark, American baseball player
1964  Craig Dimond, Australian rugby league player
1964  Trevor Gillmeister, Australian rugby league player and coach
1965  Steve Bacic, Canadian actor
1966  Chico Science, Brazilian singer-songwriter (d. 1997)
1967  Andrés Escobar, Colombian footballer (d. 1994)
1967  Pieter Vink, Dutch footballer and referee
1969  Darren Fritz, Australian rugby league player
1970  Tim Story, American director and producer
1971  Annabeth Gish, American actress
1972  Common (rapper)|Common, American rapper and actor
1972  Augenijus Vaškys, Lithuanian basketball player and coach
1973  Edgar Davids, Surinamese-Dutch footballer and manager
1973  Bobby Jackson (basketball)|Bobby Jackson, American basketball player and coach
1974  James Brinkley, Scottish cricketer
1974  Thomas Enqvist, Swedish tennis player and sportscaster
1975  Mark Clattenburg, English football referee
1976  James Dewees, American singer-songwriter and keyboard player
1976  Troy Hudson, American basketball player and rapper
1976  Danny Masterson, American actor and producer
1976  Jamie Pressnall, American tap dancer and musician
1977  Mohammed Sylla, Guinean footballer
1977  Kay Tse, Hong Kong singer-songwriter and actress
1978  Tom Danielson, American cyclist
1978  Kenny Watson, American football player
1979  Johan Santana, Venezuelan-American baseball player
1979  Cédric Van Branteghem, Belgian sprinter
1980  Caron Butler, American basketball player
1980  Flavia Cacace, Italian-English dancer
1980  Brad Watts, Australian rugby league player
1982  Jeremy Curl, Japanese-English explorer, author, and photographer
1982  Nicole Ohlde, American basketball player
1982  Adam Thomson (rugby union)|Adam Thomson, New Zealand rugby player
1983  George Rose (rugby league)|George Rose, Australian rugby league player
1983  Kaitlin Sandeno, American swimmer
1983  Erkan Veyseloğlu, Turkish basketball player
1984  Rachael Bella, American actress
1984  Geeta Basra, Indian actress
1985  Alcides Araújo Alves, Brazilian footballer
1985  Emile Hirsch, American actor
1985  Ben Lowe, Australian rugby league player
1986 Neil Wagner, South African-New Zealand cricketer
1987 Marco Andretti, American race car driver
1987  Andreas Beck (footballer)|Andreas Beck, German footballer
1988  Furdjel Narsingh, Dutch footballer
1989  Holger Badstuber, German footballer
1989  Marko Marin, German footballer
1989  Robert Wickens, Canadian racing driver
1990  Anicet Abel, Malagasy footballer
1991  Daniel Greig, Australian speed skater
1992  Kaya Scodelario, English actress
1994  Gerard Deulofeu, Spanish footballer
1995  Mikaela Shiffrin, American skier
1998  Jay-Roy Grot, Dutch footballer
==Deaths==
 601  Leander of Seville, Spanish bishop and saint (b. 534)
 731  Gerald of Mayo, Anglo-Saxon abbot
 948  Du Chongwei, Chinese general and governor
 1164  Fujiwara no Tadamichi, Japanese regent (b. 1097)
 1202  Mieszko III the Old, king of Poland (b. c. 1121)
 1271  Henry of Almain (b. 1235)
 1332  Theodore Metochita, Byzantine Empire statesman and author (b. 1270)
 1395  John Barbour (poet)|John Barbour, Scottish priest and poet (b. 1320)
 1447  Shahrukh Mirza, Timurid Empire|Timurid ruler of Persia and Transoxania (b. 1377)
 1490  Charles I, Duke of Savoy (b. 1468)
 1516  Vladislaus II of Bohemia and Hungary (b. 1456)
 1573  Michel de l'Hôpital, French politician (b. 1507)
 1601  Henry Cuffe, Politician (b. 1563)
 1604  Arnaud d'Ossat, French cardinal and diplomat (b. 1537)
 1619  Richard Burbage, English actor (b. 1567)
 1711  Nicolas Boileau-Despréaux, French poet and critic (b. 1636)
 1719  Johann Friedrich Böttger, German chemist and potter (b. 1682)
 1767  Maria Josepha of Saxony, Dauphine of France (b. 1731)
 1773  Philibert Commerson, French historian and explorer (b. 1727)
 1800  Nana Fadnavis, Indian minister and politician (b. 1742)
 1808  Christian VII of Denmark (b. 1749)
 1833  William Bradley (Royal Navy officer)|William Bradley, English lieutenant and cartographer (b. 1757)
 1842  Henry Shrapnel, English general (b. 1761)
 1854  Jean-Baptiste de Villèle, French politician, 6th Prime Minister of France (b. 1773)
 1873  David Swinson Maynard, American physician, lawyer, and businessman (b. 1808)
 1879  Adolf Anderssen, German mathematician and chess player (b. 1818)
 1881  Alexander II of Russia (b. 1818)
 1884  Leland Stanford, Jr., American son of Leland Stanford (b. 1868)
 1901  Benjamin Harrison, American general and politician, 23rd President of the United States (b. 1833)
1901    Fernand Pelloutier, French anarchist and syndicalist (b. 1867)
 1906  Susan B. Anthony, American activist (b. 1820)
 1911  John J. Toffey, American lieutenant, Medal of Honor recipient (b. 1844)
 1912  Eugène-Étienne Taché, Canadian engineer and architect, designed the Parliament Building (Quebec)|Parliament Building (b. 1836)
1912    Hugo Treffner, German educator, founded the Hugo Treffner Gymnasium (b. 1845)
 1914  Hakeem Noor-ud-Din, Pakistani physician and scholar (b. 1841)
 1918  César Cui, Russian composer and critic (b. 1835)
 1921  Jenny Twitchell Kempton, American opera singer and educator (b. 1835)
 1936  Francis Bell (New Zealand politician)|Francis Bell, New Zealand lawyer and politician, 20th Prime Minister of New Zealand (b. 1851)
 1938  Cevat Çobanlı, Turkish general (b. 1870)
1938    Clarence Darrow, American lawyer and author (b. 1857)
 1941  Elizabeth Madox Roberts, American poet and author (b. 1881)
 1943  Stephen Vincent Benét, American poet, short story writer, and novelist (b. 1898)
 1965  Corrado Gini, Italian sociologist and statistician (b. 1884)
1965    Vittorio Jano, Italian engineer (b. 1891)
1965    Fan S. Noli, Albanian-American bishop and politician, 14th Prime Minister of Albania (b. 1882)
 1971  Rockwell Kent, American painter and illustrator (b. 1882)
 1972  Tony Ray-Jones, English photographer (b. 1941)
 1975  Ivo Andrić, Yugoslav novelist, poet, and short story writer, Nobel Prize in Literature|Nobel Prize laureate (b. 1892)
 1976  Ole Haugsrud, American sports executive (b. 1900)
 1978  John Cazale, American actor (b. 1935)
 1983  Louison Bobet, French cyclist (b. 1925)
1983    Paul Citroen, German-Dutch illustrator and educator (b. 1896)
 1988  Johnny Wadd|John C. Holmes, American film star (b. 1944)
 1989  Fahrettin Özdilek, Turkish general and politician, Prime Minister of Turkey (b. 1898)
 1990  Bruno Bettelheim, Austrian-American psychologist and author (b. 1903)
1990    Karl Münchinger, German conductor and composer (b. 1915)
 1995  Leon Day, American baseball player (b. 1916)
1995    Odette Hallowes, French nurse and spy (b. 1912)
 1996  Krzysztof Kieślowski, Polish director and screenwriter (b. 1941)
 1998  Judge Dread, English singer-songwriter (b. 1945)
1998    Hans von Ohain, German-American physicist and engineer (b. 1911)
 1999  Lee Falk, American cartoonist, director, and producer (b. 1911)
1999    Garson Kanin, American director and screenwriter (b. 1912)
1999    Bidu Sayão, Brazilian-American soprano (b. 1902)
 2001  John A. Alonzo, American actor and cinematographer (b. 1934)
2001    Encarnacion Alzona, Filipino historian and educator (b. 1895)
 2002  Hans-Georg Gadamer, German philosopher and scholar (b. 1900)
 2004  Vilayat Khan, Indian sitar player and composer (b. 1928)
2004    Franz König, Austrian cardinal (b. 1905)
 2006  Robert C. Baker, American businessman, invented the chicken nugget (b. 1921)
2006    Jimmy Johnstone, Scottish footballer (b. 1944)
2006    Maureen Stapleton, American actress (b. 1925)
 2007  Arnold Skaaland, American wrestler and manager (b. 1925)
 2008  Elizabeth Gilels, Russian violinist (b. 1919)
 2009  Betsy Blair, American actress (b. 1923)
2009    Alan W. Livingston, American businessman (b. 1917)
 2010  Jean Ferrat, French singer-songwriter (b. 1930)
 2011  Rick Martin, Canadian-American ice hockey player (b. 1951)
 2014  Reubin Askew, American sergeant, lawyer, and politician, 37th Governor of Florida (b. 1928)
2014    Edward Haughey, Baron Ballyedmond, Irish businessman and politician (b. 1944)
2014    Ahmad Tejan Kabbah, Sierra Leonean economist, lawyer, and politician, 3rd President of Sierra Leone (b. 1932)
2014    Icchokas Meras, Lithuanian-Israeli author and screenwriter (b. 1934)
 2015  Al Rosen, American baseball player and manager (b. 1924)
 2016  Hilary Putnam, American philosopher, mathematician, and computer scientist (b. 1926)
2017    Amy Krouse Rosenthal, American author  (b. 1965)
==Holidays and observances==
 Public holidays in Vatican City|Anniversary of the election of Pope Francis (Vatican City)
 Christian feast day:
 Beatification|Blessed Irmã Dulce Pontes
 Earliest day on which Friday of Sorrows can fall, while April 16 is the latest; observed on Friday before Good Friday.
 Euphrasia of Constantinople
 Gerald of Mayo
 James Theodore Holly (Episcopal Church (USA))
 Leander of Seville
 Saint Leticia|Leticia
 Nikephoros I of Constantinople|Nicephorus
 Saint Roderick|Roderick
 Sabinus of Hermopolis
 Kasuga Matsuri (Kasuga Grand Shrine, Nara, Nara|Nara, Japan)
 National Elephant Day (Thailand)
== References ==
==External links==
 [http://news.bbc.co.uk/onthisday/hi/dates/stories/march/13 BBC: On This Day]
 {{NYT On this day|month=03|day=13}}
 [http://canadachannel.ca/todayincanadianhistory/index.php/March_13 Today in Canadian History]
