==Events==
503 BC  Roman consul Agrippa Menenius Lanatus (consul 503 BC)|Agrippa Menenius Lanatus celebrated a Roman triumph|triumph for a military victory over the Sabines.
1147  First historical record of Moscow.
1460  Basel University is founded.
1581  Francis Drake is knighted for completing a circumnavigation of the world.
1660  Declaration of Breda by King Charles II of Great Britain.
1721  Sir Robert Walpole becomes the first Prime Minister of the United Kingdom|British prime minister.
1768  In London, Philip Astley stages the first modern circus.
1796  Georges Cuvier delivers the first Paleontology|paleontological lecture.
1812  United States President James Madison enacts a ninety-day embargo on trade with the United Kingdom.
1814  Napoleon abdicates for the first time and names his son Napoleon II as Emperor of the French.
1818  The United States Congress, affirming the Second Continental Congress, adopts the flag of the United States with 13 red and white stripes and one star for each state (20 at that time).
1841  William Henry Harrison dies of pneumonia, becoming the first President of the United States to die in office, and setting the record for the briefest administration. Vice President John Tyler succeeds Harrison as President.
1850  A large part of the English village of Cottenham burns to the ground in suspicious circumstances.
1850    Los Angeles is incorporated as a city.
1859  Bryant's Minstrels debut \"Dixie (song)|Dixie\" in New York City in the finale of a blackface minstrel show.
1865  American Civil War: A day after Union (American Civil War)|Union forces capture Richmond, Virginia, U.S. President Abraham Lincoln visits the Confederate States of America|Confederate capital.
1866  Alexander II of Russia narrowly escapes an assassination attempt by Dmitry Karakozov in the city of Saint Petersburg.
1873  The Kennel Club is founded, the oldest and first official registry of purebred dogs in the world.
1875  M%C3%A1_vlast#Vltava|Vltava, composed by Czech composer Bedřich Smetana and also known by its German name '''Die Moldau''', premiered in Prague.
1887  Argonia, Kansas elects Susanna M. Salter as the first female mayor in the United States.
1905  In India, 1905 Kangra earthquake|an earthquake hits the Kangra Valley, killing 20,000, and destroying most buildings in Kangra, Himachal Pradesh|Kangra, McLeod Ganj and Dharamshala.
1913  First Balkan War: Greek aviator Emmanouil Argyropoulos becomes the first pilot to die in the Hellenic Air Force when his plane crashes.
1925  The Schutzstaffel (SS) is founded under Adolf Hitler's Nazi government in Germany.
1933  U.S. Navy airship {{USS|Akron|ZRS-4|6}} is wrecked off the New Jersey coast due to severe weather.
1939  Faisal II of Iraq|Faisal II becomes King of Iraq.
1944  World War II: Bombing of Bucharest in World War II|First bombardment of oil refineries in Bucharest by Anglo-American forces kills 3000 civilians.
1945  World War II: American troops liberate Ohrdruf forced labor camp in Germany.
1945    World War II: American troops Battle of Kassel (1945)|capture Kassel.
1945    World War II: Soviet troops liberate Hungary from German occupation and occupy the country itself.
1949  Cold War: Twelve nations sign the North Atlantic Treaty creating the NATO|North Atlantic Treaty Organization.
1958  The Campaign for Nuclear Disarmament|CND peace symbol is displayed in public for the first time in London.
1960  France agrees to grant independence to the Mali Federation, a union of Senegal and French Sudan.
1964  The Beatles occupy the top five positions on the Billboard Hot 100|''Billboard'' Hot 100 pop chart.
1965  The first model of the new Saab Viggen fighter aircraft is unveiled.
1967  Martin Luther King Jr. delivers his \"Beyond Vietnam: A Time to Break Silence\" speech in New York City's Riverside Church.
1968  Martin Luther King Jr. is Assassination of Martin Luther King Jr.|assassinated by James Earl Ray at a motel in Memphis, Tennessee.
1968    Apollo program: NASA launches Apollo 6.
1968    A.E.K. Athens B.C. becomes the first Greek team to win the European Basketball Cup.
1969  Dr. Denton Cooley Implant (medicine)|implants the first temporary artificial heart.
1973  The Twin Towers of the World Trade Center (1973–2001)|World Trade Center in New York City are officially dedicated.
1973    A Lockheed C-141 Starlifter, dubbed the ''Hanoi Taxi'', makes the last flight of Operation Homecoming.
1975  Microsoft is founded as a partnership between Bill Gates and Paul Allen in Albuquerque, New Mexico.
1975    Vietnam War: A United States Air Force Lockheed C-5 Galaxy|Lockheed C-5A Galaxy Operation Babylift|transporting orphans, crashes near Saigon, South Vietnam shortly after takeoff, killing 172 people.
1979  Prime Minister Zulfikar Ali Bhutto of Pakistan is executed.
1981  Iran–Iraq War: The Islamic Republic of Iran Air Force mounts an Attack on H3|attack on H-3 Airbase and destroys about 50 Iraqi aircraft.
1983  Space Shuttle program: Space Shuttle ''Space Shuttle Challenger|Challenger'' STS-6|makes its maiden voyage into space.
1984  President Ronald Reagan calls for an international ban on chemical weapons.
1988  List of Governors of Arizona|Governor Evan Mecham of Arizona is convicted in his impeachment trial and removed from office.
1991  Senator John Heinz of Pennsylvania and six others are killed when a helicopter collides with their airplane over an elementary school in Merion, Pennsylvania.
1991    The current flag of Hong Kong is adopted for post-colonial Hong Kong during the Third Session of the Seventh National People's Congress.
1994  Marc Andreessen and James H. Clark|Jim Clark found Netscape Communications Corporation under the name ''Mosaic Communications Corporation''.
1996  Comet Hyakutake is imaged by the USA Asteroid Orbiter Near Earth Asteroid Rendezvous.
2002  The Angolan government and UNITA rebels sign a peace treaty ending the Angolan Civil War.
2009  France returns to being a member of NATO.
2013  More than 70 people are killed in a 2013 Thane building collapse|building collapse in Thane, India.
==Births==
 188  Caracalla, Roman emperor (d. 217)
1436  Amalia of Saxony, Duchess of Bavaria-Landshut (d. 1501)
1490  Vojtěch I of Pernstein, Bohemian nobleman (d. 1534)
1492  Ambrosius Blarer, German-Swiss theologian and reformer (d. 1564)
1572  William Strachey, English author (d. 1621)
1586  Richard Saltonstall, English diplomat (d. 1661)
1593  Edward Nicholas, English soldier and politician, Secretary of State for the Southern Department (d. 1669)
1640  Gaspar Sanz, Spanish guitarist, composer, and priest (d. 1710)
1646  Antoine Galland, French orientalist and archaeologist (d. 1715)
1648  Grinling Gibbons, Dutch-English sculptor (d. 1721)
1676  Giuseppe Maria Orlandini, Italian composer (d. 1760)
1688  Joseph-Nicolas Delisle, French astronomer and cartographer (d. 1768)
1718  Benjamin Kennicott, English theologian and scholar (d. 1783)
1752  Niccolò Antonio Zingarelli, Italian composer (d. 1837)
1760  Juan Manuel Olivares, Venezuelan organist and composer (d. 1797)
1762  Stephen Storace, English actor and composer (d. 1796)
1772  Nachman of Breslov, Ukrainian founder of the Breslov Hasidic movement (d. 1810)
1780  Edward Hicks, American minister and painter (d. 1849)
1785  Bettina von Arnim, German author, illustrator, and composer (d. 1859)
1792  Thaddeus Stevens, American lawyer and politician (d. 1868)
1802  Dorothea Dix, American nurse and activist (d. 1887)
1818  Thomas Mayne Reid, Irish-American author and poet (d. 1883)
1819  Maria II of Portugal (d. 1853)
1821  Linus Yale, Jr., American engineer and businessman (d. 1868)
1826  Zénobe Gramme, Belgian engineer, invented the Gramme machine (d. 1901)
1829  Owen Suffolk, Australian bushranger, poet, confidence-man and author
1835  John Hughlings Jackson, English physician and neurologist (d. 1911)
1842  Édouard Lucas, French mathematician and theorist (d. 1891)
1843  William Henry Jackson, American painter and photographer (d. 1942)
1846  Comte de Lautréamont, Uruguayan-French poet and educator (d. 1870)
1851  James Campbell, 1st Baron Glenavy, Irish lawyer and politician (d. 1931)
1853  Remy de Gourmont, French poet, novelist, and critic (d. 1915)
1868  Philippa Fawcett, English mathematician and educator (d. 1948)
1869  Mary Colter, American architect, designed the Desert View Watchtower (d. 1958)
1875  Pierre Monteux, Sephardic Jewish French-American viola player and conductor (d. 1964)
1876  Maurice de Vlaminck, French painter and poet (d. 1958)
1878  Stylianos Lykoudis, Greek admiral and historian (d. 1958)
1879  Gustav Goßler, German rower (d. 1940)
1884  James Alberione, Italian priest, founded the Society of St. Paul (d. 1971)
1884    Isoroku Yamamoto, Japanese admiral (d. 1943)
1886  Frank Luther Mott, American historian and journalist (d. 1964)
1888  Tris Speaker, American baseball player and manager (d. 1958)
1888    Zdzisław Żygulski, Sr., Polish historian and academic (d. 1975)
1889  Makhanlal Chaturvedi, Indian journalist, poet, and playwright (d. 1968)
1892  Italo Mus, Italian painter (d. 1967)
1895  Arthur Murray, American dancer and educator (d. 1991)
1896  Robert E. Sherwood, American playwright and screenwriter (d. 1955)
1897  Pierre Fresnay, French actor and screenwriter (d. 1975)
1897    Dina Manfredini, Italian-American super-centenarian (d. 2012)
1898  Agnes Ayres, American actress (d. 1940)
1899  Hillel Oppenheimer, German-Israeli botanist and academic (d. 1971)
1902  Louise Lévêque de Vilmorin, French journalist and author (d. 1969)
1902    Stanley G. Weinbaum, American author and poet (d. 1935)
1905  Eugène Bozza, French composer and conductor (d. 1991)
1905    Erika Nõva, Estonian architect and engineer (d. 1987)
1906  Bea Benaderet, Turkish-Jewish Irish-American television, radio, and voice actress (d. 1968)
1906    John Cameron Swayze, American journalist (d. 1995)
1907  Robert Askin, Australian sergeant and politician, 32nd Premier of New South Wales (d. 1981)
1910  Đặng Văn Ngữ, Vietnamese physician and academic (d. 1967)
1911  Max Dupain, Australian photographer (d. 1992)
1913  Dave Brown (rugby league)|Dave Brown, Australian rugby league player (d. 1974)
1913    Rosemary Lane (actress)|Rosemary Lane, American actress and singer (d. 1974)
1913    Frances Langford, American actress and singer (d. 2005)
1913    Jules Léger, Canadian lawyer and politician, 21st Governor General of Canada (d. 1980)
1913    Muddy Waters, American singer-songwriter and guitarist (d. 1983)
1914  Richard Coogan, American actor (d. 2014)
1914    Marguerite Duras, French novelist, screenwriter, and director (d. 1996)
 1914     David W. Goodall, Australian ecologist and botanist (d. 2018)
1915  Louis Archambault, Canadian sculptor (d. 2003)
1916  Nikola Ljubičić, Serbian general and politician, 10th List of Presidents of Serbia|President of Serbia (d. 2005)
1916    Mickey Owen, American baseball player and coach (d. 2005)
1916    David White (actor)|David White, American actor (d. 1990)
1918  George Jellicoe, 2nd Earl Jellicoe, English soldier and politician, Leader of the House of Lords (d. 2007)
1920  Orunamamu, American-Canadian author and educator (d. 2014)
1920    Ignatius IV of Antioch, Greek patriarch (d. 2012)
1921  Elizabeth Wilson, American actress (d. 2015)
1922  Elmer Bernstein, American composer and conductor (d. 2004)
1923  Peter Vaughan, English actor (d. 2016)
1923    Gene Reynolds, American actor, director, producer and screenwriter
1924  Bob Christie (racing driver)|Bob Christie, American racing driver (d. 2009)
1924    Gil Hodges, American baseball player and manager (d. 1972)
1925  Dettmar Cramer, German footballer and manager (d. 2015)
1925    Frank Truitt, American basketball player and coach (d. 2014)
1925    Claude Wagner, Canadian lawyer, judge, and politician (d. 1979)
1925    Emmett Williams, American poet and author (d. 2007)
1926  Mildred Fay Jefferson, American physician and activist (d. 2010)
1926    Ronnie Masterson, Irish actress (d. 2014)
1927  Joe Orlando, Italian-American author and illustrator (d. 1998)
1928  Maya Angelou, American memoirist and poet (d. 2014)
1928    Estelle Harris, American actress and comedian
1928    Jimmy Logan, Scottish actor, director, and producer (d. 2001)
1928    Monty Norman, English singer-songwriter and producer
1929  Humbert Allen Astredo, American actor (d. 2016)
1930  Netty Herawaty, Indonesian actress (d. 1989)
1931  James Dickens, English politician (d. 2013)
1931    Bobby Ray Inman, American admiral and intelligence officer
1931    Catherine Tizard, New Zealand politician, 16th List of Governors-General of New Zealand|Governor-General of New Zealand
1932  Clive Davis, American record producer, founded Arista Records and J Records
1932    Richard Lugar, American lieutenant and politician, 44th List of mayors of Indianapolis|Mayor of Indianapolis
1932    Anthony Perkins, American actor (d. 1992)
1932    Johanna Reiss, Dutch-American author
1932    Andrei Tarkovsky, Russian director and producer (d. 1986)
1933  Bill France, Jr., American businessman (d. 2007)
1933    Brian Hewson, English runner
1933    Bapu Nadkarni, Indian cricketer
1934  Helen Hanft, American actress (d. 2013)
1934    Kronid Lyubarsky, Russian journalist and activist (d. 1996)
1935  Geoff Braybrooke, English-New Zealand soldier and politician (d. 2013)
1935    Kenneth Mars, American actor and comedian (d. 2011)
1935    Trevor Griffiths, English playwright and educator
1938  A. Bartlett Giamatti, American businessman and academic (d. 1989)
1939  JoAnne Carner, American golfer
1939    Darlene Hooley, American educator and politician
1939    Hugh Masekela, South African trumpeter, flugelhornist, cornetist, composer, and singer (d. 2018)
1940  Richard Attwood, English race car driver
1940    Sharon Sheeley, American singer-songwriter (d. 2002)
1942  Jim Fregosi, American baseball player and manager (d. 2014)
1942    Kitty Kelley, American journalist and biographer
1942    Elizabeth Levy, American author
1944  Magda Aelvoet, Belgian politician
1944    Mary Kenny, Irish journalist, author, and playwright
1944    Bob McDill, American country music songwriter
1944    Craig T. Nelson, American actor, director, producer, and screenwriter
1944    Nelson Prudêncio, Brazilian triple jumper and educator (d. 2012)
1944    Toktamış Ateş, Turkish academician, political commentator, columnist and writer (d. 2013)
1945  Daniel Cohn-Bendit, French-German educator and politician
1945    Caroline McWilliams, American actress (d. 2010)
1946  Colin Coates, Australian speed skater
1946    Dave Hill, English guitarist
1946    Katsuaki Satō, Japanese martial artist and coach
1946    György Spiró, Hungarian author and playwright
1946    Bubba Wyche, American football player and coach
1947  Wiranto, Indonesian general and politician
1947    Ray Fosse, American baseball player and sportscaster
1947    Eliseo Soriano, Filipino minister and television host
1948  Abdullah Öcalan, Turkish activist
1948    Berry Oakley, American bass player (d. 1972)
1948    Richard Parsons (businessman)|Richard Parsons, American lawyer and businessman
1948    Dan Simmons, American author
1948    Derek Thompson (actor)|Derek Thompson, Northern Irish actor
1948    Pick Withers, English drummer
1949  Junior Braithwaite, Jamaican-American singer (d. 1999)
1949    Shing-Tung Yau, Chinese-American mathematician and academic
1950  Christine Lahti, American actress and director
1951  John Hannah (American football)|John Hannah, American football player and coach
1952  Rosemarie Ackermann, German high jumper
1952    Pat Burns, Canadian ice hockey player and coach (d. 2010)
1952    Gregg Hansford, Australian motorcycle racer (d. 1995)
1952    Cherie Lunghi, English actress and dancer
1952    Karen Magnussen, Canadian figure skater and coach
1952    Gary Moore, Northern Irish singer-songwriter, guitarist, and producer (d. 2011)
1952    Villy Søvndal, Danish educator and politician, List of Danish foreign ministers|Danish Minister of Foreign Affairs
1953  Robert Bertrand, Canadian politician
1953    Henry Fotheringham, South African cricketer
1953    Simcha Jacobovici, Canadian director, producer, journalist, and author
1953    Sammy Wilson (politician)|Sammy Wilson, Northern Irish politician, 31st Lord Mayor of Belfast
1953    Chen Yi (composer)|Chen Yi, Chinese violinist and composer
1956  Evelyn Hart, Canadian ballerina
1956    Tom Herr, American baseball player and manager
1956    David E. Kelley, American screenwriter and producer
1957  Paul Downton, English cricketer
1957    Aki Kaurismäki, Finnish director, producer, and screenwriter
1957    Graeme Kelling, Scottish guitarist (d. 2004)
1957    Nobuyoshi Kuwano, Japanese singer and trumpet player
1958  Peter Baltes, German bass player
1958    Cazuza, Brazilian singer-songwriter (d. 1990)
1958    Rodney Eade, Australian footballer and coach
1959  Phil Morris (actor)|Phil Morris, American actor and screenwriter
1960  Jonathan Agnew, English cricketer and sportscaster
1960    Jane Eaglen, English soprano
1960    Hugo Weaving, Nigerian-Australian actor and producer
1960    Godknows Igali, Nigerian diplomat, civil servant and technocrat
1961  Hildi Santo-Tomas, American interior decorator
1962  Craig Adams (musician)|Craig Adams, English bass player and songwriter
1962    Kailasho Devi, Indian social worker and politician
1963  A. Michael Baldwin, American actor, producer, and screenwriter
1963    Jack Del Rio, American football player and coach
1963    Dale Hawerchuk, Canadian ice hockey player and coach
1963    Jane McDonald, English singer and broadcaster
1963    Graham Norton, Irish actor and talk show host
1964  Branco (footballer)|Branco, Brazilian footballer and coach
1964    Dr. Chud, American drummer and singer
1964    Anthony Clark (actor)|Anthony Clark, American actor
1964    David Cross, American actor, producer, and screenwriter
1964    Đặng Thân, Vietnamese writer and poet
1965  Vinny Burns, English guitarist and producer
1965    Robert Downey Jr., American actor, producer, and screenwriter
1966  Nancy McKeon, American actress
1966    Mike Starr (musician)|Mike Starr, American bass player (d. 2011)
1966    Christos Tsekos (basketball)|Christos Tsekos, Greek basketball player
1967  Edith Masai, Kenyan-German runner
1967    George Mavrotas, Greek water polo player and politician
1968  Jesús Rollán, Spanish water polo player (d. 2006)
1969  Piotr Anderszewski, Polish pianist and composer
1969    Karren Brady, English journalist and businesswoman
1970  Georgios Amanatidis, Greek footballer and manager
1970    Greg Garcia (producer)|Greg Garcia, American director, producer, and screenwriter
1970    Barry Pepper, Canadian actor and producer
1970    Jason Stoltenberg, Australian tennis player
1970    Yelena Yelesina, Russian high jumper
1971  Yanic Perreault, Canadian ice hockey player and coach
1971    Josh Todd, American singer-songwriter and actor
1971    Malik Yusef, American actor, producer, and poet
1971    John Zandig, American wrestler and promoter
1972  Jim Dymock, Australian rugby league player and coach
1972    Jill Scott, American singer-songwriter and actress
1972    Magnus Sveningsson, Swedish bass player
1973  Chris Banks (American football)|Chris Banks, American football player (d. 2014)
1973    David Blaine, American magician and producer
1973    Loris Capirossi, Italian motorcycle racer
1973    Peter Hoekstra (footballer)|Peter Hoekstra, Dutch footballer and coach
1973    Chris McCormack (triathlete)|Chris McCormack, Australian triathlete and coach
1973    Kelly Price, American singer-songwriter
1975  Delphine Arnault, French businesswoman
1975    Thobias Fredriksson, Swedish skier
1975    Joyce Giraud, Puerto Rican-American model, television actress and producer, Miss Puerto Rico|Miss Puerto Rico 1994
1975    Pamela Ribon, American actress, screenwriter, and author
1975    Miranda Lee Richards, American singer-songwriter
1975    Scott Rolen, American baseball player
1975    Kevin Weekes, Canadian ice hockey player and sportscaster
1976  Nathan Blacklock, Australian rugby player
1976    Sébastien Enjolras, French race car driver (d. 1997)
1976    Emerson Ferreira da Rosa, Brazilian footballer
1976    James Roday, American actor, director, and screenwriter
1977  Stephan Bonnar, American mixed martial artist
1977    Keith Bulluck, American football player and sportscaster
1977    Adam Dutkiewicz, American guitarist, songwriter, and producer
1977    Stephen Mulhern, English magician and television host
1977    Omarr Smith, American football player and coach
1978  Jason Ellison, American baseball player and scout
1978    Alan Mahon, Irish footballer
1979  Heath Ledger, Australian actor (d. 2008)
1979    Roberto Luongo, Canadian ice hockey player
1979    Natasha Lyonne, American actress
1979    Andy McKee, American guitarist
1980  Johnny Borrell, English singer-songwriter and guitarist
1980    Trevor Moore (comedian)|Trevor Moore, American actor, director, producer, and screenwriter
1980    Eric Steinbach, American football player
1980    Björn Wirdheim, Swedish race car driver
1981  Currensy, American rapper
1981    Eduardo Luís Carloto, Brazilian footballer
1981    Casey Daigle, American baseball player
1981    Anna Pyatykh, Russian triple jumper
1981    Ned Vizzini, American author and screenwriter (d. 2013)
1982  Justin Cook, American voice actor and producer
1982    Magnus Lindgren (chef)|Magnus Lindgren, Swedish chef (d. 2012)
1983  Evgeny Artyukhin, Russian ice hockey player
1983    Ben Gordon, American basketball player
1983    Doug Lynch (ice hockey)|Doug Lynch, Canadian ice hockey player
1983    Natalie Pike, Scottish-English model and actress
1983    Amanda Righetti, American actress
1984  Sean May, American basketball player
1984    Arkady Vyatchanin, Russian swimmer
1985  Rudy Fernández (basketball)|Rudy Fernández, Spanish basketball player
1985    Dudi Sela, Israeli tennis player
1985    Ricardo Vilar, Brazilian footballer
1986  Eunhyuk, South Korean singer-songwriter and dancer
1986    Cameron Barker, Canadian ice hockey player
1986    Maurice Manificat, French skier
1986    Aiden McGeady, Scottish-born Irish footballer
1986    Alexander Tettey, Norwegian footballer
1987  Sami Khedira, German footballer
1987    McDonald Mariga, Kenyan footballer
1987    Cameron Maybin, American baseball player
1987    Marcos Vellidis, Greek footballer
1987    Sarah Gadon, Canadian actress
1988  Frank Fielding, English footballer
1989  Vurnon Anita, Dutch footballer
1989    Steven Finn (cricketer)|Steven Finn, English cricketer
1989    Chris Herd, Australian footballer
1991  Jack Cooley, American basketball player
1991    Justin O'Neill, Australian rugby league player
1991    Jamie Lynn Spears, American actress and singer
1991    Marlon Stöckinger, Filipino race car driver
1992  Lucy May Barker, English actress and singer
1992    Christina Metaxa, Cypriot singer-songwriter
1992    Ricky Dillon, American youtuber and singer
1993  Samir Carruthers, English footballer
1993    Cerys Hale, Welsh rugby player
1993    Frank Kaminsky, American basketball player
1994  Shunsuke Nishikawa, Japanese actor
1994    Risako Sugaya, Japanese singer and actress
1996  Austin Mahone, American singer-songwriter and actor
==Deaths==
 397  Ambrose, Roman archbishop and saint (b. 338)
 636  Isidore of Seville, Spanish archbishop and saint (b. 560)
 814  Plato of Sakkoudion, Byzantine monk and saint (b. 735)
 896  Pope Formosus|Formosus, pope of the Catholic Church (b. 816)
 911  Liu Yin (Southern Han)|Liu Yin, Chinese warlord and governor (b. 874)
 931  Kong Xun, Chinese official and governor (b. 884)
 968  Abu Firas al-Hamdani, Arab prince and poet (b. 932)
1284  Alfonso X of Castile|Alfonso X, king of Castile and León (b. 1221)
1292  Pope Nicholas IV|Nicholas IV, pope of the Catholic Church (b. 1227)
1406  Robert III of Scotland|Robert III, king of Scotland (b.1337)
1483  Henry Bourchier, 1st Earl of Essex (b. c. 1405)
1536  Frederick I, Margrave of Brandenburg-Ansbach (b. 1460)
1538  Elena Glinskaya, Grand Princess and regent of Russia
1588  Frederick II of Denmark|Frederick II, king of Denmark and Norway (b. 1534)
1596  Philip II, Duke of Brunswick-Grubenhagen (b. 1533)
1609  Carolus Clusius, Flemish botanist, mycologist, and academic (b. 1526)
1617  John Napier, Scottish mathematician, physicist, and astronomer (b. 1550)
1643  Simon Episcopius, Dutch theologian and academic (b. 1583)
1661  Alexander Leslie, 1st Earl of Leven, Scottish field marshal (b. 1580)
1743  Daniel Neal, English historian and author (b. 1678)
1761  Théodore Gardelle, Swiss painter (b. 1722)
1766  John Taylor (classical scholar)|John Taylor, English librarian and scholar (b. 1704)
1774  Oliver Goldsmith, Irish novelist, playwright and poet (b. 1728)
1792  James Sykes (Continental Congress)|James Sykes, American lawyer and politician (b. 1725)
1807  Jérôme Lalande, French astronomer and academic (b. 1732)
1817  André Masséna, French general (b. 1758)
1841  William Henry Harrison, American general and politician, 9th President of the United States (b. 1773)
1846  Solomon Sibley, American lawyer and politician, 1st List of mayors of Detroit|Mayor of Detroit (b. 1769)
1861  John McLean, American jurist and politician, 6th United States Postmaster General (b. 1785)
1863  Ludwig Emil Grimm, German painter and engraver (b. 1790)
1864  Joseph Pitty Couthouy, American commander and paleontologist (b. 1808)
1870  Heinrich Gustav Magnus, German chemist and physicist (b. 1802)
1874  Charles Ernest Beulé, French archaeologist and politician (b. 1826)
1875  Karl Mauch, German geographer and explorer (b. 1837)
1878  Richard M. Brewer, American criminal (b. 1850)
1879  Heinrich Wilhelm Dove, German physicist and meteorologist (b. 1803)
1883  Peter Cooper, American businessman and philanthropist, founded Cooper Union (b. 1791)
1890  Pierre-Joseph-Olivier Chauveau, Canadian lawyer and politician, 1st Premier of Quebec (b. 1820)
1890    Edmond Hébert, French geologist and academic (b. 1812)
1912  Charles Brantley Aycock, American lawyer and politician, 50th Governor of North Carolina (b. 1859)
1912    Isaac K. Funk, American minister, lexicographer, and publisher, co-founded Funk & Wagnalls (b. 1839)
1919  William Crookes, English chemist and physicist (b. 1832)
1919    Jacinta and Francisco Marto|Francisco Marto, Portuguese saint (b. 1908)
1923  John Venn, English mathematician and philosopher, created the Venn diagram (b. 1834)
1929  Karl Benz, German engineer and businessman, founded Mercedes-Benz (b. 1844)
1931  André Michelin, French businessman, co-founded the Michelin|Michelin Tyre Company (b. 1853)
1932  Wilhelm Ostwald, Latvian-German chemist and academic, Nobel Prize in Chemistry|Nobel Prize laureate (b. 1853)
1933  Elizabeth Bacon Custer, American author and educator (b. 1842)
1941  Emine Nazikedâ Kadınefendi, the first wife and chief consort of Sultan Mehmed VI (b. 1866)
1951  George Albert Smith, American religious leader, 8th President of The Church of Jesus Christ of Latter-day Saints (b. 1870)
1953  Carol II of Romania (b. 1893)
1957  E. Herbert Norman, Canadian historian and diplomat (b. 1909)
1958  Johnny Stompanato, American soldier and bodyguard (b. 1925)
1961  Harald Riipalu, Estonian military commander (b. 1912)
1961    Simion Stoilow, Romanian mathematician and academic (b. 1873)
1967  Al Lewis (lyricist)|Al Lewis, American songwriter (b. 1901)
1967    Héctor Scarone, Uruguayan footballer and manager (b. 1898)
1968  Martin Luther King Jr., American minister and activist, Nobel Peace Prize|Nobel Prize laureate (b. 1929)
1972  Adam Clayton Powell, Jr., American pastor and politician (b. 1908)
1972    Stefan Wolpe, German-American composer and academic (b. 1902)
1976  Harry Nyquist, Swedish engineer and theorist (b. 1889)
1977  Andrey Dikiy, Ukrainian-American journalist, historian, and politician (b. 1893)
1979  Zulfikar Ali Bhutto, Pakistani lawyer and politician, 4th President of Pakistan (b. 1928)
1979    Edgar Buchanan, American actor (b. 1903)
1980  Red Sovine, American singer-songwriter and guitarist (b. 1917)
1983  Gloria Swanson, American actress (b. 1899)
1983    Bernard Vukas, Croatian football player, played for 1953 FIFA's \"Rest of the World\" team against England at Wembley (b. 1927)
1984  Oleg Antonov, Russian-Ukrainian engineer and businessman, founded Antonov (b. 1906)
1985  Kate Roberts (author)|Kate Roberts, Welsh author and activist (b. 1891)
1987  C. L. Moore, American author and academic (b. 1911)
1987    Chögyam Trungpa, Tibetan guru, poet, and scholar (b. 1939)
1987    Sachchidananda Vatsyayan, Indian journalist and author (b. 1911)
1988  Zlatko Grgić, Croatian-Canadian animator, director, and screenwriter (b. 1931)
1991  Edmund Adamkiewicz, German footballer (b. 1920)
1991    Max Frisch, Swiss playwright and novelist (b. 1911)
1991    H. John Heinz III, American soldier and politician (b. 1938)
1991    Graham Ingels, American illustrator (b. 1915)
1992  Yvette Brind'Amour, Canadian actress and director (b. 1918)
1992    Jack Hamilton (footballer, born 1928)|Jack Hamilton, Australian footballer (b. 1928)
1992    Arthur Russell (musician)|Arthur Russell, American singer-songwriter and cellist (b. 1951)
1993  Alfred Mosher Butts, American game designer, invented Scrabble (b. 1899)
1993    Douglas Leopold, Canadian radio and television host (b. 1947)
1995  Kenny Everett, English radio and television host (b. 1944)
1995    Priscilla Lane, American actress (b. 1915)
1996  Barney Ewell, American runner and long jumper (b. 1918)
1996    Boone Guyton, American lieutenant and pilot (b. 1913)
1997  Leo Picard, German-Israeli geologist and academic (b. 1900)
1997    Alparslan Türkeş, Turkish colonel and politician, 39th List of Deputy Prime Ministers of Turkey|Deputy Prime Minister of Turkey (b. 1917)
1999  Lucille Lortel, American actress, artistic director and producer (b. 1900)
1999    Early Wynn, American baseball player and sportscaster (b. 1920)
2001  Liisi Oterma, Finnish astronomer (b. 1915)
2001    Ed Roth, American illustrator and engineer (b. 1932)
2001    Maury Van Vliet, American-Canadian academic (b. 1913)
2003  Anthony Caruso (actor)|Anthony Caruso, American actor (b. 1916)
2004  Briek Schotte, Belgian cyclist and coach (b. 1919)
2005  Edward Bronfman, Canadian businessman and philanthropist (b. 1924)
2007  Bob Clark, American actor, director, producer, and screenwriter (b. 1941)
2007    Karen Spärck Jones, English computer scientist and academic (b. 1935)
2008  Francis Tucker, South African race car driver (b. 1923)
2009  Maxine Cooper, American actress, activist and photographer (b. 1924)
2011  Scott Columbus, American drummer (b. 1956)
2011    Juliano Mer-Khamis, Israeli actor, director, and activist (b. 1958)
2012  A. Dean Byrd, American psychologist and academic (b. 1948)
2012    Anne Karin Elstad, Norwegian author and educator (b. 1938)
2012    Claude Miller, French director, producer, and screenwriter (b. 1942)
2012    Dubravko Pavličić, Croatian footballer (b. 1967)
2012    Roberto Rexach Benítez, American-Puerto Rican academic and politician, 10th President of the Senate of Puerto Rico (b. 1929)
2013  Bengt Blomgren, Swedish actor, director, and screenwriter (b. 1923)
2013    Roger Ebert, American journalist, critic, and screenwriter (b. 1942)
2013    Carmine Infantino, American illustrator (b. 1925)
2013    Tommy Tycho, Hungarian-Australian pianist, composer, and conductor (b. 1928)
2013    Ian Walsh (rugby league)|Ian Walsh, Australian rugby player and coach (b. 1933)
2013    Noboru Yamaguchi (author)|Noboru Yamaguchi, Japanese author (b. 1972)
2014  İsmet Atlı, Turkish wrestler and trainer (b. 1931)
2014    Wayne Henderson (musician)|Wayne Henderson, American trombonist and producer (b. 1939)
2014    Kumba Ialá, Bissau-Guinean soldier and politician, List of heads of state of Guinea-Bissau|President of Guinea-Bissau (b. 1953)
2014    Margo MacDonald, Scottish journalist and politician (b. 1943)
2014    Curtis Bill Pepper, American journalist and author (b. 1917)
2014    Muhammad Qutb, Egyptian author and academic (b. 1919)
2015  Jamaluddin Jarjis, Malaysian engineer and politician (b. 1951)
2015    Elmer Lach, Canadian ice hockey player and coach (b. 1918)
2015    Donald N. Levine, American sociologist and academic (b. 1931)
2015    Klaus Rifbjerg, Danish author and poet (b. 1931)
2016  Chus Lampreave, Spanish actress (b. 1930)
==Holidays and observances==
 Children's Day (Hong Kong, Taiwan)
 Christian Calendar of saints|feast day:
 Benedict the Moor
 Gaetano Catanoso
 Isidore of Seville
 Martin Luther King Jr. (Episcopal Church (USA))
 Reginald Heber (Anglican Church of Canada)
 Tigernach of Clones
 Zosimas of Palestine (Eastern Church)
 April 4 (Eastern Orthodox liturgics)
 Independence Day (Senegal)|Independence Day, celebrates the independence of Senegal from France (1960).
 International observance#April|International Day for Mine Awareness and Assistance in Mine Action
 Peace Day (Angola)
==External links==
 [http://news.bbc.co.uk/onthisday/hi/dates/stories/april/4 BBC: On This Day]
 {{NYT On this day|month=04|day=04}}
 [http://canadachannel.ca/todayincanadianhistory/index.php/April_4 Today in Canadian History]
