==Events==
1066  Edgar the Ætheling is proclaimed King of England, but is never crowned. He reigns until 10 December 1066.
1211  Battle of the Rhyndacus (1211)|Battle of the Rhyndacus: The Latin emperor Henry of Flanders defeats the Nicaean emperor Theodore I Laskaris.
1529  The Siege of Vienna ends as the Austrians rout the invading Turks, turning the tide against almost a century of unchecked conquest throughout eastern and central Europe by the Ottoman Empire.
1582  Pope Gregory XIII implements the Gregorian calendar. In Italy, Poland, Portugal, and Spain, October 4 of this year is followed directly by October 15.
1764  Edward Gibbon observes a group of friars singing in the ruined Temple of Jupiter Optimus Maximus|Temple of Jupiter in Rome, which inspires him to begin work on ''The History of the Decline and Fall of the Roman Empire''.
1783  The Montgolfier brothers' hot air balloon (tethered) makes the first human ascent, piloted by Jean-François Pilâtre de Rozier.
1793  Queen Marie Antoinette of France is tried and convicted in a swift, pre-determined trial in the Palais de Justice, Paris, and condemned to death the following day.
1815  Emperor Napoleon|Napoleon I begins his exile on Saint Helena in the Atlantic Ocean.
1863  American Civil War: The H. L. Hunley (submarine)|''H. L. Hunley'', the first submarine to sink a ship, sinks during a test, killing its inventor, Horace Lawson Hunley|Horace L. Hunley.
1864  American Civil War: The Battle of Glasgow, Missouri|Battle of Glasgow is fought, resulting in the surrender of Glasgow, Missouri and its Union garrison, to the Confederate States of America|Confederacy.
1878  The Edison Electric Light Company begins operation.
1888  The From Hell letter|\"From Hell\" letter allegedly sent by Jack the Ripper is received by investigators.
1894  The Dreyfus affair: Alfred Dreyfus is arrested for spying.
1904  The Russian Baltic Fleet leaves Reval, Estonia for Lüshunkou|Port Arthur during the Russo-Japanese War.
1910  America (airship)|Airship America is launched from New Jersey in the first attempt to cross the Atlantic by a powered aircraft.
1917  World War I: At Vincennes outside Paris, Dutch dancer Mata Hari is executed by firing squad for espionage|spying for the German Empire.
1923  The German Rentenmark is introduced in Germany to counter hyperinflation in the Weimar Republic.
1928  The airship, ''LZ 127 Graf Zeppelin|Graf Zeppelin'' completes its first trans-Atlantic flight, landing at Lakehurst, New Jersey, United States.
1932  Tata Airlines (later to become Air India) makes its first flight.
1934  The Jiangxi Soviet|Soviet Republic of China collapses when Chiang Kai-shek's National Revolutionary Army successfully encircles Ruijin, forcing the fleeing Communist Party of China|Communists to begin the Long March.
1939  The New York Municipal Airport (later renamed LaGuardia Airport) is dedicated.
1940  The President of the Generalitat of Catalonia|President of Catalonia, Lluís Companys, is executed by the Spanish dictatorship of Francisco Franco, making him the only European president to have been executed.
1944  The Arrow Cross Party (very similar to Adolf Hitler|Hitler's NSDAP (Nazi party)) takes power in Hungary.
1945  World War II: The former premier of Vichy France Pierre Laval is shot by a firing squad for treason.
1951  Mexican chemist Luis E. Miramontes conducts the very last step of the first synthesis of norethisterone, the progestin that would later be used in one of the first three combined oral contraceptive pill|oral contraceptives.
1951    The first episode of ''I Love Lucy'', an American television sitcom starring Lucille Ball, Desi Arnaz, Vivian Vance, and William Frawley, airs on the Columbia Broadcasting System (CBS).
1953  British nuclear test ''Totem 1'' is detonated at Emu Field, South Australia.
1954  Hurricane Hazel devastates the eastern seaboard of North America, killing 95 and causing massive floods as far north as Toronto.  As a Saffir–Simpson hurricane wind scale|Category 4 upon landfall, it is the strongest storm on record to strike as far north as North Carolina.
1956  Fortran, the first modern computer language, is shared with the coding community for the first time.
1965  Vietnam War: The Catholic Worker Movement stages an anti-war rally in Manhattan including a public Draft-card burning|burning of a draft card; the first such act to result in arrest under a new amendment to the Selective Service Act.
1966  The Black Panther Party is created by Huey P. Newton and Bobby Seale.
1969  Vietnam War; The Moratorium to End the War in Vietnam is held in Washington D.C. and across the US. Over two million demonstrate nationally; about 250,000 in Washington D.C..
1970  Thirty-five construction workers are killed when a section of the new West Gate Bridge in Melbourne collapses.
1979  Black Monday (Malta)|Black Monday in Malta. The building of the ''Times of Malta'', the residence of the opposition leader Eddie Fenech Adami and several Nationalist Party (Malta)|Nationalist Party clubs are ransacked and destroyed by supporters of the Malta Labour Party.
1989  Wayne Gretzky becomes the all-time leading points scorer in the NHL.
1990  Soviet Union leader Mikhail Gorbachev is awarded the Nobel Peace Prize for his efforts to lessen Cold War tensions and open up his nation.
1991  The \"Oh-My-God particle\", an ultra-high-energy cosmic ray measured at 40,000,000 times that of the highest energy protons produced in a particle accelerator is observed at the University of Utah High Resolution Fly's Eye Cosmic Ray Detector|HiRes observatory in Dugway Proving Ground, Utah.
1995  Marco Campos is killed in an accident in an International Formula 3000 race at the Circuit de Nevers Magny-Cours circuit, making him the only driver ever killed in the International Formula 3000 series.
1997  The first supersonic land speed record is set by Andy Green in ''ThrustSSC'' (United Kingdom), 50 years and one day after Chuck Yeager first broke the sound barrier in the Earth's atmosphere.
1997    The Cassini–Huygens|Cassini probe launches from Cape Canaveral on its way to Saturn.
2001  NASA's Galileo spacecraft passes within 112 miles of Jupiter's moon Io (moon)|Io.
2003  China launches Shenzhou 5, its first manned space mission.
2005  2005 Toledo riot|A riot in Toledo, Ohio breaks out during a Neo-Nazism|National Socialist/Neo-Nazi protest; over 100 are arrested.
2006  2006 Kiholo Bay earthquake|Kiholo Bay earthquake: A magnitude 6.7 earthquake rocks Hawaii, causing property damage, injuries, landslides, power outages, and the closure of Honolulu International Airport.
2007  Seventeen activists in New Zealand are arrested in the country's first post-9/11 2007 New Zealand police raids|anti-terrorism raids.
2008  The Dow Jones Industrial Average closes down 733.08 points, or 7.87%, the second Black Monday (1987)|worst day in the Dow's history based on a percentage drop.
2011  The 15 October 2011 global protests|2011 Global Protests occur.
2013  A 7.2-Surface wave magnitude|magnitude 2013 Bohol earthquake|earthquake strikes the Philippines, resulting in more than 215 deaths.
2016  150 nations meet at the United Nations Environment Programme (UNEP) summit in Rwanda and agree to phase out hydrofluorocarbons (HFCs) as an amendment to the Montreal Protocol.
==Births==
99 BC  Lucretius, Roman poet and philosopher (d. 55 BCE)
70 BC  Virgil, Roman poet (d. 19 BC)
1218  Hulagu Khan, Mongol ruler (d. 1265)
1265  Temür Khan, Emperor Chengzong of Yuan (d. 1307)
1440  Henry III, Landgrave of Upper Hesse, German noble (d. 1483)
1471  Konrad Mutian, German epigrammatist and academic (d. 1526)
1542  Akbar, Mughal emperor (d. 1605)
1561  Richard Field (theologian)|Richard Field, English cathedral dean (d. 1616)
1564  Henry Julius, Duke of Brunswick-Lüneburg (d. 1613)
1599  Cornelis de Graeff, Dutch mayor and regent of Amsterdam (d. 1664)
1608  Evangelista Torricelli, Italian physicist and mathematician (d. 1647)
1622  Magnus Gabriel De la Gardie, Swedish statesman and military man (d. 1686)
1686  Allan Ramsay (poet)|Allan Ramsay, Scottish poet and playwright (d. 1758)
1701  Marie-Marguerite d'Youville, Canadian nun and saint, founded Grey Nuns (d. 1771)
1711  Elisabeth Therese of Lorraine (d. 1741)
1762  Samuel Adams Holyoke, American composer and educator (d. 1820)
1767  Gabriel Richard, French-born American Catholic Church|Roman Catholic priest, missionary, educator, and politician (d. 1832)
1784  Thomas Robert Bugeaud, French general and politician, List of rulers of Algeria before independence|Governor-General of Algeria (d. 1849)
1785  José Miguel Carrera, Chilean general and politician (d. 1821)
1789  William Christopher Zeise, Danish chemist who prepared Zeise's salt, one of the first organometallic compounds (d. 1847)
1814  Mikhail Lermontov, Russian author, poet, and painter (d. 1841)
1816  John Robertson (premier)|John Robertson, English-Australian politician, 5th Premier of New South Wales (d. 1891)
1818  Alexander Dreyschock, Czech pianist and composer (d. 1869)
1825  Marie of Prussia (d. 1889)
1829  Asaph Hall, American astronomer and academic (d. 1907)
1833  John Alexander MacPherson, Australian politician, 7th Premier of Victoria (d. 1894)
1836  James Tissot, French painter and illustrator (d. 1902)
1840  Honoré Mercier, Canadian journalist, lawyer, and politician, 9th Premier of Quebec (d. 1894)
1844  Friedrich Nietzsche, German composer, poet, and philosopher (d. 1900)
1858  John L. Sullivan, American boxer, actor, and journalist (d. 1918)
1865  Charles W. Clark, American singer and educator (d. 1925)
1872  Wilhelm Miklas, Austrian educator and politician, 3rd President of Austria (d. 1956)
1872    August Nilsson, Swedish pole vaulter, shot putter, and tug of war competitor (d. 1921)
1874  Alfred, Hereditary Prince of Saxe-Coburg and Gotha (d. 1899)
1878  Paul Reynaud, French lawyer and politician, 118th Prime Minister of France (d. 1966)
1879  Jane Darwell, American actress (d. 1967)
1881  P. G. Wodehouse, English novelist and playwright (d. 1975)
1882  Charley O'Leary, American baseball player and coach (d. 1941)
1884  Archibald Hoxsey, American pilot (d. 1910)
1887  Frederick Fleet, English sailor (d. 1965)
1888  S. S. Van Dine, American author and critic (d. 1939)
1890  Álvaro de Campos, Portuguese poet and engineer (d. 1935)
1893  Carol II of Romania (d. 1953)
1894  Moshe Sharett, Ukrainian-Israeli lieutenant and politician, 2nd Prime Minister of Israel (d. 1965)
1897  Johannes Sikkar, Estonian soldier and politician, Prime Minister of Estonia in exile (d. 1960)
1899  Adolf Brudes, Polish-German race car driver (d. 1986)
1900  Mervyn LeRoy, American actor, director, and producer (d. 1987)
1901  Enrique Jardiel Poncela, Spanish playwright and novelist (d. 1952)
1905  C. P. Snow, English chemist and author (d. 1980)
1906  Hiram Fong, American soldier and politician (d. 2004)
1906    Alicia Patterson, American journalist and publisher, co-founded ''Newsday'' (d. 1963)
1906    Victoria Spivey, American singer-songwriter and pianist (d. 1976)
1907  Varian Fry, American journalist and author (d. 1967)
1908  Herman Chittison, American pianist (d. 1967)
1908    John Kenneth Galbraith, Canadian-American economist and diplomat, 7th United States Ambassador to India (d. 2006)
1909  Jesse L. Greenstein, American astronomer and academic (d. 2002)
1909    Robert Trout, American journalist (d. 2000)
1910  Edwin O. Reischauer, Japanese-American scholar and diplomat, United States Ambassador to Japan (d. 1990)
1912  Nellie Lutcher, American singer and pianist (d. 2007)
1913  Wolfgang Lüth, German commander (d. 1945)
1914  Mohammed Zahir Shah, Afghan king (d. 2007)
1916  Al Killian, American trumpet player and bandleader (d. 2007)
1916    George Turner (writer)|George Turner, Australian author and critic (d. 1997)
1917  Jan Miner, American actress (d. 2004)
1917    Arthur M. Schlesinger Jr., American historian and critic (d. 2007)
1917    Paul Tanner, American trombonist and educator (d. 2013)
1919  Malcolm Ross (balloonist)|Malcolm Ross, American captain, balloonist, and physicist (d. 1985)
1919    Chuck Stevenson, American race car driver (d. 1995)
1920  Chris Economaki, American sportscaster and actor (d. 2012)
1920    Patricia Jessel, Hong Kong-English actress (d. 1968)
1920    Mario Puzo, American author and screenwriter (d. 1999)
1920    Henri Verneuil, Turkish-French director, producer, and screenwriter (d. 2002)
1921  Angelica Rozeanu, Romanian-Israeli table tennis player (d. 2006)
1922  Agustina Bessa-Luís, Portuguese author
1922    Preben Munthe, Norwegian economist and politician, State Conciliator of Norway (d. 2013)
1922    William Y. Thompson, American historian and author (d. 2013)
1923  Italo Calvino, Italian novelist, short story writer, and journalist (d. 1985)
1923    Antonio Fontán, Spanish journalist and politician (d. 2010)
1923    Eugene Patterson, American journalist and activist (d. 2013)
1923    Lindsay Thompson, Australian politician, 40th Premier of Victoria (d. 2008)
1924  Marguerite Andersen, German-Canadian author and educator
1924    Lee Iacocca, American businessman and author
1924    Warren Miller (director)|Warren Miller, American director and screenwriter (d. 2018)
1925  Mickey Baker, American-French guitarist (d. 2012)
1925    Aurora Bautista, Spanish actress (d. 2012)
1925    Tony Hart, English painter and television host (d. 2009)
1926  James E. Akins, American soldier and diplomat, United States Ambassador to Saudi Arabia (d. 2010)
1926    Agustín García Calvo, Spanish philosopher and poet (d. 2012)
1926    Michel Foucault, French historian and philosopher (d. 1984)
1926    Ed McBain, American author and screenwriter (d. 2005)
1926    Jean Peters, American actress (d. 2000)
1926    Karl Richter (conductor)|Karl Richter, German organist and conductor (d. 1981)
1927  B. S. Abdur Rahman, Indian businessman and philanthropist (d. 2015)
1929  Will Insley, American painter and architect (d. 2011)
1930  FM-2030, Belgian-Iranian basketball player, philosopher and diplomat (d. 2000)
1931  Freddy Cole, American singer and pianist
1931    Gail Harris (baseball)|Gail Harris, American baseball player and coach (d. 2012)
1931    A. P. J. Abdul Kalam, Indian engineer, academic, and politician, 11th President of India (d. 2015)
1931    Pauline Perry, Baroness Perry of Southwark, English academic and politician
1932  Jaan Rääts, Estonian guitarist and composer
1933  Nicky Barnes, American drug lord
1934  Alan Elsdon, English trumpet player (d. 2016)
1934    N. Ramani, Indian flute player (d. 2015)
1935  Barry McGuire, American singer-songwriter and guitarist
1935    Dick McTaggart, Scottish boxer
1935    Bobby Morrow, American sprinter
1935    Willie O'Ree, Canadian ice hockey player
1936  Michel Aumont, French actor
1936    Robert Baden-Powell, 3rd Baron Baden-Powell, South African-English businessman
1937  Linda Lavin, American actress and singer
1938  Marv Johnson, American singer-songwriter and pianist (d. 1993)
1938    Brice Marden, American painter
1938    Robert Ward (blues musician)|Robert Ward, American guitarist and songwriter (d. 2008)
1940  Tommy Bishop, English rugby league player and coach
1940    Peter C. Doherty, Australian surgeon and immunologist, Nobel Prize in Physiology or Medicine|Nobel Prize laureate
1941  Roy Masters (rugby league)|Roy Masters, Australian rugby league coach, journalist, and author
1942  Hilo Chen, Taiwanese-American painter
1942    Harold W. Gehman, Jr., American admiral
1942    Don Stevenson, American singer-songwriter and drummer
1943  Penny Marshall, American actress, director, and producer
1944  Sali Berisha, Albanian cardiologist and politician, 2nd President of Albania
1944    A. Chandranehru, Sri Lankan Tamil merchant seaman and politician (d. 2005)
1944    Haim Saban, Israeli-American businessman, co-founded Saban Entertainment
1944    David Trimble, Northern Irish lawyer and politician, 3rd First Minister of Northern Ireland, Nobel Peace Prize|Nobel Prize laureate
1945  Steve Camacho, Guyanese cricketer (d. 2015)
1945    Antonio Cañizares Llovera, Spanish cardinal
1945    Dave Hill (actor)|Dave Hill, English actor
1945    Neophyte of Bulgaria, Bulgarian patriarch
1945    Jim Palmer, American baseball player and sportscaster
1946  Victor Banerjee, Indian actor and director
1946    Richard Carpenter (musician)|Richard Carpenter, American singer-songwriter and pianist
1946    Palle Danielsson, Swedish bassist and composer
1946    Stewart Stevenson, Scottish engineer and politician, Minister for Environment and Climate Change
1947  Hümeyra, Turkish singer-songwriter and actress
1947    Jaroslav Erno Šedivý, Czech drummer
1948  Renato Corona, Filipino lawyer and jurist, 23rd Chief Justice of the Supreme Court of the Philippines (d. 2016)
1948    Chris de Burgh, British-Irish singer-songwriter and pianist
1949  Laurie McBain, American author
1949    Prannoy Roy, Indian journalist, economist, and broadcaster, founded NDTV
1950  Candida Royalle, American porn actress, director, and producer (d. 2015)
1951  Atoy Co, Filipino basketball player, coach, and actor
1951    Peter Richardson (English director)|Peter Richardson, English actor, director, and screenwriter
1951    Roscoe Tanner, American tennis player
1951    Rafael Vaganian, Armenian chess player
1951    A. F. Th. van der Heijden, Dutch author
1953  Betsy Clifford, Canadian skier
1953    Tito Jackson, American singer-songwriter and guitarist
1953    Larry Miller (comedian)|Larry Miller, American actor and screenwriter
1953    Peter Phillips (conductor)|Peter Phillips, English conductor and musicologist
1953    Walter Jon Williams, American author
1954  Peter Bakowski, Australian poet and educator
1954    Steve Bracks, Australian politician, 44th Premier of Victoria
1954    Jere Burns, American actor
1954    Princess Friederike of Hanover
1954    Julia Yeomans, English physicist and academic
1955  Kulbir Bhaura, Indian field hockey player
1955    Emma Chichester Clark, English author and illustrator
1957  Michael Caton-Jones, Scottish actor, director, and producer
1957    Mira Nair, Indian-American actress, director, and producer
1957    Stacy Peralta, American skateboarder, director, producer, and businessman, co-founded Powell Peralta
1958  Stephen Clarke (writer)|Stephen Clarke, English-French journalist and author
1959  Sarah, Duchess of York
1959    Emeril Lagasse, American chef and author
1959    Alex Paterson, English keyboard player
1959    Todd Solondz, American actor, director, and screenwriter
1961  Vyacheslav Butusov, Russian singer-songwriter and guitarist
1963  Stanley Menzo, Dutch footballer and manager
1964  Roberto Vittori, Italian colonel, pilot, and astronaut
1965  Nasser El Sonbaty, German bodybuilder and trainer (d. 2013)
1966  Jorge Campos, Mexican footballer and manager
1966    Bill Charlap, American pianist and composer
1966    Ilse Huizinga, Dutch singer
1966    Dave Stead, English drummer
1967  Götz Otto, German actor and screenwriter
1967    Dan Forest, American politician, 34th Lieutenant Governor of North Carolina
1968  Didier Deschamps, French footballer and manager
1968    Vanessa Marcil, American actress
1968    Rod Wishart, Australian rugby league player
1968    Trent Zimmerman, Australian politician
1969  Vítor Baía, Portuguese footballer
1969    Dominic West, English actor and director
1970  Eric Benét, American musician
1970    Ginuwine, American singer-songwriter, dancer, and actor
1970    Pernilla Wiberg, Swedish skier
1971  Joey Abs, American wrestler
1971    Andy Cole, English footballer and coach
1971    Lauri Pilter, Estonian author and translator
1972  Fred Hoiberg, American basketball player and coach
1972    Matt Keeslar, American actor
1972    Michél Mazingu-Dinzey, German-Congolese footballer and manager
1973  Aleksandr Filimonov, Russian footballer
1973    Maria Hjorth, Swedish golfer
1974  Ömer Çatkıç, Turkish footballer
1974    Bianca Rinaldi, Brazilian actress
1975  Alessandro Doga, Italian footballer
1975    Glen Little, English footballer and manager
1976  Christian Allen, American video game designer
1976    Manuel Dallan, Italian rugby player
1977  Masato Kawabata, Japanese race car driver
1977    David Trezeguet, French footballer
1977    Patricio Urrutia, Ecuadorian footballer
1978  Devon Gummersall, American actor, director, and screenwriter
1978    Takeshi Morishima, Japanese wrestler
1979  Blue Adams, American football player and coach
1979    Bohemia (rapper)|Bohemia, Pakistani-American rapper and producer
1979    Jekaterina Golovatenko, Estonian figure skater
1979    Paul Robinson (footballer, born 1979)|Paul Robinson, English footballer
1979    Jaci Velasquez, American singer-songwriter and actress
1979    Māris Verpakovskis, Latvian footballer
1980  Tom Boonen, Belgian cyclist
1980    Siiri Nordin, Finnish singer-songwriter
1981  Keyshia Cole, American singer-songwriter and producer
1981    Elena Dementieva, Russian tennis player
1981    Radoslav Židek, Slovak snowboarder
1982  Paulini, Fijian-Australian singer
1982    Sachiko Yamada (swimmer)|Sachiko Yamada, Japanese swimmer
1983  Bruno Senna, Brazilian race car driver
1983    Stephy Tang, Hong Kong singer
1984  Izale McLeod, English footballer
1984    Johan Voskamp, Dutch footballer
1984    Jessie Ware, English singer-songwriter
1985  Arron Afflalo, American basketball player
1985    Walter Alberto López, Uruguayan footballer
1985    Marcos Martínez, Spanish race car driver
1986  Lee Donghae, South Korean singer-songwriter
1986    Carlo Janka, Swiss skier
1986    Nolito, Spanish footballer
1987  Jesse Levine, Canadian-American tennis player
1987    Chantal Strand, Canadian voice actress and singer
1987    Ott Tänak, Estonian race car driver
1988  Lassy Mbouity, Congolese writer and politician
1988  Mesut Özil, German footballer
1989  Blaine Gabbert, American football player
1989    Leandro Antonio Martínez, Argentinian-Italian footballer
1989    Anthony Joshua, British Professional Boxer
1990  Jeon Ji-yoon, South Korean singer-songwriter and dancer
1994  Stephen Arthurworrey, English footballer
1994    Lil' Kleine, Dutch rapper
1995  Jakob Pöltl, Austrian basketball player
1996  Zelo, South Korean rapper and dancer
1996    Charly Musonda (footballer, born 1996)|Charly Musonda, Belgian footballer
1999  Bailee Madison, American actress
==Deaths==
 412  Pope Theophilus of Alexandria|Theophilus, Patriarch of Alexandria
 892  Al-Mu'tamid, Muslim caliph of the Abbasid Caliphate
 898  Lambert of Italy (b. 880)
 912  Abdullah ibn Muhammad al-Umawi, Spanish emir (b. 844)
 925  Rhazes, Persian polymath (b. 864)
 961  Abd-ar-Rahman III|Abd-al-Rahman III, caliph of Córdoba
1002  Henry I, Duke of Burgundy|Otto-Henry, Duke of Burgundy (b. 946)
1080  Rudolf of Rheinfelden (b. 1025)
1243  Hedwig of Silesia, Polish saint (b. 1174)<ref>[http://www.newadvent.org/cathen/07189a.htm Kirsch, Johann Peter. \"St. Hedwig.\" The Catholic Encyclopedia] Vol. 7. New York: Robert Appleton Company, 1910, accessdate=2007-02-18</ref>
1173  Petronilla of Aragon (b. 1135)
1326  Walter de Stapledon, English bishop and politician, Lord High Treasurer (b. 1261)
1385  Dionysius I, Metropolitan of Moscow
1389  Pope Urban VI (b. 1318)
1404  Marie of Valois (1344-1404)|Marie Valois, French princess (b. 1344)<ref name=\"Arras234\">Jean d'Arras, ''Melusine; or, The Noble History of Lusignan'', transl. Donald Maddox, (The Pennsylvania State University Press, 2012), 234.</ref>
1496  Gilbert, Count of Montpensier (b. 1443)
1564  Andreas Vesalius, Belgian-Greek anatomist, physician, and author (b. 1514)
1622  Magnus Gabriel De la Gardie, Swedish statesman and military man (d. 1686)
1674  Robert Herrick (poet)|Robert Herrick, English poet (b. 1591)
1684  Géraud de Cordemoy, French historian, philosopher and lawyer (b. 1626)
1690  Juan de Valdés Leal, Spanish painter and illustrator (b. 1622)
1715  Humphry Ditton, English mathematician and  philosopher (b. 1675)
1788  Samuel Greig, Scottish-Russian admiral (b. 1735)
1810  Alfred Moore, American captain and judge (b. 1755)
1811  Nathaniel Dance-Holland, English painter and politician (b. 1735)
1817  Tadeusz Kościuszko, Polish-Lithuanian general and engineer (b. 1746)
1819  Sergey Vyazmitinov, Russian general and politician, Saint Petersburg Governorate|War Governor of Saint Petersburg (b. 1744)
1820  Karl Philipp, Prince of Schwarzenberg (b. 1771)
1837  Ivan Dmitriev, Russian poet and politician, List of Ministers of Justice of Imperial Russia|Russian Minister of Justice (b. 1760)
1891  Gilbert Arthur à Beckett, English author and songwriter (b. 1837)
1900  Zdeněk Fibich, Czech pianist and composer (b. 1850)
1910  Stanley Ketchel, American boxer (b. 1886)
1917  Mata Hari, Dutch dancer and spy (b. 1876)
1918  Sai Baba of Shirdi, Indian guru and saint (b. 1838)
1930  Herbert Henry Dow, Canadian-American businessman, founded the Dow Chemical Company (b. 1866)
1934  Raymond Poincaré, French lawyer and politician, 10th President of France (b. 1860)
1940  Lluís Companys, Catalan lawyer and politician, President of Catalonia (b. 1882)
1945  Pierre Laval, French lawyer and politician, 101st Prime Minister of France (b. 1883)
1946  Hermann Göring, German general and politician (b. 1893)
1948  Edythe Chapman, American actress (b. 1863)
1955  Fumio Hayasaka, Japanese composer (b. 1914)
1958  Asaf Halet Çelebi, Turkish poet and author (b. 1907)
1958  Elizabeth Alexander (scientist)|Elizabeth Alexander, British geologist, academic, and physicist (b. 1908)
1959  Stepan Bandera, Ukrainian soldier and politician (b. 1909)
1959    Lipót Fejér, Hungarian mathematician and academic (b. 1880)
1960  Clara Kimball Young, American actress and producer (b. 1890)
1961  Suryakant Tripathi 'Nirala', Indian poet and author (b. 1896)
1963  Horton Smith, American golfer and captain (b. 1908)
1964  Cole Porter, American composer and songwriter (b. 1891)
1965  Abraham Fraenkel, German-Israeli mathematician and academic (b. 1891)
1966  Frederick Montague, 1st Baron Amwell, English lieutenant and politician (b. 1876)
1968  Virginia Lee Burton, American author and illustrator (b. 1909)
1976  Carlo Gambino, Italian-American mob boss (b. 1902)
1978  W. Eugene Smith, American photojournalist (b. 1918)
1980  Mikhail Lavrentyev, Russian physicist and mathematician (b. 1900)
1980    Apostolos Nikolaidis (athlete)|Apostolos Nikolaidis, Greek footballer and volleyball player (b. 1896)
1981  Philip Fotheringham-Parker, English race car driver (b. 1907)
1983  Pat O'Brien (actor)|Pat O'Brien, American actor (b. 1899)
1987  Thomas Sankara, Burkinabe captain and politician, 5th President of Burkina Faso (b. 1949)
1987    Donald Wandrei, American author and poet (b. 1908)
1988  Kaikhosru Shapurji Sorabji, English pianist, composer, and critic (b. 1892)
1990  Delphine Seyrig, French actress and director (b. 1932)
1993  Aydın Sayılı, Turkish historian and academic (b. 1913)
1994  Sarah Kofman, French philosopher and academic (b. 1934)
1995  Bengt Åkerblom, Swedish ice hockey player (b. 1967)
1995    Marco Campos, Brazilian race car driver (b. 1976)
1999  Josef Locke, British-Irish soldier, policeman, tenor and actor (b. 1917)
2000  Konrad Emil Bloch, Polish-American biochemist and academic, Nobel Prize in Physiology or Medicine|Nobel Prize laureate (b. 1912)
2000    Vincent Canby, American journalist and critic (b. 1924)
2003  Ben Metcalfe, Canadian journalist and activist (b. 1919)
2005  Jason Collier, American basketball player (b. 1977)
2005    Matti Wuori, Finnish lawyer and politician (b. 1945)
2007  Piet Boukema, Dutch jurist and politician (b. 1933)
2008  Edie Adams, American actress and singer (b. 1927)
2008    Fazıl Hüsnü Dağlarca, Turkish soldier and poet (b. 1914)
2008    Jack Narz, American game show host and announcer (b. 1922)
2009  Heinz Versteeg, Dutch-German footballer (b. 1939)
2010  Richard C. Miller, American photographer (b. 1912)
2010    Mildred Fay Jefferson, American physician and activist (b. 1926)
2010    Johnny Sheffield, American actor (b. 1931)
2011  Betty Driver, English actress, singer, and author (b. 1920)
2012  Claude Cheysson, French lieutenant and politician, Minister of Foreign Affairs (France)|French Minister of Foreign Affairs (b. 1920)
2012    Erol Günaydın, Turkish actor and screenwriter (b. 1933)
2012    Maria Petrou, Greek-English computer scientist and academic (b. 1953)
2012    Norodom Sihanouk, Cambodian politician, 1st Prime Minister of Cambodia (b. 1922)
2012    Pat Ward, American lawyer and politician (b. 1957)
2013  Donald Bailey (musician)|Donald Bailey, American drummer (b. 1933)
2013    Nevill Drury, English-Australian journalist and publisher (b. 1947)
2013    Cancio Garcia, Filipino lawyer and jurist (b. 1937)
2013    Gloria Lynne, American singer (b. 1931)
2013    Rudy Minarcin, American baseball player and coach (b. 1930)
2013    Hans Riegel, German businessman (b. 1923)
2014  Giovanni Reale, Italian philosopher and historian (b. 1931)
2014    Jiří Reynek, Czech poet and graphic designer (b. 1929)
2014    Robert Tiernan, American lawyer and politician (b. 1929)
2014    Nobby Wirkowski, American-Canadian football player and coach (b. 1926)
2015  Sergei Filippenkov, Russian footballer and manager (b. 1971)
2015    Nate Huffman, American basketball player (b. 1975)
2015    Neill Sheridan, American baseball player (b. 1921)
2015    Kenneth D. Taylor, Canadian businessman and diplomat (b. 1934)
2015    Tyrone Young, American football player (b. 1960)
2017  Chinggoy Alonzo, Filipino theater, movie & television actor (b. 1950)
==Holidays and observances==
International Day of Rural Women (United Nations)
Public holidays in Burkina Faso|Anniversary of the 1987 Coup d'État (Burkina Faso)
Breast Health Day (Europe)
Christian feast day:
Bruno of Querfurt
Cúan of Ahascragh
Teresa of Ávila
Thecla of Kitzingen
October 15 (Eastern Orthodox liturgics)
Earliest day on which Heroes' Day can fall, while October 21 is the latest; celebrated on the third Monday in October. (Jamaica)
Earliest day on which Mother's Day can fall, while October 21 is the latest; celebrated on the third Monday in October. (Argentina)
Earliest day on which Sweetest Day can fall, while October 21 is the latest; celebrated on the third Saturday in October. (Great Lakes region)
Evacuation Day (Tunisia)
Global Handwashing Day
UNRIC#UN international days and observances|International Day of Rural Women (United Nations)
King Father's Commemoration Day (Cambodia)
National Latino AIDS Awareness Day (United States)
Pregnancy and Infant Loss Remembrance Day (Canada, the United States, the UK and Italy)
Teachers' Day (Brazil)
White Cane Safety Day (United States)
World Students' Day
== References ==
==External links==
 [http://news.bbc.co.uk/onthisday/hi/dates/stories/october/15 BBC: On This Day]
 {{NYT On this day|month=10|day=15}}
 [http://www1.sympatico.ca/cgi-bin/on_this_day?mth=Oct&day=15 On This Day in Canada]
