==Events==
42 BC  Liberators' civil war: Second Battle of Philippi  Mark Antony and Augustus|Octavian decisively defeat Marcus Junius Brutus the Younger|Brutus's army. Brutus commits suicide.
425  Valentinian III is elevated as Roman emperor at the age of six.
501  The Synodus Palmaris, called by Goths|Gothic king Theoderic the Great, discharges Pope Symmachus of all charges, thus ending the schism of Antipope Laurentius.
1086  At the Battle of Sagrajas, the army of Yusuf ibn Tashfin defeats the forces of Kingdom of Castile|Castilian King Alfonso VI of León and Castile|Alfonso VI.
1157  The Battle of Grathe Heath ends the civil war in Denmark. King Sweyn III of Denmark|Sweyn III is killed and Valdemar I of Denmark|Valdemar I restores the country.
1295  The first treaty forming the Auld Alliance between Kingdom of Scotland|Scotland and France against Kingdom of England|England is signed in Paris.
1641  Irish Catholic gentry from Ulster tried to Irish Rebellion of 1641|seize control of Dublin Castle, the seat of English rule in Ireland, to force concessions to Catholics.
1642  Battle of Edgehill: First major battle of the First English Civil War.
1694  British/American colonial forces, led by Sir William Phips, fail to seize Quebec from the French.
1707  The first Parliament of Great Britain meets.
1739  War of Jenkins' Ear starts: British Prime Minister Robert Walpole, reluctantly declares war on Spain.
1812  Claude François de Malet, a French general, Malet coup of 1812|begins a conspiracy to overthrow Napoleon I of France|Napoleon Bonaparte, claiming that the Emperor died in Russia and that he is now the commandant of Paris.
1850  The first National Women's Rights Convention begins in Worcester, Massachusetts, United States.
1861  U.S. President Abraham Lincoln suspends the writ of ''habeas corpus'' in Washington, D.C., for all military-related cases.
1864  American Civil War: Battle of Westport: Union Army|Union forces under General Samuel R. Curtis defeat Confederate States of America|Confederate troops led by General Sterling Price at Westport, Kansas City, Missouri|Westport, Missouri, near Kansas City, Missouri|Kansas City.
1870  Franco-Prussian War: The Siege of Metz (1870)|Siege of Metz concludes with a decisive Kingdom of Prussia|Prussian victory.
1906  Alberto Santos-Dumont flies an airplane in the first heavier-than-air flight in Europe at Champs de Bagatelle, Paris, France.
1911  First use of aircraft in war: Italo-Turkish War: An Italian pilot takes off from Libya to observe Turkey|Turkish army lines.
1912  First Balkan War: The Battle of Kumanovo between the Kingdom of Serbia|Serbian and Ottoman Empire|Ottoman armies begins.
1915  Women's suffrage: In New York City, 25,000–33,000 women march on Fifth Avenue to advocate their right to vote.
1917  Vladimir Lenin|Lenin calls for the October Revolution.
1929  Wall Street Crash of 1929. After a steady decline in stock market prices since a peak in September, the New York Stock Exchange begins to crash.
1935  Dutch Schultz, Abe Landau, Otto Berman, and Bernard Rosencrantz|Bernard \"Lulu\" Rosencrantz are fatally shot at a Bar (establishment)|saloon in Newark, New Jersey in what will become known as The Chophouse Massacre.
1939  The Japanese Mitsubishi G4M twin-engine \"Betty\" Bomber makes its maiden flight.
1941  World War II: Field Marshal Georgy Zhukov takes command of Red Army operations to prevent the further advance into Soviet Union|Russia of Nazi Germany|German forces and to prevent the Wehrmacht from capturing Moscow.
1942  World War II: Second Battle of El Alamein: At El Alamein in northern Egypt, the British Eighth Army (United Kingdom)|Eighth Army under Bernard Montgomery, 1st Viscount Montgomery of Alamein|Field Marshal Montgomery begins a critical offensive to expel the Axis powers|Axis armies from Egypt.
1942    All 12 passengers and crewmen aboard an American Airlines DC-3 airliner are killed when it is struck by a U.S. Army Air Forces bomber near Palm Springs, California.
1942    World War II: The Battle for Henderson Field begins during the Guadalcanal Campaign and ends on October 26.
1944  World War II: Battle of Leyte Gulf: The largest naval battle in history begins in the Philippines.
1946  The United Nations General Assembly convenes for the first time, at an auditorium in Flushing, Queens, New York City.
1955  Prime Minister Ngô Đình Diệm defeats former emperor Bảo Đại in a State of Vietnam referendum, 1955|referendum and founds the Republic of Vietnam.
1955  Saar Statute referendum, 1955 to decide if the Saar region is to become an independent territory under economic union with France. 67% of voters rejected the statute, leading to the reunification of the Saar with Germany in 1957.
1956  Thousands of Hungary|Hungarians protest against the government and Soviet Union|Soviet occupation.  (The Hungarian Revolution of 1956|Hungarian Revolution is crushed on November 4).
1958  The Springhill Mine bump: An earthquake traps 174 miners in the No. 2 colliery at Springhill, Nova Scotia, the deepest coal mine in North America at the time. By November 1, rescuers from around the world had dug out 100 of the victims, marking the death toll at 74.
1965  Vietnam War: The 1st Cavalry Division (United States) (Airmobile), in conjunction with South Vietnamese forces, launches a new operation seeking to destroy North Vietnamese forces in Pleiku in the II Corps Tactical Zone (the Central Highlands).
1970  Gary Gabelich sets a land speed record in a rocket-powered automobile called the Blue Flame (automobile)|Blue Flame, fueled with natural gas.
1972  Operation Linebacker, a US bombing campaign against North Vietnam in response to its Easter Offensive, ends after five months.
1973  The Watergate scandal: US President Richard M. Nixon agrees to turn over subpoenaed audio tapes of his Oval Office conversations.
1982  Miracle Valley shootout|A gunfight breaks out between police officers and members of a religious cult known as the \"Christ Miracle Healing Center and Church\" in Miracle Valley, Arizona. The shootout leaves two cultists dead and dozens of cultists and police officers injured.
1983  Lebanese Civil War: The United States Marine Corps|U.S. Marines barracks in Beirut is 1983 Beirut barracks bombing|hit by a truck bomb, killing 241 U.S. military personnel.  A French army barracks in Lebanon is also hit that same morning, killing 58 troops.
1989  The Hungarian Republic is officially declared by president Mátyás Szűrös, replacing the communist Hungarian People's Republic.
 1989  Bankruptcy of Wärtsilä Marine; the biggest bankruptcy in the Nordic countries until then.
1991  Signing of the 1991 Paris Peace Accords|Paris Peace Accords which ended the Cambodian–Vietnamese War. Commemorated as a public holiday in Cambodia.
1993  The Troubles: A Provisional Irish Republican Army|Provisional IRA bomb Shankill Road bombing|prematurely detonates in the Shankill Road|Shankill area of Belfast, killing the bomber and nine civilians.
1995  Yolanda Saldívar is found guilty of first-degree murder in the shooting death of popular Latin singer Selena. Saldívar was sentenced to life in prison, eligible for parole in 2025.
1998  Israeli–Palestinian conflict: Israeli Prime Minister Benjamin Netanyahu and Palestinian Chairman Yasser Arafat reach a \"land for peace\" agreement.
2002  Moscow theater hostage crisis: Chechnya|Chechen terrorists seize the House of Culture theater in Moscow and take approximately 700 theater-goers hostage.
2004  A powerful 2004 Chūetsu earthquake|earthquake and its aftershocks hit Niigata Prefecture in northern Japan, killing 35 people, injuring 2,200, and leaving 85,000 homeless or evacuated.
2007  A powerful cold front in the Bay of Campeche causes the Usumacinta jackup rig to collide with Kab 101, leading to the death and drowning of 22 people during rescue operations after evacuation of the rig.
2011  A powerful 7.2 magnitude 2011 Van earthquake|earthquake strikes Van Province, Turkey, killing 582 people and injuring thousands.
2011    The Libyan National Transition Council deems the Libyan Civil War (2011)|Libyan Civil War over.
2012  After 38 years, the world's first teletext service (BBC's Ceefax) ceases broadcast due to Northern Ireland completing the digital switchover.
2015  The lowest sea-level pressure in the Western Hemisphere, and the highest reliably-measured non-tornadic sustained winds, are recorded in Hurricane Patricia, which strikes Mexico hours later, killing at least 13 and causing over $280 million in damages.
==Births==
1006  Wen Yanbo (Song dynasty)|Wen Yanbo, Chinese grand chancellor (d. 1097)
1255  Ferdinand de la Cerda, Spanish noble (d. 1275)
1516  Charlotte of Valois, French princess (d. 1524)
1634  Hedwig Eleonora of Holstein-Gottorp, Swedish queen (d. 1715)
1654  Johann Bernhard Staudt, Austrian composer (d. 1712)
1698  Ange-Jacques Gabriel, French architect, designed the École Militaire (d. 1782)
1705  Maximilian Ulysses Browne, Austrian field marshal (d. 1757)
1713  Pieter Burman the Younger, Dutch philologist, poet, and educator (d. 1778)
1715  Peter II of Russia|Peter II, Russian emperor (''tsarevich'') (d. 1730)
1762  Samuel Morey, American engineer (d. 1843)
1766  Emmanuel de Grouchy, Marquis de Grouchy, French general (d. 1847)
1790  Chauncey Allen Goodrich, American minister, lexicographer, and educator (d. 1860)
1796  Stefano Franscini, Swiss statistician and politician (d. 1857)
1801  Albert Lortzing, German singer-songwriter and actor (d. 1851)
1805  John Russell Bartlett, American linguist and historian (d. 1886)
1813  Ludwig Leichhardt, German-Australian explorer (d. 1848)
1815  João Maurício Vanderlei, Baron of Cotejipe, Brazilian politician (d. 1889)
1817  Pierre Larousse, French lexicographer and author (d. 1875)
1835  Adlai Stevenson I, American lawyer and politician, 23rd Vice President of the United States (d. 1914)
1844  Robert Bridges, English poet and playwright (d. 1930)
1857  Juan Luna, Filipino painter and sculptor (d. 1899)
1863  Mirko Breyer, Croatian writer, bibliographer, antiquarian, and one of the notable alleged and false victims of the Stara Gradiška concentration camp (d. 1946)
1865  Neltje Blanchan, American historian and author (d. 1918)
1869  John Heisman, American football player and coach (d. 1936)
1870  Francis Kelley, Canadian-American bishop (d. 1948)
1873  William D. Coolidge, American physicist and engineer (d. 1975)
1874  Charles Kilpatrick (athlete)|Charles Kilpatrick, American runner and educator (d. 1921)
1875  Gilbert N. Lewis, American chemist and academic (d. 1946)
1876  Franz Schlegelberger, German judge and politician, Reich Ministry of Justice (d. 1970)
1880  Una O'Connor (actress)|Una O'Connor, Irish-American actress and singer (d. 1959)
1885  Lawren Harris, Canadian painter and educator (d. 1970)
1888  Onésime Gagnon, Canadian scholar and politician, 20th Lieutenant Governor of Quebec (d. 1961)
1892  Speckled Red, American blues/boogie-woogie piano player and singer-songwriter (d. 1973)
1894  Rube Bressler, American baseball player (d. 1966)
1894    Emma Vyssotsky, American astronomer and academic (d. 1975)
1896  André Lévêque, French soldier and engineer (d. 1930)
1896    Lilyan Tashman, American actress (d. 1934)
1897  John Baker (RAF officer)|John Baker, English air marshal (d. 1978)
1900  Douglas Jardine, Indian-English cricketer and lawyer (d. 1958)
1902  Robert Eberan von Eberhorst, Austrian engineer (d. 1982)
1904  Harvey Penick, American golfer and coach (d. 1995)
1905  Felix Bloch, Swiss physicist and academic, Nobel Prize in Physics|Nobel Prize laureate (d. 1983)
1905    Yen Chia-kan, Chinese lawyer and politician, President of the Republic of China (d. 1993)
1905    Gertrude Ederle, American swimmer (d. 2003)
1908  František Douda, Czech shot putter (d. 1990)
1908    Ilya Frank, Russian physicist and academic, Nobel Prize in Physics|Nobel Prize laureate (d. 1990)
1909  Zellig Harris, American linguist and methodologist (d. 1992)
1910  Richard Mortensen, Danish painter and educator (d. 1993)
1910    Hayden Rorke, American actor (d. 1987)
1911  Jack Keller (athlete)|Jack Keller, American hurdler (d. 1978)
1918  Augusta Dabney, American actress (d. 2008)
1918    James Daly (actor)|James Daly, American actor (d. 1978)
1918    Paul Rudolph (architect)|Paul Rudolph, American architect and academic, designed the Lippo Centre, Hong Kong|Lippo Centre (d. 1997)
1919  Manolis Andronikos, Greek archaeologist and academic (d. 1992)
1920  Ted Fujita, Japanese-American meteorologist and academic (d. 1998)
1920    Bob Montana, American illustrator (d. 1975)
1920    Vern Stephens, American baseball player (d. 1968)
1922  Jean Barker, Baroness Trumpington, English politician
1922    Coleen Gray, American actress (d. 2015)
1922    Chris Alcaide, American actor (d. 2004)
1923  Aslam Farrukhi, Indian-Pakistani linguist, author, and scholar (d. 2016)
1923    Ned Rorem, American composer and author
1924  Arthur Brittenden, English journalist (d. 2015)
1925  Johnny Carson, American comedian and talk show host (d. 2005)
1925    Manos Hatzidakis, Greek composer and theorist (d. 1994)
1925    Fred Shero, Canadian-American ice hockey player and coach (d. 1990)
1927  Sonny Criss, American saxophonist and composer (d. 1977)
1927    Dezső Gyarmati, Hungarian water polo player and coach (d. 2013)
1927    Leszek Kołakowski, Polish-English historian and philosopher (d. 2009)
1929  Shamsur Rahman (poet)|Shamsur Rahman, Bangladeshi poet and journalist (d. 2006)
1931  Jim Bunning, American baseball player and politician (d. 2017)
1931    William P. Clark, Jr., American judge and politician, 12th United States National Security Advisor (d. 2013)
1931    Diana Dors, English actress (d. 1984)
1932  Vasily Belov, Russian novelist, poet and playwright (d. 2012)
1933  Carol Fran, American singer-songwriter and pianist
1935  Chi-Chi Rodríguez, Puerto Rican-American golfer
1935  JacSue Kehoe, American Neuroscientist
1936  Charles Goodhart, English economist and academic
1936    Philip Kaufman, American director, producer, and screenwriter
1937  Johnny Carroll, American rockabilly musician (d. 1995)
1937    Carlos Lamarca, Brazilian captain (d. 1971)
1937    Deven Verma, Indian actor, director, and producer (d. 2014)
1938  Alan Gilzean|Alan G`ilzean, Scottish footballer and manager
1939  Inez and Charlie Foxx|Charlie Foxx, American R&B/soul singer and guitarist (d. 1998)
1939    C. V. Vigneswaran, Sri Lankan lawyer, judge, and politician, 1st Chief Minister of the Northern Province
1940  Ellie Greenwich, American singer-songwriter and producer (The Raindrops) (d. 2009)
1940    Jane Holzer, American model, actress, producer, and art collector
1940    Pelé, Brazilian footballer and actor
1941  Colin Milburn, English cricketer (d. 1990)
1941    Igor Smirnov, Moldovan engineer and politician, 1st President of Transnistria
1942  Michael Crichton, American director, producer, and screenwriter (d. 2008)
1942    Douglas Dunn, Scottish poet, critic, and academic
1942    Bernd Erdmann, German footballer and manager
1942    Anita Roddick, English businesswoman and activist, founded The Body Shop (d. 2007)
1943  Alida Chelli, Italian actress and singer (d. 2012)
1944  Mike Harding, English singer-songwriter and comedian
1945  Maggi Hambling, English sculptor and painter
1945    Kim Larsen, Danish singer-songwriter and guitarist (Gasolin')
1945    Ernie Watts, American saxophonist
1946  Graeme Barker, English archaeologist and academic
1946    Mel Martínez, American lawyer and politician, 12th United States Secretary of Housing and Urban Development
1946    Miklós Németh (athlete)|Miklós Németh, Hungarian javelin thrower
1947  Kazimierz Deyna, Polish footballer (d. 1989)
1947    Greg Ridley, English bass player (d. 2003)
1948  Hermann Hauser, Austrian-English businessman, co-founded Acorn Computers and Olivetti Research Laboratory
1948    Gerry Robinson, Irish-born British businessman, arts patron and television personality
1948    Brian Ross (journalist)|Brian Ross, American journalist
1949  Krešimir Ćosić (politician)|Krešimir Ćosić, Croatian soldier and politician
1949    Nick Tosches, American journalist, author, and poet
1949    Würzel, English singer and guitarist (d. 2011)
1950  Maths O. Sundqvist, Swedish businessman (d. 2012)
1951  Charly García, Argentine singer-songwriter and keyboard player
1951    Fatmir Sejdiu, Kosovan academic and politician, 2nd President of Kosovo
1951    David Wills (singer)|David Wills, American country music singer-songwriter and guitarist
1952  Pierre Moerlen, French drummer (Gong (band)|Gong) (d. 2005)
1952    Ken Tipton, American actor, director, producer, and screenwriter
1953  Taner Akçam, Turkish sociologist and historian
1954  Ang Lee, Taiwanese-American director, producer, and screenwriter
1956  Dianne Reeves, American singer
1956    Dwight Yoakam, American singer-songwriter, guitarist, and actor
1957  Paul Kagame, Rwandan soldier and politician, 6th President of Rwanda
1957    Graham Rix, English footballer and coach
1958  Michael Eric Dyson, American activist, author, and academic
1958    Rose Nabinger, German singer
1958    Frank Schaffer, German sprinter
1959  Nancy Grace, American lawyer and journalist
1959    Sam Raimi, American actor, director, producer, and screenwriter
1959    \"Weird Al\" Yankovic, American singer-songwriter, comedian, and actor
1960  Mirwais Ahmadzaï, Swiss-French keyboard player, songwriter, and producer
1960    Katoucha Niane, French model and actress (d. 2008)
1960    Randy Pausch, American author and academic (d. 2008)
1960    Wayne Rainey, American motorcycle racer
1961  Laurie Halse Anderson, American author
1961    Andoni Zubizarreta, Spanish footballer and sportscaster
1962  Doug Flutie, American football player, sportscaster, and drummer
1963  Gordon Korman, Canadian-American author
1963    Rashidi Yekini, Nigerian Footballer
1964  Robert Trujillo, American bass player and songwriter
1964   Eddy Cue, American computer scientist and businessman
1965  Augusten Burroughs, American author and screenwriter
1965    Al Leiter, American baseball player and sportscaster
1966  Alex Zanardi, Italian race car driver and cyclist
1967  Dale Crover, American singer-songwriter, drummer, and producer
1967    Walt Flanagan, American actor and illustrator
1967    Jaime Yzaga, Peruvian tennis player
1969  Dolly Buster, Czech film producer and director, actress and author
1969    Trudi Canavan, Australian author and illustrator
1969    Bill O'Brien (American football)|Bill O'Brien, American football player and coach
1969    Brooke Theiss, American actress
1970  Matthew Barzun, American diplomat, United States Ambassador to the United Kingdom
1970    Grant Imahara, American television presenter and engineer
1970    Steve Wilder, American actor
1970    Zoe Wiseman, American model and photographer
1971  Carlo Forlivesi, Italian-Japanese composer and scholar
1971    Chris Horner, American cyclist
1972  Bryan Pratt, American lawyer and politician
1972    Jimmy Wayne, American singer-songwriter and guitarist
1973  Christian Dailly, Scottish footballer
1974  Aravind Adiga, Indian journalist and author
1974    Beatrice Faumuina, New Zealand discus thrower
1974    Sander Westerveld, Dutch footballer
1974    Christine Yoshikawa, Canadian pianist
1975  Jessicka, American singer-songwriter
1975    Michelle Beadle, American sportscaster
1975    Phillip Gillespie, Australian cricket umpire
1975    Yoon Son-ha, South Korean actress and singer
1975    Keith Van Horn, American basketball player
1976  Cat Deeley, English model, actress, and television host
1976    Ryan Reynolds, Canadian-American actor and producer
1977  Brad Haddin, Australian cricketer
1977    Alex Tudor, English cricketer and coach
1978  Jimmy Bullard, English footballer
1978    Steve Harmison, English cricketer and sportscaster
1978    John Lackey, American baseball player
1978    Archie Thompson, New Zealand-Australian footballer
1979  Ramón Castro (third baseman)|Ramón Castro, Venezuelan baseball player
1979    Simon Davies (footballer, born 1979)|Simon Davies, Welsh footballer
 1979   Prabhas,Telugu film actor
1979    Jorge Solís, Mexican boxer
1979    Bud Smith, American baseball player
1980  Mate Bilić, Croatian footballer
1980    Pedro Liriano, Dominican baseball player
1981  Jeroen Bleekemolen, Dutch race car driver
1981    Leticia Dolera, Spanish actress
1981    Ben Francisco, American baseball player
1981    Jackie Long, American actor and producer
1981    Huo Siyan, Chinese actress
1982  Valentin Badea, Romanian footballer
1982    Rickey Paulding, American basketball player
1982    Kristjan Kangur, Estonian basketball player
1982    Aleksandar Luković, Serbian footballer
1982    Rodolfo Dantas Bispo, Brazilian footballer
1983  Filippos Darlas, Greek footballer
1983    Goldie Harvey, Nigerian singer-songwriter (d. 2013)
1984  Simone Masini, Italian footballer
1984    Keiren Westwood, English footballer
1984    Jeffrey Hoogervorst, Dutch footballer
1984    Meghan McCain, American journalist and author
1984    Michael Sim, Australian golfer
1984    Izabel Goulart, Brazilian model
1985  Miguel (singer)|Miguel, American singer-songwriter and producer
1985    Mohammed Abdellaoue, Norwegian footballer
1985    Masiela Lusha, Albanian-American actress, poet, and humanitarian
1985    Chris Neal, English footballer
1985    Luca Spinetti, Italian footballer
1985    Panagiotis Vouis, Greek footballer
1986  Briana Evigan, American actress and dancer
1986    Jake Robinson, English footballer
1986    Jessica Stroup, American actress
1986    Emilia Clarke, English actress
1987  Faye (musician)|Faye, Swedish singer-songwriter (Play (band)|Play)
1987    Robin Copeland, Irish rugby player
1987    Félix Doubront, Venezuelan baseball player
1987    Kyle Gibson, American baseball player
1987    Miyuu Sawai, Japanese model and actress
1987    Seo In-guk, South Korean singer and actor
1987    Naomi Watanabe, Japanese actress
1988  Jordan Crawford, American basketball player
1988    Aleksandr Salugin, Russian footballer
1988    Carolin Schiewe, German footballer
1989  Viktor Agardius, Swedish footballer
1989    Anisya Kirdyapkina, Russian race walker
1989    Jonita Gandhi, Indo-Canadian singer
1990  Paradise Oskar, Finnish singer-songwriter and guitarist
1991  Jorge Taufua, Australian rugby league player
1992  Álvaro Morata, Spanish footballer
1993  Josh Ruffels, English footballer
1993    Taylor Spreitler, American actress
1995  Ireland Baldwin, American model
1997  Jaydn Su'A, New Zealand rugby league player
1998   Amandla Stenberg, American actor<ref>{{Cite web|url=https://www.amandlastenberg.com/biography.html|title=Biography|website=AMANDLA STENBERG|language=en|access-date=2018-03-05}}</ref>
2002  Shin Eun-soo, South Korean actress
==Deaths==
42 BC  Marcus Junius Brutus the Younger, Roman general and politician (b. 85 BC)
 877  Ignatios of Constantinople, Byzantine patriarch (b. 797)
 891  Yazaman al-Khadim, Abbasid general and politician
 902  Ibrahim II of Ifriqiya, Aghlabid emir (b. 850)
 930  Emperor Daigo|Daigo, Japanese emperor (b. 885)
 945  Hyejong of Goryeo, Korean king (b. 912)
 949  Emperor Yōzei|Yōzei, Japanese emperor (b. 869)
1134  Abu al-Salt, Andalusian polymath
1157  Sweyn III of Denmark|Sweyn III, Danish king (b. c. 1125)
1456  John of Capistrano, Italian priest and saint (b. 1386)
1550  Tiedemann Giese, Polish bishop (b. 1480)
1581  Michael Neander, German mathematician and astronomer (b. 1529)
1590  Bernardino de Sahagún, Spanish-born Franciscan, compiler of the Florentine Codex of Aztecs history in Mexico (b. 1499)
1616  Leonhard Hutter, German theologian and academic (b. 1563)
1688  Charles du Fresne, sieur du Cange, French philologist and historian (b. 1610)
1730  Anne Oldfield, English actress (b. 1683)
1764  Emmanuel-Auguste de Cahideuc, Comte Dubois de la Motte, French admiral (b. 1683)
1774  Michel Benoist, French missionary and astronomer (b. 1715)
1867  Franz Bopp, German linguist and academic (b. 1791)
1869  Edward Smith-Stanley, 14th Earl of Derby, English lawyer and politician, Prime Minister of the United Kingdom (b. 1799)
1872  Théophile Gautier, French journalist, author, and poet (b. 1811)
1885  Charles S. West, American lawyer, jurist,  and politician, Secretary of State of Texas (b. 1829)
1893  Alexander of Battenberg (b. 1857)
1910  Chulalongkorn, Thai king (b. 1853)
1915  W. G. Grace, English cricketer and physician (b. 1848)
1916  Richard McFadden, Scottish footballer and soldier (b. 1889)
1917  Eugène Grasset, Swiss illustrator (b. 1845)
1921  John Boyd Dunlop, Scottish businessman, founded Dunlop Rubber (b. 1840)
1935  Charles Demuth, American painter and educator (b. 1883)
1939  Zane Grey, American dentist and author (b. 1872)
1942  Ralph Rainger, American pianist and composer (b. 1901)
1943  Wakashima Gonshirō, Japanese sumo wrestler, the 21st Yokozuna (sumo)|Yokozuna (b. 1876)
1944  Charles Glover Barkla, English-Scottish physicist and academic, Nobel Prize in Physics|Nobel Prize laureate (b. 1877)
1944    Hana Brady, Czech holocaust victim (b. 1931)
1950  Al Jolson, Lithuanian-American actor and singer (b. 1886)
1953  Adrien de Noailles, French son of Jules Charles Victurnien de Noailles (b. 1869)
1957  Christian Dior, French fashion designer, founded Christian Dior S.A. (b. 1905)
1959  George Bouzianis, Greek painter (b. 1885)
1959    Gerda Lundequist, Swedish actress (b. 1871)
1964  Frank Luther Mott, American historian and journalist (b. 1886)
1978  Maybelle Carter, American singer and autoharp player (Carter Family) (b. 1909)
1983  Jessica Savitch, American journalist (b. 1947)
1984  Oskar Werner, Austrian-German actor (b. 1922)
1986  Edward Adelbert Doisy, American biochemist and academic, Nobel Prize in Physiology or Medicine|Nobel Prize laureate (b. 1893)
1988  Asashio Tarō III, Japanese sumo wrestler, the 46th Yokozuna (sumo)|Yokozuna (b. 1929)
1989  Armida (actress)|Armida, Mexican-American actress, singer, and dancer (b. 1911)
1990  Thomas Williams (writer)|Thomas Williams, American author and academic (b. 1926)
1994  Robert Lansing (actor)|Robert Lansing, American actor (b. 1928)
1996  Bob Grim (baseball)|Bob Grim, American baseball player (b. 1930)
1997  Bert Haanstra, Dutch director, producer, and screenwriter (b. 1916)
1998  Barnett Slepian, American physician (b. 1946)
1999  Eric Reece, Australian politician, 32nd Premier of Tasmania (b. 1909)
2000  Yokozuna (wrestler)|Yokozuna, American wrestler (b. 1966)
2001  Josh Kirby, English illustrator (b. 1928)
2001    Daniel Wildenstein, French art dealer and historian (b. 1917)
2002  Adolph Green, American playwright and songwriter (b. 1915)
2003  Tony Capstick, English actor and singer (b. 1944)
2003    Soong Mei-ling, Chinese wife of Chiang Kai-shek, 2nd First Lady of the Republic of China (b. 1897)
2004  Robert Merrill, American actor and singer (b. 1919)
2004    Bill Nicholson (footballer)|Bill Nicholson, English footballer, coach, and manager (b. 1919)
2005  William Hootkins, American actor (b. 1948)
2005    John Muth, American economist and academic (b. 1930)
2005    Stella Obasanjo, Nigerian wife of Olusegun Obasanjo, 10th First Lady of Nigeria (b. 1945)
2006  Lebo Mathosa, South African singer (Boom Shaka) (b. 1977)
2007  John Ilhan, Turkish-Australian businessman, founded Crazy John's (b. 1965)
2007    Lim Goh Tong, Malaysian-Chinese businessman (b. 1918)
2008  Kevin Finnegan, English boxer (b. 1948)
2009  Lou Jacobi, Canadian-American actor (b. 1913)
2010  Fran Crippen, American swimmer (b. 1984)
2010    Stanley Tanger, American businessman and philanthropist, founded the Tanger Factory Outlet Centers (b. 1923)
2011  Herbert A. Hauptman, American chemist and mathematician, Nobel Prize in Chemistry|Nobel Prize laureate (b. 1917)
2011    Marco Simoncelli, Italian motorcycle racer (b. 1987)
2012  William Joel Blass, American lawyer and politician (b. 1917)
2012    Wilhelm Brasse, Polish photographer (b. 1917)
2012    Roland de la Poype, French soldier and pilot (b. 1920)
2012    Sunil Gangopadhyay, Indian author and poet (b. 1934)
2012    Michael Marra, Scottish singer-songwriter (b. 1952)
2013  Wes Bialosuknia, American basketball player (b. 1945)
2013    Anthony Caro, English sculptor and academic (b. 1924)
2013    Niall Donohue, Irish hurler (b. 1990)
2013    Gypie Mayo, English guitarist and songwriter (Dr. Feelgood (band)|Dr. Feelgood and The Yardbirds) (b. 1951)
2013    Bill Mazer, Ukrainian-American journalist and sportscaster (b. 1920)
2014  Ghulam Azam, Bangladeshi politician (b. 1922)
2014    John Bramlett, American football player (b. 1941)
2014    Bernard Mayes, English-American journalist and academic (b. 1929)
2014    Joan Quigley, American astrologer and author (b. 1927)
2014    Tullio Regge, Italian physicist and academic (b. 1931)
2014    Alvin Stardust, English singer and actor (b. 1942)
2015  Leon Bibb (musician)|Leon Bibb, American-Canadian singer (b. 1922)
2015    Roger De Clerck, Belgian businessman (b. 1924)
2015    Jim Roberts (ice hockey, born 1940)|Jim Roberts, Canadian-American ice hockey player and coach (b. 1940)
2015    Fred Sands, American businessman and philanthropist, co-founded the Museum of Contemporary Art, Los Angeles|Museum of Contemporary Art (b. 1938)
2016  Jack Chick, American cartoonist and publisher (b. 1924)
2016    Wim van der Voort, Dutch speed skater (b. 1923)
2016    Pete Burns, English singer-songwriter (b. 1959)
2017  Paul J. Weitz, American captain, pilot, and astronaut (b. 1932)
==Holidays and observances==
Christian feast day:
Feast of the Most Holy Redeemer
James the Just (i.e. James, brother of Jesus) (Lutheran, Episcopal Church (USA), Eastern Orthodox)
Allucio of Campugliano
Amon of Toul (Diocese of Toul)
Boethius|Anicius Manlius Severinus Boethius
John of Capistrano|Giovanni da Capistrano
Ignatios of Constantinople
Joséphine Leroux
Peter Pascual
Romanus of Rouen|Romain (Romanus) of Rouen
Servandus and Cermanus
Severin of Cologne
October 23 (Eastern Orthodox liturgics)
 Christmas or the Feast of Señor Noemi (the Child Jesus) in the Apostolic Catholic Church
Armed Forces Day#Brazil|Aviator's Day (Brazil)
Chulalongkorn Day (Thailand)
Day of the Macedonian Revolutionary Struggle (Republic of Macedonia)
Liberation Day (Libya)
Mole Day (International observance)
National Day (Hungary)
Public holidays in Cambodia|Paris Peace Agreement Day (Cambodia)
==References==
==External links==
[http://news.bbc.co.uk/onthisday/hi/dates/stories/october/23 BBC: On This Day]
{{NYT On this day|month=10|day=23}}
 [http://canadachannel.ca/todayincanadianhistory/index.php/October_23 Today in Canadian History]
