==Events==
 366  The Alemanni cross the frozen Rhine in large numbers, invading the Roman Empire.
 533  Mercurius becomes Pope John II, the first pope to adopt a new name upon elevation to the Pope|papacy.
1492  Reconquista: the Emirate of Granada, the last Moors|Moorish stronghold in Spain, surrenders.
1680  Trunajaya rebellion: Amangkurat II of Mataram and his bodyguards Trunajaya rebellion#Trunajaya's death|stabbed Trunajaya to death a month after the rebel leader was captured by the Dutch East India Company.
1777  American Revolutionary War: American forces under the command of George Washington repulsed a British attack at the Battle of the Assunpink Creek near Trenton, New Jersey.
1788  Georgia (U.S. state)|Georgia becomes the fourth state to ratify the United States Constitution.
1791  Big Bottom massacre in the Ohio Country, marking the beginning of the Northwest Indian War.
1818  The British Institution of Civil Engineers is founded.
1833  Reassertion of British sovereignty over the Falkland Islands (1833)|Reassertion of British sovereignty over the Falkland Islands.
1860  The discovery of the planet Vulcan (hypothetical planet)|Vulcan is announced at a meeting of the French Academy of Sciences in Paris|Paris, France.
1863  American Civil War: The Battle of Stones River (a.k.a. Battle of Murfreesboro) resumes in Middle Tennessee|central Tennessee after a day's respite, resulting in a significant Union victory.
1865  Uruguayan War: The Siege of Paysandú ends as Empire of Brazil|Brazilian and Colorado Party (Uruguay)|Coloradans capture Paysandú, Uruguay.
1900  American statesman and diplomat John Hay announces the Open Door Policy to promote trade with China.
1905  Russo-Japanese War: The Russian garrison surrenders at Lüshunkou District|Port Arthur, China.
1920  The second Palmer Raid takes place with another 6,000 suspected communists and anarchists arrested and held without trial. These raids take place in several U.S. cities.
1941  World War II: Strategic bombing during World War II|German bombing severely damages the Llandaff Cathedral in Cardiff, Wales, United Kingdom.
1942  The Federal Bureau of Investigation (FBI) obtains the conviction of 33 members of a German spy ring headed by Fritz Joubert Duquesne in the largest espionage case in United States history—the Duquesne Spy Ring.
1942  World War II: Manila, Philippines is captured by Japanese forces.
1945  World War II: Nuremberg, Germany is severely bombed by Allies of World War II|Allied forces.
1949  Luis Muñoz Marín becomes the first democratically elected Governor of Puerto Rico.
1954  India establishes its highest civilian awards, the Bharat Ratna and the Padma Vibhushan.
1955  Panamanian president José Antonio Remón Cantera is assassinated.
1959  ''Luna 1'', the first spacecraft to reach the vicinity of the Moon and to orbit the Sun, is launched by the Soviet Union.
1963  Vietnam War: The Viet Cong wins its first Battle of Ap Bac|major victory.
1967  Ronald Reagan, past movie actor and future President of the United States, is sworn in as Governor of California.
1971  The second 1971 Ibrox disaster|Ibrox disaster kills 66 fans at a Rangers F.C.|Rangers-Celtic F.C.|Celtic association football (soccer) match.
1974  United States President Richard Nixon signs a National Maximum Speed Law#Enactment|bill lowering the maximum U.S. speed limit to 55 MPH in order to conserve gasoline during an OPEC embargo.
1975  A bomb blast at Samastipur, Bihar, India, fatally wounds Lalit Narayan Mishra, Minister of Railways (India)|Minister of Railways.
 1975 - Bangladesh revolutionary leader Siraj Sikder is killed by police while in custody.
 1975 - The Federal Rules of Evidence are approved by the United States Congress.
1976  The Gale of January 1976 begins, which results in coastal flooding around the southern North Sea coasts, resulting in at least 82 deaths and US$1.3 billion in damage.
1981  One of the largest investigations by a British police force ends when serial killer Peter Sutcliffe, the \"Yorkshire Ripper\", is arrested in Sheffield, South Yorkshire.
1991  Sharon Pratt Kelly becomes the first African American woman mayor of a major city and first woman Mayor of the District of Columbia.
1992  Leaders of armed opposition declare the President of Georgia|President Zviad Gamsakhurdia deposed during a military coup in Georgia (country)|Georgia.
1993  Sri Lankan Civil War: The Sri Lanka Navy Jaffna lagoon massacre|kill 35-100 civilians on the Jaffna Lagoon.
1999  A North American blizzard of 1999|brutal snowstorm smashes into the Midwestern United States, causing 14 inches (359&nbsp;mm) of snow in Milwaukee|Milwaukee, Wisconsin, and 19 inches (487&nbsp;mm) in Chicago, where temperatures plunge to -13&nbsp;°F (-25&nbsp;°C); 68 deaths are reported.
2004  ''Stardust (spacecraft)|Stardust'' successfully flies past Comet 81P/Wild|Wild 2, collecting samples that are returned to Earth.
2006  An Sago Mine disaster|explosion in a coal mine in Sago, West Virginia traps and kills 12 miners, leaving only one survivor.
==Births==
 869  Emperor Yōzei|Yōzei, Japanese emperor (d. 949)
1403  Basilios Bessarion, Greek cardinal and scholar (d. 1472)
1462  Piero di Cosimo, Italian painter (d. 1522)
1509  Henry of Stolberg, German nobleman (d. 1572)
1642  Mehmed IV, Ottoman sultan (d. 1693)
1647  Nathaniel Bacon (Virginia colonist and rebel)|Nathaniel Bacon, English-American rebel leader (d. 1676)
1699  Osman III, Ottoman sultan (d. 1757)
1713  Marie Dumesnil, French actress (d. 1803)
1727  James Wolfe, English general (d. 1759)
1732  František Brixi, Czech organist and composer (d. 1771)
1777  Christian Daniel Rauch, German sculptor and educator (d. 1857)
1822  Rudolf Clausius, Polish-German physicist and mathematician (d. 1888)
1827  Pyotr Semyonov-Tyan-Shansky, Russian geographer and statistician (d. 1914)
1833  Frederick A. Johnson, American banker and politician (d. 1893)
1836  Mendele Mocher Sforim, Russian author (d. 1917)
1836  Queen Emma of Hawaii (d. 1885)
1837  Mily Balakirev, Russian pianist and composer (d. 1910)
1851  Ludwig von Graff, Austrian zoologist (d. 1924)
1852  Abdülhak Hâmid Tarhan, Turkish playwright and poet (d. 1937)
1857  M. Carey Thomas, American educator and activist (d. 1935)
1860  Dugald Campbell Patterson, Canadian engineer (d. 1931)
1860  William Corless Mills, American historian and curator (d. 1928)
1862  Mikhail Dolivo-Dobrovolsky, Polish-Russian engineer, electrician, and inventor (d. 1919)
1866  Gilbert Murray, Australian-English playwright and scholar (d. 1957)
1870  Ernst Barlach, German sculptor and playwright (d. 1938)
1870  Tex Rickard, American boxing promoter and businessman (d. 1929)
1873  Antonie Pannekoek, Dutch astronomer and theorist (d. 1960)
1873  Thérèse of Lisieux, French nun and saint (d. 1897)
1876  Aquiles Serdán, Mexican activist and politician (d. 1910)
1878  Mannathu Padmanabha Pillai, Indian activist, founded the Nair Service Society (d. 1970)
1879  Rudolf Bauer (athlete)|Rudolf Bauer, Hungarian discus thrower (d. 1932)
1884  Ben-Zion Dinur, Russian-Israeli historian and politician, 4th Ministry of Education (Israel)|Israeli Minister of Education (d. 1973)
1885  Gordon Flowerdew, Canadian lieutenant, Victoria Cross recipient (d. 1918)
1886  Apsley Cherry-Garrard, English explorer and author (d. 1959)
1886  Billy Zulch, South African cricketer (d. 1924)
1886  Florence Lawrence, Canadian-American actress (d. 1938)
1889  Bertram Stevens (politician)|Bertram Stevens, Australian accountant and politician, 25th Premier of New South Wales (d. 1973)
1890  Henrik Visnapuu, Estonian-American poet and playwright (d. 1951)
1891  Giovanni Michelucci, Italian architect and urban planner, designed the Firenze Santa Maria Novella railway station (d. 1990)
1892  Seiichiro Kashio, Japanese tennis player (d. 1962)
1893  Lillian Leitzel, German acrobat and strongwoman (d. 1931)
1895  Folke Bernadotte, Swedish lieutenant and diplomat (d. 1948)
1896  Dziga Vertov, Polish-Russian director and screenwriter (d. 1954)
1896  Lawrence Wackett, Australian commander and engineer (d. 1982)
1897  Jim Londos, Greek-American wrestler (d. 1975)
1897  Theodore Plucknett, English legal historian (d. 1965)
1898  Sadie Tanner Mossell Alexander, American economist and lawyer (d. 1989)
1899  Burhan Asaf Belge, Turkish diplomat (d. 1967)
1900  Una Ledingham, British physician, known for research on Diabetes mellitus and pregnancy|diabetes in pregnancy (d. 1965)
1900  William Haines, American actor and interior designer (d. 1973)
1901  Bob Marshall (wilderness activist)|Bob Marshall, American activist, co-founded The Wilderness Society (United States)|The Wilderness Society (d. 1939)
1902  Dan Keating, Irish Republican Army volunteer (d. 2007)
1904  Truus Klapwijk, Dutch diver and swimmer (d. 1991)
1904  Walter Heitler, German physicist and chemist (d. 1981)
1905  Jainendra Kumar, Indian author and translator (d. 1988)
1905  Lev Schnirelmann, Russian mathematician and academic (d. 1938)
1905  Luigi Zampa, Italian director and screenwriter (d. 1991)
1905  Michael Tippett, English composer and conductor (d. 1998)
1909  Barry Goldwater, American general and politician (d. 1998)
1909  Riccardo Cassin, Italian mountaineer and author (d. 2009)
1913  Anna Lee, English-American actress (d. 2004)
1913  Juanita Jackson Mitchell, American lawyer and activist (d. 1992)
1914  Jack Beaton, Australian rugby league player (d. 1996)
1916  Zypora Spaisman, Polish midwife; American and Yiddish-language actress; producer of the Yiddish stage (d. 2002)
1917  Vera Zorina, German-Norwegian actress and dancer (d. 2003)
1918  Willi Graf, German physician and activist (d. 1943)
1919  Beatrice Hicks, American engineer (d. 1979)
1920  Isaac Asimov, Russian-American chemist, author, and academic (d. 1992)
1921  Glen Harmon, Canadian ice hockey player (d. 2007)
1923  Rachel Waterhouse, English historian and author
1924  Evgenios Spatharis, Greek puppeteer, actor, and director (d. 2009)
1925  William J. Crowe, American admiral and diplomat, United States Ambassador to the United Kingdom (d. 2007)
1925    Eraño Manalo, 2nd Executive Minister (Tagapamahalang Pangkalahatan) of the Iglesia ni Cristo (Church of Christ) (d. 2009)
1927  Gino Marchetti, American football player
1928  Avie Bennett, Canadian businessman and philanthropist (d. 2017)
1928  Dan Rostenkowski, American Congressman (d. 2010)
1928  Kate Molale, South African activist and politician (d. 1980)
1928  Robert Goralski, American journalist and author (d. 1988)
1930  Julius La Rosa, American traditional pop singer (d. 2016)
1931  James D. Murray, Scottish mathematician and academic
1931  Toshiki Kaifu, Japanese lawyer and politician, 76th Prime Minister of Japan
1932  Peter Redgrove, English poet, author, and playwright (d. 2003)
1933  Ed Casey, Australian banker and politician (d. 2006)
1933  Keith Thomas (historian)|Keith Thomas, Welsh historian, author, and academic
1933  Richard Riley, American soldier, lawyer, and politician, 6th United States Secretary of Education
1933  Seiichi Morimura, Japanese author
1935  David McKee, English author and illustrator
1935  Lolo Soetoro, Indonesian geographer and academic (d. 1987)
1936  Roger Miller, American singer-songwriter, musician, and actor (d. 1992)
1938  Dana Ulery, American computer scientist
1938  David Bailey, English photographer and painter
1938  Goh Kun, South Korean politician, 31st Prime Minister of South Korea
1938  Hans Herbjørnsrud, Norwegian author and educator
1938  Lynn Conway, American computer scientist and electrical engineer
1938  Robert Smithson, American sculptor and photographer (d. 1973)
1940  Jim Bakker, American televangelist
1940  Saud bin Faisal bin Abdulaziz Al Saud, Saudi Arabian economist and politician, Ministry of Foreign Affairs (Saudi Arabia)|Saudi Arabian Minister of Foreign Affairs (d. 2015)
1942  Dennis Hastert, American educator and politician, 59th Speaker of the United States House of Representatives
1942  Hugh Shelton, American general
1942  Thomas Hammarberg, Swedish lawyer and diplomat
1943  Janet Akyüz Mattei, Turkish-American astronomer (d. 2004)
1944  Norodom Ranariddh, Cambodian field marshal and politician, 1st Prime Minister of Cambodia
1944  Péter Eötvös, Hungarian composer and conductor
1946  Sonny Ruberto, American baseball player, coach, and manager (d. 2014)
1947  Calvin Hill, American football player
1947  David Shapiro (poet)|David Shapiro, American poet, historian, and critic
1947  Jack Hanna, American zoologist and author
1948  Joyce Wadler, American journalist and author
1948  Judith Miller, American journalist and author
1949  Christopher Durang, American playwright and screenwriter
1949  Iris Marion Young, American political scientist and academic (d. 2006)
1949  Jean Krier, Luxembourger poet (d. 2013)
1950  Anatoli Ushanov, Russian footballer and coach
1951  Alexander Pogrebinsky, Ukrainian-American painter and educator
1951  Jim Essian, American baseball player and coach
1952  Graeme Strachan, Australian singer-songwriter (d. 2001)
1952  Indulis Emsis, Latvian biologist and politician, 9th Prime Minister of Latvia
1952  Wendy Phillips, American actress
1953  Jacques Tichelaar, Dutch educator and politician
1953  Vincent Racaniello, American virologist, author, and academic
1954  Henry Bonilla, American broadcaster and politician
1954  Glenn Goins, American R&B/funk guitarist and singer (Parliament-Funkadelic) (d. 1978)
1954  Évelyne Trouillot, Haitian playwright and author<ref>{{Cite news|url=http://ile-en-ile.org/trouillot_evelyne/|title=Évelyne Trouillot - Île en île|date=2002-06-16|work=Île en île|access-date=2018-05-02|language=fr-FR}}</ref>
1956  Lynda Barry, American cartoonist and author
1957  Beppe Gabbiani, Italian race car driver
1958  Helen Goodman, English lawyer and politician
1958  Vladimir Ovchinnikov (pianist)|Vladimir Ovchinnikov, Russian pianist and educator
1959  Kirti Azad, Indian cricketer and politician
1960  Raman Lamba, Indian cricketer (d. 1998)
1961  Craig James (American football)|Craig James, American football player and sportscaster
1961  Gabrielle Carteris, American actress
1961  Paula Hamilton, English model <ref>{{Cite book|url=https://www.worldcat.org/oclc/55558185|title=Instructions not included|last=1961-|first=Hamilton, Paula,|date=1996|publisher=Michael Joseph|isbn=071814077X|location=London|oclc=55558185}}</ref>
1961  Robert Wexler, American lawyer and politician
1961  Todd Haynes, American director and screenwriter
1963  David Cone, American baseball player and sportscaster
1963  Edgar Martínez, American baseball player
1964  Michael McCann (politician)|Michael McCann, Scottish lawyer and politician
1964  Pernell Whitaker, American boxer
1964  Rumesh Ratnayake, Sri Lankan cricketer
1965  Greg Swindell, American baseball player and coach
1967  Francois Pienaar, South African rugby player
1967  Jón Gnarr, Icelandic actor and politician; 20th Mayor of Reykjavik City
1967  Tia Carrere, American actress
1968  Anky van Grunsven, Dutch horse rider
1968  Cuba Gooding, Jr., American actor and producer
1969  Christy Turlington, American model
1969  Glen Johnson (boxer)|Glen Johnson, Jamaican boxer
1969  István Bagyula, Hungarian pole vaulter
1969  Karl-Heinz Grasser, Austrian businessman and politician, 16th Finance Minister of Austria
1969  Robby Gordon, American race car driver
1969  Tommy Morrison, American boxer and actor (d. 2013)
1969  William Fox-Pitt, English horse rider and journalist
1970  Eric Whitacre, American composer and conductor
1971  Lisa Harrison, American basketball player
1971  Renée Elise Goldsberry, American actress
1971  Taye Diggs, American actor
1972  Adam Elliot, Australian animator and screenwriter
1972  Mattias Norström, Swedish ice hockey player and manager
1972  Paweł Januszewski, Polish hurdler
1972  Rodney MacDonald, Canadian educator and politician, 26th Premier of Nova Scotia
1973  Lucy Davis, English actress
1974  Jason de Vos, Canadian soccer player and sportscaster
1974  Ludmila Formanová, Czech runner
1974  Tomáš Řepka, Czech footballer
1975  Chris Cheney, Australian singer-songwriter, guitarist and producer
1975  Dax Shepard, American actor
1975  Jeff Suppan, American baseball player
1975  Reuben Thorne, New Zealand rugby player
1976  Hrysopiyi Devetzi, Greek jumper
1976  Paz Vega, Spanish actress
1977  Aleš Píša, Czech ice hockey player
1977  Brian Boucher, American ice hockey player and sportscaster
1977  Stefan Koubek, Austrian tennis player
1978  Karina Smirnoff, Ukrainian-American dancer
1978  Megumi Toyoguchi, Japanese voice actress and singer
1978  Yoon Se-ah, South Korean actress
1979  Jonathan Greening, English footballer and coach
1980  Georgios Dedas, Greek basketball player
1980  Jérôme Pineau, French cyclist
1980  Melvin Holwijn, Dutch footballer
1981  Hanno Balitsch, German footballer
1981  Kirk Hinrich, American basketball player
1981  Maxi Rodríguez, Argentinian footballer
1981  Ryan Garko, American baseball player
1983  Kate Bosworth, American actress
1984  Otacílio Jales, Brazilian footballer
1985  Ivan Dodig, Croatian tennis player
1986  Ediz Bahtiyaroğlu, Turkish-Bosnian footballer (d. 2012)
1986  Nicolás Bertolo, Argentinian footballer
1986  Trombone Shorty, American trumpet player and composer
1988  Damien Tussac, French-German rugby player
1988  Joseph Paulo, New Zealand-Samoan rugby league player
1988  Mandy Harvey, American jazz musician, singer, and songwriter
1990  Chris Sabburg, Australian cricketer
1990  Karel Abraham, Czech motorcycle racer
1990  Maurício Alves Peruchi, Brazilian footballer (d. 2014)
1991  Davide Santon, Italian footballer
1991  Luis Pedro Cavanda, Belgian footballer
1992  Korbin Sims, Australian-Fijian rugby league player
1993  Bryson Tiller, American singer-songwriter
==Deaths==
 951  Liu Chengyou, Emperor Yin of the Later Han (Five Dynasties)|Later Han
 951  Su Fengji, Chinese official and Chancellor of the Tang dynasty|chancellor
1096  William de St-Calais, Bishop of Durham, England|Durham and chief counsellor of William II of England
1169  Bertrand de Blanchefort, sixth Grand Masters of the Knights Templar|Grand Master of the Knights Templar (b. c. 1109)
1184  Theodora Komnene, Duchess of Austria, daughter of Andronikos Komnenos (son of John II Komnenos)|Andronikos Komnenos
1470  Heinrich Reuß von Plauen, Grand Master of the Teutonic Order
1512  Svante Nilsson (regent of Sweden)|Svante Nilsson, Sweden politician (b. 1460)
1514  William Smyth, English bishop and academic (b. 1460)
1543  Francesco Canova da Milano, Italian composer (b. 1497)
1557  Pontormo, Italian painter and educator (b. 1494)
1613  Salima Sultan Begum, Empress of the Mughal Empire (b. 1539)
1614  Luisa Carvajal y Mendoza, Spanish Mythical Poet and Martyr of Catholicism (b.1566)
1726  Domenico Zipoli, Italian organist and composer (b. 1688)
1763  John Carteret, 2nd Earl Granville, English statesman (b. 1690)<ref>[http://thepeerage.com/p10509.htm#i105087 Record for ''John Carteret, 2nd Earl Granville'' on ''www.thepeerage.com'']</ref>
1849  Micanopy, American tribal chief (b. 1780)
1861  Frederick William IV of Prussia (b. 1795)
1892  George Biddell Airy, English mathematician and astronomer (b. 1801)
1904  James Longstreet, American general and diplomat (b. 1821)
1913  Léon Teisserenc de Bort, French meteorologist (b. 1855)
1915  Karl Goldmark, Hungarian violinist and composer (b. 1830)
1917  Léon Flameng, French cyclist (b. 1877)
1920  Paul Adam (French novelist)|Paul Adam, French author (b. 1862)
1924  Sabine Baring-Gould, English author and scholar (b. 1834)
1939  Roman Dmowski, Polish politician, Ministry of Foreign Affairs (Poland)|Polish Minister of Foreign Affairs (b. 1864)
1941  Mischa Levitzki, Russian-American pianist and composer (b. 1898)
1946  Joe Darling, Australian cricketer and politician (b. 1870)
1950  James Dooley (politician)|James Dooley, Irish-Australian politician, 21st Premier of New South Wales (b. 1877)
1950  Theophrastos Sakellaridis, Greek composer and conductor (b. 1883)
1951  William Campion, English colonel and politician, 21st Governor of Western Australia (b. 1870)
1953  Guccio Gucci, Italian businessman and fashion designer, founded Gucci (b. 1881)
1960  Chris van Abkoude, Dutch-American author (b. 1880)
1960  Paul Sauvé, Canadian lawyer and politician, 17th Premier of Quebec (b. 1907)
1963  Dick Powell, American actor, singer, and director (b. 1904)
1963  Jack Carson, Canadian-American actor (b. 1910)
1968  Nikolai Stepulov, Russian-Estonian boxer (b. 1913)
1974  Tex Ritter, American actor (b. 1905)
1977  Erroll Garner, American pianist and composer (b. 1921)
1983  Dick Emery, English comedian and actor (b. 1915)
1986  Una Merkel, American actress (b. 1903)
1987  Harekrushna Mahatab, Indian journalist and politician, 1st List of Chief Ministers of Odisha|Chief Minister of Odisha (b. 1899)
1989  Safdar Hashmi, Indian actor, director, and playwright (b. 1954)
1990  Alan Hale Jr., American film and television actor (b. 1921)
1990  Evangelos Averoff, Greek historian and politician, List of defence ministers of Greece|Greek Minister for National Defence (b. 1910)
1994  Dixy Lee Ray, American biologist and politician; 17th Governor of Washington (b. 1914)
1994  Pierre-Paul Schweitzer, French lawyer and businessman (b. 1915)
1995  Nancy Kelly, American actress (b. 1921)
1995  Siad Barre, Somalian general and politician; 3rd List of Presidents of Somalia|President of Somalia (b. 1919)
1996  Karl Targownik, Hungarian-American psychiatrist and author (b. 1915)
1999  Rolf Liebermann, Swiss-French composer and manager (b. 1910)
1999  Sebastian Haffner, German journalist and author (b. 1907)
2000  Elmo Zumwalt, American admiral (b. 1920)
2000  Patrick O'Brian, English author and translator (b. 1914)
2001  William P. Rogers, American lieutenant, lawyer, and politician, 55th United States Secretary of State (b. 1913)
2005  Frank Kelly Freas, American illustrator and painter (b. 1922)
2005  Maclyn McCarty, American geneticist and physician (b. 1911)
2006  Cecilia Muñoz-Palma, Filipino lawyer and jurist (b. 1913)
2006  Osa Massen, Danish-American actress (b. 1914)
2007  A. Richard Newton, Australian-American engineer and academic (b. 1951)
2007  David Perkins (geneticist)|David Perkins, American geneticist and academic (b. 1919)
2007  Elizabeth Fox-Genovese, American historian and author (b. 1941)
2007  Robert C. Solomon, American philosopher, author, and academic (b. 1942)
2007  Teddy Kollek, Hungarian-Israeli politician, List of mayors of Jerusalem|Mayor of Jerusalem (b. 1911)
2008  George MacDonald Fraser, Scottish journalist and author (b. 1925)
2008  Lee S. Dreyfus, American sailor, academic, and politician, 40th Governor of Wisconsin (b. 1926)
2009  Inger Christensen, Danish poet and author (b. 1935)
2010  David R. Ross, Scottish historian and author (b. 1958)
2011  Anne Francis, American actress (b. 1930)
2011  Bali Ram Bhagat, Indian politician; 16th List of Governors of Rajasthan|Governor of Rajasthan (b. 1922)
2011  Pete Postlethwaite, English actor (b. 1946)
2012  Gordon Hirabayashi, American-Canadian sociologist and academic (b. 1918)
2012  Larry Reinhardt, American guitarist (b. 1948)
2012  Silvana Gallardo, American actress and producer (b. 1953)
2012  William P. Carey, American businessman and philanthropist, founded W. P. Carey (b. 1930)
2012  Yoshiro Hayashi, Japanese golfer (b. 1922)
2013  Gerda Lerner, Austrian-American historian, author, and academic (b. 1920)
2013  Teresa Torańska, Polish journalist and author (b. 1944)
2014  Bernard Glasser, American director and producer (b. 1924)
2014  Elizabeth Jane Howard, English author and screenwriter (b. 1923)
2014  Jay Traynor, American singer-songwriter (b. 1943)
2014  Michael J. Matthews, American lawyer and politician; 34th Mayors of Atlantic City, New Jersey|Mayor of Atlantic City (b. 1934)
2015  Derek Minter, English motorcycle racer (b. 1932)
2015  Tihomir Novakov, Serbian-American physicist and academic (b. 1929)
2016  Ardhendu Bhushan Bardhan, Indian lawyer and politician (b. 1924)
2016  Frances Cress Welsing, American psychiatrist and author (b. 1935)
2016  Nimr al-Nimr, Saudi Arabian religious leader (b. 1959)
2017  Albert Brewer, American politician, Governor of Alabama (1968–1971) (b. 1928)
2017  Jean Vuarnet, French ski racer (b. 1933)
2017  John Berger, English art critic and painter (b. 1926)
2018  Guida Maria, Portuguese actress (b. 1950)
2018  Rick Hall, American record producer, songwriter, music publisher, and musician (b. 1932)
2018  Thomas S. Monson, American religious leader, 16th president of The Church of Jesus Christ of Latter-day Saints (b. 1927)
==Holidays and observances==
Ancestry Day (Haiti)
National Science Fiction Day
Berchtoldstag|Berchtold's Day (Switzerland, Liechtenstein and the Alsace)
Carnival|Carnival Day (Saint Kitts and Nevis)
Christian Calendar of saints|feast day:
Basil of Caesarea|Basil the Great (Catholic Church and Church of England)
Defendens|Defendens of Thebes
Earliest day on which the Feast of the Holy Name of Jesus is observed, while January 5 is the latest; celebrated on Sunday between January 2 and 5. (Roman Catholic Church)
Gregory of Nazianzus (Catholic Church)
Johann Konrad Wilhelm Löhe (Lutheran Church)
Macarius of Alexandria
Seraphim of Sarov (repose)
Vedanayagam Samuel Azariah (Episcopal Church (United States)|Episcopal Church)
January 2 (Eastern Orthodox liturgics))
Public holidays in Bhutan#Winter solstice|Nyinlong (Bhutan)
The first day of Blacks and Whites' Carnival, celebrated until January 7. (southern Colombia)
The first day of the Riosucio, Caldas#Carnival of Riosucio|Carnival of Riosucio, celebrated until January 8 every 2 years. (Riosucio, Caldas|Riosucio)
The ninth of the Twelve Days of Christmas (Western Christianity)
The second day of New Year (a holiday in Kazakhstan, Republic of Macedonia|Macedonia, Culture of Mauritius|Mauritius, Montenegro, Public holidays in New Zealand|New Zealand, Romania, Russia, Slovenia, Switzerland, Ukraine):
New Year Holiday (Scotland), if it is a Sunday, the day moves to January 3
Kaapse Klopse (Cape Town, South Africa)
List_of_food_days#January|National Creampuff Day (United States)
Victory of Armed Forces Day (Cuba)
==External links==
 [http://news.bbc.co.uk/onthisday/hi/dates/stories/january/2 BBC: On This Day]
 {{NYT On this day|month=01|day=02}}
 [http://canadachannel.ca/todayincanadianhistory/index.php/January_2 Today in Canadian History]
==References==
