==Events==
484  Huneric dies and is succeeded by his nephew Gunthamund, who becomes king of the Vandals. During his reign Christians are protected from persecution.
558  Chlothar I is crowned List of Frankish kings|King of the Franks.
562  Hagia Sophia in Constantinople reopened with a rebuilt dome after a series of earthquakes caused the original to collapse.
583  Maya queen Yohl Ik'nal is crowned ruler of Palenque.
679  King Dagobert II is murdered while hunting.
962  Arab–Byzantine wars: Under the future List of Byzantine emperors|Emperor Nikephoros II Phokas|Nicephorus Phocas, Byzantine army|Byzantine troops storm the city of Aleppo.
1572  Theologian Johann Sylvan is executed in Heidelberg for his heresy|heretical Nontrinitarianism|Antitrinitarian beliefs.
1688  As part of the Glorious Revolution, King James II of England flees from England to Paris, France after being deposed in favor of his nephew, William III of England|William of Orange and his daughter Mary II of England|Mary.
1783  George Washington George Washington's resignation as commander-in-chief|resigns as commander-in-chief of the Continental Army at the Maryland State House in Annapolis, Maryland.
1793  The Battle of Savenay: A decisive defeat of the House of Bourbon|royalist counter-revolutionaries in War in the Vendée during the French Revolution.
1815  The novel ''Emma_(novel)|Emma'' by Jane Austen is first published.
1876  First day of the Constantinople Conference which resulted in agreement for political reforms in the Balkans.
1893  The opera ''Hansel and Gretel (opera)|Hansel and Gretel'' by Engelbert Humperdinck (composer)|Engelbert Humperdinck is first performed.
1913  The Federal Reserve Act is signed into law by President of the United States|President Woodrow Wilson, creating the Federal Reserve System.
1914  World War I: Australian and New Zealand troops arrive in Cairo, Egypt.
1916  World War I: Battle of Magdhaba: Allies of World War I|Allied forces defeat Ottoman Empire|Turkish forces in the Sinai Peninsula.
1919  Sex Disqualification (Removal) Act 1919 becomes law in the United Kingdom.
1936  Colombia becomes a signatory to the Buenos Aires Convention|Buenos Aires copyright treaty.
1941  World War II: After Battle of Wake Island|15 days of fighting, the Imperial Japanese Army occupies Wake Island.
1947  The transistor is first demonstrated at Bell Labs|Bell Laboratories.
1948  Seven Japanese military and political leaders convicted of war crimes by the International Military Tribunal for the Far East are executed by Allied occupation authorities at Sugamo Prison in Tokyo, Japan.
1954  First successful Kidney transplantation|kidney transplant is performed by J. Hartwell Harrison and Joseph Murray.
1968  The 82 sailors from the {{USS|Pueblo|AGER-2|6}} are released after eleven months of internment in North Korea.
1970  The List of tenants in One World Trade Center|North Tower of the World Trade Center (1973–2001)|World Trade Center in Manhattan, New York City|New York, New York is topped out at {{convert|1368|ft|m}}, making it the tallest building in the world.
1970    The Democratic Republic of the Congo officially becomes a one-party state.
1972  A 1972 Nicaragua earthquake|6.5 magnitude earthquake strikes the Nicaraguan capital of Managua killing more than 10,000.
1972    The 16 survivors of the 1972 Andes flight disaster|Andes flight disaster are rescued after 73 days, having reportedly survived by cannibalism.
1979  Soviet–Afghan War: Soviet Union forces occupy Kabul, the Afghanistan|Afghan capital.
1986  ''Rutan Voyager|Voyager'', piloted by Dick Rutan and Jeana Yeager, lands at Edwards Air Force Base in California becoming the first aircraft to fly non-stop around the world without aerial refueling|aerial or ground refueling.
1990  History of Slovenia: In a Slovenian independence referendum, 1990|referendum, 88.5% of Slovenia's overall electorate vote for independence from Yugoslavia.
2002  A U.S. General Atomics MQ-1 Predator#Iraq|MQ-1 Predator is shot down by an Iraqi Mikoyan-Gurevich MiG-25|MiG-25 in the first combat engagement between a drone and conventional aircraft.
2003  PetroChina Chuandongbei natural gas field explosion, Guoqiao, Kai County, Chongqing, China, killing at least 234.
2007  An agreement is made for the Kingdom of Nepal to be abolished and the country to become a federal republic with the List of Prime Ministers of Nepal|Prime Minister becoming head of state.
2015  A bomb explodes at Istanbul's Sabiha Gökçen Airport, killing one airport cleaner. The Kurdistan Freedom Hawks claim responsibility for the attack four days later.
2016  The United Nations Security Council adopts United Nations Security Council Resolution 2334|Resolution 2334 condemning \"Israeli settlements in Palestinian territories occupied since 1967\".
==Births==
 968  Emperor Zhenzong|Zhen Zong, emperor of the Song Dynasty (d. 1022)
1173  Louis I, Duke of Bavaria|Louis I, duke of Bavaria (d. 1231)
1513  Thomas Smith (diplomat)|Thomas Smith, English scholar and diplomat (d. 1577)
1525  John Albert I, Duke of Mecklenburg|John Albert I, duke of Mecklenburg (d. 1576)
1573  Giovanni Battista Crespi, Italian painter, sculptor and architect (d. 1465)
1582  Severo Bonini, Italian organist and composer (d. 1663)
1544  Anna of Saxony, only child and heiress of Maurice, Elector of Saxony (d. 1577)
1597  Martin Opitz, German poet and composer (d. 1639)
1605  Tianqi Emperor, Chinese emperor (d. 1627)
1613  Carl Gustaf Wrangel, Swedish field marshal and politician, Lord High Constable of Sweden (d. 1676)
1621  Heneage Finch, 1st Earl of Nottingham, English lawyer and politician, Lord Chancellor of England (d. 1682)
1621    Edmund Berry Godfrey, English lawyer and judge (d. 1678)
1689  Joseph Bodin de Boismortier, French composer (d. 1755)
1690  Pamheiba, Indian emperor (d. 1751)
1713  Maruyama Gondazaemon, Japanese sumo wrestler, the 3rd Makuuchi#Yokozuna|Yokozuna (d. 1749)
1732  Richard Arkwright, English businessman and inventor, invented the Water frame and Spinning frame (d. 1792)
1745  John Jay, American jurist and politician, 1st Chief Justice of the United States (d. 1829)
1750  Frederick Augustus I of Saxony (d. 1827)
1758  Nathan Wilson, American soldier and politician (d. 1834)
1766  Wilhelm Hisinger, Swedish physicist and chemist (d. 1852)
1777  Alexander I of Russia (d. 1825)
1790  Jean-François Champollion, French philologist, orientalist, and scholar (d. 1832)
1793  Dost Mohammad Khan, emir of Afghanistan (d. 1863)
1804  Charles Augustin Sainte-Beuve, French author, critic, and academic (d. 1869)
1805  Joseph Smith, American religious leader, 1st List of presidents of The Church of Jesus Christ of Latter-day Saints|President of the Church of Jesus Christ of Latter-day Saints (d. 1844)
1804  Anthony Mary Claret, Spanish Roman Catholic archbishop and missionary (d. 1870)
1810  Edward Blyth, English zoologist (d. 1873)
1810  Karl Richard Lepsius, German Egyptologist (d. 1884)
1812  Samuel Smiles, Scottish-English author (d. 1904)
1812  Henri-Alexandre Wallon, French historian and statesman (d. 1904)
1819  Jan Jakob Lodewijk ten Kate, Dutch pastor and poet (d. 1889)
1822  Wilhelm Bauer, German engineer (d. 1875)
1828  Mathilde Wesendonck, German poet and author (d. 1902)
1839  János Murkovics, Slovene-Hungarian author and educator (d. 1917)
1843  Richard Conner, American sergeant, Medal of Honor recipient (d. 1924)
1854  Henry B. Guppy, English botanist and author (d. 1926)
1867  Madam C. J. Walker, American businesswoman and philanthropist, founded the Madame C.J. Walker Manufacturing Company (d. 1919)
1870  John Marin, American architect and painter (d. 1953)
1878  Stephen Timoshenko, Ukrainian-American engineer and academic (d. 1972)
1885  Pierre Brissaud, French illustrator, painter, and engraver (d. 1964)
1894  Arthur Gilligan, English cricketer (d. 1976)
1895  Nola Luxford, New Zealand-American actress and broadcaster (d. 1994)
1896  Giuseppe Tomasi di Lampedusa, Italian lieutenant and author (d. 1957)
1900  Merle Barwis, American-Canadian supercentenarian (d. 2014)
1900    Marie Bell, French actress and stage director (d. 1985)
1900    Otto Soglow, American cartoonist (d. 1975)
1902  Norman Maclean, American author and academic (d. 1990)
1902    Charan Singh, Indian lawyer and politician, 5th Prime Minister of India (d. 1987)
1907  Manuel Lopes, Cape Verdean author and poet (d. 2005)
1907    James Roosevelt, American general and politician (d. 1991)
1907    Avraham Stern, Polish Zionism|Zionist leader (d. 1942)
1908  Yousuf Karsh, Armenian-Canadian photographer (d. 2002)
1910  Kurt Meyer, German general (d. 1961)
1911  James Gregory (actor)|James Gregory, American actor (d. 2002)
1911    Niels Kaj Jerne, English-Danish physician and immunologist, Nobel Prize in Physiology or Medicine|Nobel Prize laureate (d. 1994)
1912  Anna J. Harrison, American organic chemist and academic (d. 1998)
1912    Woodrow Borah, American historian of Spanish America (d. 1999)
1916  Dino Risi, Italian director and screenwriter (d. 2008)
1918  José Greco, Italian-American dancer and choreographer (d. 2000)
1918    Helmut Schmidt, German soldier, economist, and politician, 5th List of Chancellors of Germany|Chancellor of Germany (d. 2015)
1919  Kenneth M. Taylor, American general and pilot (d. 2006)
1921  Guy Beaulne, Canadian actor and director (d. 2001)
1922  Micheline Ostermeyer, French discus thrower, shot putter, and pianist (d. 2001)
1923  Onofre Marimón, Argentinian race car driver (d. 1954)
1923    Günther Schifter, Austrian journalist and radio host (d. 2008)
1923    James Stockdale, American admiral and pilot, Medal of Honor recipient (d. 2005)
1924  Bob Kurland, American basketball player and politician (d. 2013)
1925  Duncan Hallas, English author and politician (d. 2002)
1925    Rayner Unwin, English publisher (d. 2000)
1926  Robert Bly, American poet and essayist
1926    Harold Dorman, American rock & roll singer-songwriter (d. 1988)
1929  Chet Baker, American jazz trumpet player, flugelhorn player, and singer (d. 1988)
1929    Dick Weber, American professional bowler (d. 2005)
1932  Richard Clark Barkley, American soldier, academic, and diplomat, United States Ambassador to East Germany (d. 2015)
1933  Akihito, Japanese emperor
1933    Noella Leduc, American baseball player (d. 2014)
1935  Paul Hornung, American football player and sportscaster
1935    Johnny Kidd (singer)|Johnny Kidd, English rock & roll singer-songwriter (d. 1966)
1935    Abdul Ghani Minhat, Malaysian footballer and manager (d. 2012)
1935    Esther Phillips, American R&B singer (d. 1984)
1936  Bobby Ross, American football player and coach
1936    Willie Wood (American football)|Willie Wood, American football player
1937  Barney Rosenzweig, American screenwriter and producer
1937    Nelson Shanks, American painter, historian, and educator (d. 2015)
1938  Bob Kahn, American computer scientist and engineer, co-developed the Transmission Control Protocol
1939  Nancy Graves, American sculptor and painter (d. 1995)
1940  Mamnoon Hussain, Pakistani businessman and politician, 12th President of Pakistan
1940    Jorma Kaukonen, American singer-songwriter and guitarist
1940    Robert Labine, Canadian politician
1940    Kevin Longbottom, Australian rugby league player (d. 1986)
1940    Eugene Record, American soul singer-songwriter (d. 2005)
1941  Peter Davis (businessman)|Peter Davis, English businessman
1941    Tim Hardin, American folk singer-songwriter and musician (d. 1980)
1942  Quentin Bryce, Australian lawyer and politician, 25th Governor-General of Australia
1943  Ron Allen (baseball)|Ron Allen, American baseball player
1943    Mikhail Leonidovich Gromov, Russian-French mathematician and academic
1943    Harry Shearer, American actor, voice artist, and comedian
1943    Queen Silvia of Sweden
1944  Wesley Clark, American general
1945    Adly Mansour, Egyptian lawyer, judge, and politician, List of Presidents of Egypt|President of Egypt
1945    Geoffrey Wheatcroft, English journalist and author
1946  Robbie Dupree, American singer-songwriter
1946    Edita Gruberová, Slovak soprano and actress
1946    Susan Lucci, American actress
1946    John Sullivan (writer)|John Sullivan, English screenwriter, producer, and composer (d. 2011)
1947  Bill Rodgers (runner)|Bill Rodgers, American runner
1948  David Davis (British politician)|David Davis, English politician, Minister of State for Europe
1948    Jim Ferguson, American guitarist, composer, and journalist
1948    Jack Ham, American football player and sportscaster
1948    Rick Wohlhuter, American runner
1949  Adrian Belew, American singer-songwriter and guitarist
1949    Reinhold Weege, American screenwriter and producer (d. 2012)
1950  Michael C. Burgess, American obstetrician and politician
1950    Richard Dannatt, Baron Dannatt, English general
1950    Vicente del Bosque, Spanish footballer and manager
1950    Ilchi Lee, South Korean author and educator
1951  Anthony Phillips, English guitarist and songwriter
1952  William Kristol, American journalist, publisher, and political activist/pundit
1953  Andres Alver, Estonian architect and academic
1953    Gerrit W. Gong, American religious leader and academic
1954  Raivo Järvi, Estonian radio host and politician (d. 2012)
1955  Carol Ann Duffy, Scottish poet and playwright
1955    Grace Knight, English-Australian singer-songwriter
1956  Michele Alboreto, Italian race car driver (d. 2001)
1956    Dave Murray (musician)|Dave Murray, English guitarist and songwriter
1957  Dan Bigras, Canadian singer-songwriter
1957    Peter Wynn, Australian rugby league player and businessman
1958  Joan Severance, American actress
1958    Victoria Williams, American singer-songwriter
1961  Ezzat el Kamhawi, Egyptian journalist and author
1961    Ketan J. Patel, Kenyan-English biologist and academic
1961    Carol Smillie, Scottish model and actress
1961    Lorna Tolentino, Filipino actress and producer
1962  Bertrand Gachot, Belgian race car driver
1962    Stefan Hell, Romanian-German physicist and chemist, Nobel Prize in Chemistry|Nobel Prize laureate
1962    Kang Je-gyu, South Korean director, producer, and screenwriter
1962    Keiji Mutoh, Japanese wrestler and actor
1963  Jim Harbaugh, American football player and coach
1963    Jess Harnell, American singer-songwriter
1963    Donna Tartt, American author
1963    Ante Zelck, German businessman
1964  Eddie Vedder, American singer-songwriter and guitarist
1966  Badi Assad, Brazilian singer-songwriter and guitarist
1967  Carla Bruni, Italian-French singer-songwriter and model
1967    Tim Fountain, English author and playwright
1967    Otis Grant, Jamaican-Canadian boxer, coach, and manager
1968  Karyn Bryant, American journalist, actress, producer, and screenwriter
1968    Barry Kooser, American painter and animator
1968    Manuel Rivera-Ortiz, Puerto Rican-American photographer
1968    René Tretschok, German footballer and manager
1969  Greg Biffle, American race car driver
1969    Martha Byrne, American actress and singer
1969    Rob Pelinka, American sports agent
1969    Rodney Culver, American football player (d. 1996)
1970  Catriona LeMay Doan, Canadian speed skater and sportscaster
1970    Raymont Harris, American football player
1970    Karine Polwart, Scottish singer-songwriter and guitarist
1971  Corey Haim, Canadian actor (d. 2010)
1971    Jo Johnson, English banker, journalist, and politician
1971    Michalis Klokidis, Greek footballer
1971    Tara Palmer-Tomkinson, English model, actress, and author (d. 2017)
1971    Wim Vansevenant, Belgian cyclist
1971    Masayoshi Yamazaki, Japanese singer-songwriter
1972  Christian Potenza, Canadian actor, voice actor and singer
1972    Morgan (singer)|Morgan, Italian singer-songwriter and composer
1974  Agustín Delgado, Ecuadorian footballer and politician
1974    Mieszko Talarczyk, Polish-Swedish singer-songwriter, guitarist, and producer (d. 2004)
1975  Vadim Sharifijanov, Russian ice hockey player
1975    Lady Starlight, American singer-songwriter
1976  Joanna Hayes, American hurdler and coach
1976    Brad Lidge, American baseball player
1976    Dimitris Mavrogenidis, Uzbek-Greek footballer and manager
1976    Jamie Noble, American wrestler and producer
1977  Alge Crumpler, American football player
1977    Tore Johansen, Norwegian trumpeter and composer
1977    Jari Mäenpää, Finnish singer-songwriter and guitarist
1977    Paul Shirley, American basketball player and blogger
1978  Esthero, Canadian-American singer-songwriter and producer
1978    Andra Davis, American football player
1978    Víctor Martínez (baseball)|Víctor Martínez, Venezuelan baseball player
1978    Estella Warren, Canadian swimmer, model, and actress
1979  Abraham Chebii, Kenyan runner
1979    Scott Gomez, American ice hockey player
1979    Megan Mayhew Bergman, American author and educator
1979    Kenny Miller, Scottish footballer
1979    Yukifumi Murakami, Japanese javelin thrower
1980  Cody Ross, American baseball player
1981  Maritza Correia, Puerto Rican-American swimmer
1981    Yuriorkis Gamboa, Cuban boxer
1981    Agnes Milowka, Polish-Australian diver, explorer, photographer, and author (d. 2011)
1981    Mario Santana, Argentinian footballer
1982  Brad Nelson, American baseball player
1982    Thomas Rohregger, Austrian cyclist
1983  Michael Chopra, English footballer
1983    Lisa Dobriskey, English runner
1983    Hanley Ramírez, Dominican baseball player
1984  Dudu Aharon, Israeli singer-songwriter
1984    Josh Satin, American baseball player
1984    Sebastian Werle, German rugby player
1985  Harry Judd, English drummer and songwriter
1986  Thomas Bourgin, French motorcycle racer (d. 2013)
1986    Beau Champion, Australian rugby league player
1986    Balázs Dzsudzsák, Hungarian footballer
1986    T. J. Oshie, American ice hockey player
1987  Tommaso Bellazzini, Italian footballer
1987    Owen Franks, New Zealand rugby player
1988  Mallory Hagan, Miss America 2013
1989  Liis Koger, Estonian painter and poet
1992  Jeff Schlupp, German footballer
1996  Bartosz Kapustka, Polish footballer
2002  Finn Wolfhard, Canadian actor
==Deaths==
423  Emperor Mingyuan of Northern Wei|Ming Yuan Di, ruler of Northern Wei (b. 392)
484  Huneric, Vandal king
668  Mor Gabriel, Turkish bishop and saint (b. 594)
679  Dagobert II, Frankish king (b. 650)
761  Gaubald, Frankish bishop (b. 700)
889  Solomon II (bishop of Constance)|Solomon II, bishop of Bishopric of Constance|Constance
910  Saint Naum|Naum of Preslav, Bulgarian missionary and scholar
918  Conrad I of Germany|Conrad I, king of East Francia (b. 890)
940  Ar-Radi, Abbasid caliph (b. 909)
1172  Ugo Ventimiglia, Italian cardinal
1193  Saint Thorlak|Thorlak, patron saint of Iceland (b. 1133)
1230  Berengaria of Navarre, queen of England (b. 1165)
1304  Matilda of Habsburg, duchess regent of Bavaria  (b. 1253)
1332  Philip I, Prince of Taranto (b. 1278)
1383  Beatrice of Bourbon, Queen of Bohemia (b. 1320)
1384  Thomas Preljubović, ruler of Epirus
1332  Philip I of Taranto|Philip I, prince of Taranto (b. 1278)
1392  Isabella of Castile, Duchess of York|Isabella of Castile, duchess of York (b. 1355)
1556  Nicholas Udall, English cleric, playwright, and educator (b. 1504)
1568  Roger Ascham, English scholar and academic (b. 1515)
1575  Akiyama Nobutomo, Japanese samurai (b. 1531)
1588  Henry I, Duke of Guise|Henry I, duke of Guise (b. 1550)
1631  Michael Drayton, English poet and playwright (b. 1563)
1646  François Maynard, French poet and academic (b. 1582)
1652  John Cotton (minister)|John Cotton, English minister and theologian (b. 1585)
1675  Caesar, duc de Choiseul, French general and diplomat (b. 1602)
1722  Pierre Varignon, French mathematician and academic (b. 1654)
1761  Alastair Ruadh MacDonnell, Scottish spy (b. 1725)
1763  Antoine François Prévost, French novelist and translator (b. 1697)
1771  Marie-Marguerite d'Youville, Canadian nun and saint, founded Grey Nuns (b. 1701)
1779  Augustus Hervey, 3rd Earl of Bristol, English admiral and politician, Chief Secretary for Ireland (b. 1724)
1789  Charles-Michel de l'Épée, French priest and educator (b. 1712)
1795  Henry Clinton (British Army officer, born 1730)|Henry Clinton, English general and politician (b. 1730)
1805  Pehr Osbeck, Swedish explorer and author (b. 1723)
1834  Thomas Robert Malthus, English economist and demographer (b. 1766)
1884  John Chisum, American businessman and poker player (b. 1824)
1889  Constance Naden, English poet and philosopher (b. 1858)
1902  Frederick Temple, English archbishop and academic (b. 1821)
1906  Gungunhana|Mdungazwe Ngungunyane Nxumalo, last emperor of the Gaza Empire (b. c.1850)
1912  Otto Schoetensack, German anthropologist and academic (b. 1850)
1926  Swami Shraddhanand, Indian monk, missionary, and educator (b. 1856)
1930  Mustafa Fehmi Kubilay, Turkish lieutenant and educator (b. 1906)
1931  Wilson Bentley, American meteorologist and photographer (b. 1865)
1939  Anthony Fokker, Indonesia-born Dutch pilot and engineer, designed the Fokker Dr.I and Fokker D.VII (b. 1890)
1946  John A. Sampson, American gynecologist and academic (b. 1873)
1948  Akira Mutō, Japanese general (b. 1883)
1948    Hideki Tojo, Japanese general and politician, 40th Prime Minister of Japan (b. 1884)
1948    Seishirō Itagaki, Japanese general (b. 1885)
1948    Heitarō Kimura, Japanese general (b. 1888)
1948    Iwane Matsui, Japanese general (b. 1878)
1948    Kenji Doihara, Japanese general (b. 1883)
1948    Kōki Hirota, Japanese diplomat and politician, 32nd Prime Minister of Japan (b. 1878)
1950  Vincenzo Tommasini, Italian composer (b. 1878)
1953  Lavrentiy Beria,  Georgian-Russian general and politician, Ministry of Internal Affairs (Russia)|Russian Minister of Internal Affairs (b. 1899)
1954  René Iché, French soldier and sculptor (b. 1897)
1961  Carolyn Sherwin Bailey, American author (b. 1875)
1961    Kurt Meyer, German general (b. 1910)
1970  Charles Ruggles, American actor (b. 1886)
1970    Aleksander Warma, Estonian lieutenant and politician, Prime Minister of Estonia in exile (b. 1890)
1972  Andrei Tupolev, Russian engineer, designed the Tupolev Tu-95 and Tupolev Tu-104 (b. 1888)
1973  Charles Atlas, Italian-American bodybuilder and model (b. 1892)
1973    Irna Phillips, American screenwriter, created ''Guiding Light'' and ''As the World Turns'' (b. 1901)
1979  Peggy Guggenheim, American-Italian art collector (b. 1898)
1982  Jack Webb, American actor, director, producer, and screenwriter (b. 1920)
1983  Colin Middleton, Irish painter and illustrator (b. 1910)
1984  Joan Lindsay, Australian author and playwright (b. 1896)
1992  Vincent Fourcade, French interior designer (b. 1934)
1994  Sebastian Shaw (actor)|Sebastian Shaw, English actor, director, and playwright (b. 1905)
1995  Patric Knowles, English actor (b. 1911)
1998  Joe Orlando, Italian-American author and illustrator (b. 1927)
2000  Billy Barty, American actor (b. 1924)
2000    Victor Borge, Danish-American comedian, pianist, and conductor (b. 1909)
2001  Bola Ige, Nigerian lawyer and politician, 3rd Governor of Oyo State (b. 1930)
2004  P. V. Narasimha Rao, Indian lawyer and politician, 9th Prime Minister of India (b. 1921)
2005  Lajos Baróti, Hungarian footballer and manager (b. 1914)
2006  Charlie Drake, English actor (b. 1925)
2006    Timothy J. Tobias, American pianist and composer (b. 1952)
2006    Johnny Vincent (footballer)|Johnny Vincent, English footballer (b. 1947)
2007  William Francis Ganong, Jr., American physiologist and academic (b. 1924)
2007    Michael Kidd, American dancer and choreographer (b. 1915)
2007    Oscar Peterson, Canadian pianist and composer (b. 1925)
2009  Robert L. Howard, American colonel, Medal of Honor recipient (b. 1939)
2009    Ngapoi Ngawang Jigme, Tibetan general and politician (b. 1910)
2009    Edward Schillebeeckx, Belgian theologian and academic (b. 1914)
2010  Fred Hargesheimer, American soldier and pilot (b. 1916)
2010    K. Karunakaran, Indian lawyer and politician, 7th Chief Minister of Kerala (b. 1918)
2011  Aydın Menderes, Turkish economist and politician (b. 1946)
2012  Jean Harris, American educator and murderer (b. 1923)
2012    Eduardo Maiorino, Brazilian mixed martial artist and kick-boxer (b. 1979)
2012    Capital STEEZ, American rapper (b. 1993)
2013  Chryssa, Greek-American sculptor (b. 1933)
2013    Mikhail Kalashnikov, Russian general and weapons designer, designed the AK-47|AK-47 rifle (b. 1919)
2013    Yusef Lateef, American saxophonist, composer, and educator (b. 1920)
2013    Ricky Lawson, American drummer and composer (b. 1954)
2013    José Ortiz (comics)|José Ortiz, Spanish illustrator (b. 1932)
2013    G. S. Shivarudrappa, Indian poet and educator (b. 1926)
2013 - Kerimbubu Shopokova, Kyrgyzstani&nbsp;collective farm&nbsp;worker of the&nbsp;Soviet&nbsp;era (b. 1917)
2013    Robert W. Wilson (philanthropist)|Robert W. Wilson, American philanthropist and art collector (b. 1928)
2014  Edward Greenspan, Canadian lawyer and author (b. 1944)
2014    Robert V. Hogg, American statistician and academic (b. 1924)
2014    Jeremy Lloyd, English actor and screenwriter (b. 1930)
2015  Alfred G. Gilman, American pharmacologist and biochemist, Nobel Prize in Physiology or Medicine|Nobel Prize laureate (b. 1941)
2015    Don Howe, English footballer and manager (b. 1935)
2015    Jean-Marie Pelt, French biologist, pharmacist, and academic (b. 1933)
2015    Bülent Ulusu, Turkish admiral and politician, 18th List of Prime Ministers of Turkey|Prime Minister of Turkey (b. 1923)
2017  Maurice Hayes, Irish educator and politician (b. 1927)
==Holidays and observances==
Flag days in Sweden|Birthday of the Queen Queen Silvia of Sweden|Silvia, an Flag days in Sweden|official flag day (Sweden)
Children's Day#South Sudan|Children's Day (South Sudan and Sudan)
Christian Calendar of saints|Feast Day:
Abassad (Coptic Orthodox Church of Alexandria|Coptic Church)
John Cantius
O Emmanuel
Psote (Coptic Orthodox Church of Alexandria|Coptic Church)
Saint Thorlak|Thorlac Thorhallsson, patron saint of Iceland; The last day of preparations before Christmas.
Victoria, Anatolia, and Audax|Victoria
December 23 (Eastern Orthodox liturgics)
Armed_Forces_of_Ukraine#Military_holidays|Day of all level operational control structures servicemen (Ukraine)
Festivus, a holiday made popular by the sitcom ''Seinfeld''
HumanLight (Secular humanism in United States)
Charan_Singh#Legacy|Kisan Diwas (Uttar Pradesh, India)
Night of the Radishes (Oaxaca City, Mexico)
The Emperor's Birthday, birthday of Akihito, the current Emperor of Japan. (Japan)
Tibb's Eve (Newfoundland and Labrador)
Tom Bawcock's Eve (Mousehole, Cornwall)
Victory Day (Egypt)
==External links==
[http://news.bbc.co.uk/onthisday/hi/dates/stories/december/23 BBC: On This Day]
{{NYT On this day|month=12|day=23}}
[http://canadachannel.ca/todayincanadianhistory/index.php/December_23 Today in Canadian History]
