==Leap years==
===Modern (Gregorian) calendar===
===Early Roman calendar===
===Julian reform===
==Born on February 29==
===Legal status===
===In fiction===
==Events==
1504  Christopher Columbus uses his knowledge of a March 1504 lunar eclipse|lunar eclipse that night to convince Native Americans (Americas)|Native Americans to provide him with supplies.
1644  Abel Tasman's second Pacific voyage began.
1704  Queen Anne's War: French forces and Native American (U.S.)|Native Americans stage a Raid on Deerfield|raid on Deerfield, Massachusetts Bay Colony, killing 56 villagers and taking more than 100 captive.
1712  February 29 is followed by February 30 in Sweden, in a move to abolish the Swedish calendar for a return to the Julian calendar.
1720  Ulrika Eleonora, Queen of Sweden abdicates in favour of her husband, who becomes King Frederick I of Sweden|Frederick I on 24 March.
1752  King Alaungpaya founds Konbaung Dynasty, the last dynasty of Burmese monarchy.
1768  Polish nobles formed Bar Confederation.
1796  The Jay Treaty between the United States and Great Britain comes into force, facilitating ten years of peaceful trade between the two nations.
1864  American Civil War: Kilpatrick–Dahlgren Raid fails: Plans to free 15,000 United States|Union soldiers being held near Richmond, Virginia are thwarted.
1892  St. Petersburg, Florida is incorporated.
1912  The Piedra Movediza (Moving Stone) of Tandil falls and breaks.
1916  Tokelau is annexed by the United Kingdom.
1916    Child labor: In South Carolina, the minimum working age for factory, mill, and mine workers is raised from twelve to fourteen years old.
1920  Czechoslovakia|Czechoslovak National assembly adopted the Czechoslovak Constitution of 1920|Constitution.
1936  February 26 Incident in Tokyo ends.
1940  For her performance as \"Mammy\" in ''Gone with the Wind (film)|Gone with the Wind'', Hattie McDaniel becomes the first African American to win an Academy Awards|Academy Award.
1940    Finland initiates Winter War peace negotiations.
1940    In a ceremony held in Berkeley, California, because of the World War II|war, physicist Ernest Lawrence receives the 1939 Nobel Prize in Physics from Sweden's Consul General in San Francisco.
1944  World War II: The Admiralty Islands are invaded in Operation Brewer led by American General Douglas MacArthur.
1960  The 5.7 {{M|w}} 1960 Agadir earthquake|Agadir earthquake shakes coastal Morocco with a maximum perceived intensity of Mercalli intensity scale|X (''Extreme''), destroying Agadir, and leaving 12,000 dead and another 12,000 injured.
1964  In Sydney, Australian swimmer Dawn Fraser sets a new world record in the 100-meter freestyle swimming competition (58.9 seconds).
1972  Vietnam War: Vietnamization: South Korea withdraws 11,000 of its 48,000 troops from Vietnam.
1980  Gordie Howe of the then Carolina Hurricanes|Hartford Whalers makes National Hockey League|NHL history as he scores his 800th goal.
1988  South African archbishop Desmond Tutu is arrested along with 100 clergymen during a five-day anti-apartheid demonstration in Cape Town.
1988    Svend Robinson becomes the first member of the House of Commons of Canada to coming out|come out as gay.
1992  First day of Bosnian independence referendum, 1992|Bosnia and Herzegovina independence referendum.
1996  Faucett Flight 251 crashes in the Andes, all 123 passengers and crew died.
1996    Siege of Sarajevo officially ends.
2000  Second Chechen War: Eighty-four Russian paratroopers are killed in a rebel attack on a guard post near Ulus Kert.
2004  Jean-Bertrand Aristide is removed as President of Haiti following 2004 Haitian coup d'état|a coup.
2008  The United Kingdom's Ministry of Defence (United Kingdom)|Ministry of Defence decides to withdraw Prince Harry from a Operation Herrick|tour of Afghanistan \"immediately\" after a leak led to his deployment being reported by foreign media.
2008    Misha Defonseca admits to fabricating her memoir, ''Misha: A Mémoire of the Holocaust Years'', in which she claimed to have lived with a pack of wolves in the woods during the Holocaust.
2012  Tokyo Skytree construction completed. It is, as of 2017, the List of tallest towers in the world|tallest tower in the world, 634 meters high, and second tallest (man-made) structure on Earth, next to Burj Khalifa.
==Births==
1468  Pope Paul III (d. 1549)
1528  Albert V, Duke of Bavaria (d. 1579)
1528    Domingo Báñez, Spanish theologian (d. 1604)
1572  Edward Cecil, 1st Viscount Wimbledon (d. 1638)
1576  Antonio Neri, Florentine priest and glassmaker (d. 1614)
1640  Benjamin Keach, Particular Baptist preacher and author whose name was given to Keach's Catechism (d. 1704)
1692  John Byrom, English poet and educator (d. 1763)
1724  Eva Marie Veigel, Austrian-English dancer (d. 1822)
1736  Ann Lee, English-American religious leader, founded the Shakers (d. 1784)
1792  Gioachino Rossini, Italian pianist and composer (d. 1868)
1812  James Milne Wilson, Scottish-Australian soldier and politician, 8th Premier of Tasmania (d. 29 February 1880)
1828  Emmeline B. Wells, American journalist, poet, and activist (d. 1921)
1836  Dickey Pearce, American baseball player and manager (d. 1908)
1852  Frank Gavan Duffy, Irish-Australian lawyer and judge, 4th Chief Justice of Australia (d. 1936)
1860  Herman Hollerith, American statistician and businessman, co-founded the Computing-Tabulating-Recording Company (d. 1929)
1884  Richard S. Aldrich, American lawyer and politician (d. 1941)
1892  Augusta Savage, American sculptor (d. 1962)
1896  Morarji Desai, Indian civil servant and politician, 4th Prime Minister of India (d. 1995)
1896    William A. Wellman, American actor, director, producer, and screenwriter (d. 1975)
1904  Rukmini Devi Arundale, Indian dancer and choreographer (d. 1986)
1904    Jimmy Dorsey, American saxophonist, composer, and bandleader (d. 1957)
1904    Pepper Martin, American baseball player and manager (d. 1965)
1908  Balthus, French-Swiss painter and illustrator (d. 2001)
1908    Dee Brown (writer)|Dee Brown, American historian and author (d. 2002)
1908    Alf Gover, English cricketer and coach (d. 2001)
1908    Louie Myfanwy Thomas, Welsh writer (d. 1968)
1916  Dinah Shore, American singer and actress (d. 1994)
1916    James B. Donovan, American lawyer (d. 1970)
1916    Leonard Shoen, founder of U-Haul Corp. (d. 1999)
1920  Fyodor Abramov, Russian author and critic (d. 1983)
1920    Arthur Franz, American actor (d. 2006)
1920    James Mitchell (actor)|James Mitchell, American actor and dancer (d. 2010)
1920    Michèle Morgan, French-American actress and singer (d. 2016)
1920    Howard Nemerov, American poet and academic (d. 1991)
1920    Rolland W. Redlin, American lawyer and politician (d. 2011)
1924  David Beattie, New Zealand judge and politician, 14th Governor-General of New Zealand (d. 2001)
1924    Carlos Humberto Romero, Salvadoran politician, President of El Salvador (d. 2017)
1924    Al Rosen, American baseball player and manager (d. 2015)
1928  Joss Ackland, English actor
1928    Vance Haynes, American archaeologist, geologist, and author
1928    Seymour Papert, South African mathematician and computer scientist, co-created the Logo (programming language)|Logo programming language (d. 2016)
1932  Gene H. Golub, American mathematician and academic (d. 2007)
1932    Masten Gregory, American race car driver (d. 1985)
1932    Reri Grist, American soprano and actress
1932    Jaguar (cartoonist)|Jaguar, Brazilian cartoonist
1932    Gavin Stevens, Australian cricketer
1936  Jack R. Lousma, American colonel, astronaut, and politician
1936    Henri Richard, Canadian ice hockey player
1936    Alex Rocco, American actor (d. 2015)
1940  Bartholomew I of Constantinople
1940    William H. Turner, Jr. American horse trainer
1944  Ene Ergma, Estonian physicist and politician
1944    Dennis Farina, American police officer and actor (d. 2013)
1944    Nicholas Frayling, English priest and academic
1944    Phyllis Frelich, American actress (d. 2014)
1944    Steve Mingori, American baseball player (d. 2008)
1944    Paolo Eleuteri Serpieri, Italian author and illustrator
1948  Hermione Lee, English author, critic, and academic
1948    Patricia A. McKillip, American author
1948    Henry Small (singer)|Henry Small, American-born Canadian singer
1952  Sharon Dahlonega Raiford Bush, American journalist and producer
1952    Tim Powers, American author and educator
1952    Raisa Smetanina, Russian cross-country skier
1952    Bart Stupak, American police officer and politician
1956  Jonathan Coleman (presenter)|Jonathan Coleman, English-Australian radio and television host
1956    Bob Speller, Canadian businessman and politician, 30th Minister of Agriculture (Canada)|Canadian Minister of Agriculture
1956    Aileen Wuornos, American serial killer (d. 2002)
1960  Lucian Grainge, English businessman
1960    Khaled (musician)|Khaled, Algerian singer-songwriter
1960    Richard Ramirez, American serial killer (d. 2013)
1960    Tony Robbins, American motivational speaker and author
1964  Dave Brailsford, English cyclist and coach
1964    Lyndon Byers, Canadian ice hockey player and radio host
1964    Mervyn Warren, American tenor, composer, and producer
1968  Suanne Braun, South African-English actress
1968    Chucky Brown, American basketball player and coach
1968    Pete Fenson, American curler and sportscaster
1968    Naoko Iijima, Japanese actress and model
1968    Bryce Paup, American football player and coach
1968    Howard Tayler, American author and illustrator
1968    Eugene Volokh, Ukrainian-American lawyer and educator
1968    Frank Woodley, Australian actor, producer, and screenwriter
1972  Mike Pollitt, English footballer and coach
1972    Antonio Sabàto, Jr., Italian-American model and actor
1972    Pedro Sánchez (Spanish politician)|Pedro Sánchez, Prime Minister of Spain
1972    Dave Williams (singer)|Dave Williams, American singer (d. 2002)
1972    Saul Williams, American singer-songwriter
1972    Pedro Zamora, Cuban-American activist and educator (d. 1994)
1976  Zoë Baker, English-New Zealand swimmer and coach
1976    Gehad Grisha, Egyptian soccer referee
1976    Terrence Long, American baseball player
1976    Ja Rule, American rapper and actor
1980  Çağdaş Atan, Turkish footballer
1980    Chris Conley, American singer-songwriter and guitarist
1980    Patrick Côté (fighter)|Patrick Côté, Canadian mixed martial artist
1980    Simon Gagné, Canadian ice hockey player
1980    Rubén Plaza, Spanish cyclist
1980    Clinton Toopi, New Zealand rugby league player
1980    Taylor Twellman, American soccer player and sportscaster
1984  Darren Ambrose, English footballer
1984    Megan Bernard, Australian audio artist
1984    Foster the People|Mark Foster, American musician (Foster the People)
1984    Rica Imai, Japanese model and actress
1984    Cullen Jones, American swimmer
1984    Nuria Martínez, Spanish basketball player
1984    Adam Sinclair, Indian field hockey player
1984    Rakhee Thakrar, English actress
1984    Dennis Walger, German rugby player
1984    Cam Ward, Canadian ice hockey player
1988  Lena Gercke, German model and television host
1988    Scott Golbourne, English footballer
1988    Benedikt Höwedes, German footballer
1988    Nadav Ben Yehuda, Israeli Mountaineer and SAR Specialist
1988    Brent Macaffer, Australian Rules footballer
1988    Bobby Sanguinetti, American ice hockey player
1992  Sean Abbott, Australian cricketer
1992    Ben Hampton, Australian rugby league player
1992    Perry Kitchen, American soccer player
1992    Caitlin EJ Meyer, American actress
1992    Saphir Taïder, French-Algerian footballer
1996  Nelson Asofa-Solomona, New Zealand rugby league player
1996    Claudia Williams, New Zealand tennis player
==Deaths==
 468  Pope Hilarius
 992  Oswald of Worcester, French archbishop and saint (b. 925)
1212  Hōnen, Japanese monk, founded Jōdo-shū (b. 1133)
1460  Albert III, Duke of Bavaria|Albert III, Duke of Bavaria-Munich (b. 1401)
1528  Patrick Hamilton (martyr)|Patrick Hamilton, Scottish Protestant reformer and martyr (b. 1504)
1592  Alessandro Striggio, Italian composer and diplomat (b. 1540)
1600  Caspar Hennenberger, German pastor, historian and cartographer (b. 1529)
1604  John Whitgift, English archbishop and academic (b. 1530)
1740  Pietro Ottoboni (cardinal)|Pietro Ottoboni, Italian cardinal (b. 1667)
1744  John Theophilus Desaguliers, French-English physicist and philosopher (b. 1683)
1792  Johann Andreas Stein, German piano builder (b. 1728)
1820  Johann Joachim Eschenburg, German historian and critic (b. 1743)
1848  Louis-François Lejeune, French general, painter and lithographer (b. 1775)
1852  Matsudaira Katataka, Japanese daimyo (b. 1806)
1868  Ludwig I of Bavaria (b. 1786)
1880  James Milne Wilson, Scottish-Australian soldier and politician, 8th Premier of Tasmania (b. 29 February 1812)
1908  Pat Garrett, American sheriff (b. 1850)
1908    John Hope, 1st Marquess of Linlithgow, Scottish-Australian politician, 1st Governor-General of Australia (b. 1860)
1920  Ernie Courtney, American baseball player (b. 1875)
1928  Adolphe Appia, Swiss architect and theorist (b. 1862)
1928    Ina Coolbrith, American poet and librarian (b. 1841)
1940  E. F. Benson, English archaeologist and author (b. 1867)
1944  Pehr Evind Svinhufvud, Finnish lawyer, judge and politician, 3rd President of Finland (b. 1861)
1948  Robert Barrington-Ward, English lawyer and journalist (b. 1891)
1948    Rebel Oakes, American baseball player and manager (b. 1883)
1952  Quo Tai-chi, Chinese politician and diplomat, Permanent Representative of China to the United Nations (b. 1888)
1956  Elpidio Quirino, Filipino lawyer and politician, 6th President of the Philippines (b. 1890)
1960  Melvin Purvis, American police officer and FBI agent (b. 1903)
1960    Walter Yust, American journalist and author (b. 1894)
1964  Frank Albertson, American actor and singer (b. 1909)
1968  Lena Blackburne, American baseball player, coach and manager (b. 1886)
1968    Tore Ørjasæter, Norwegian poet and educator (b. 1886)
1972   Tom Davies (American football)|Tom Davies, American football player and coach (b. 1896)
1976  Florence P. Dwyer, American politician (b. 1902)
1980  Yigal Allon, Israeli general and politician, Prime Minister of Israel (b. 1918)
1980    Gil Elvgren, American painter and illustrator (b. 1914)
1984  Ludwik Starski, Polish screenwriter and songwriter (b. 1903)
1988  Sidney Harmon, American screenwriter and producer (b. 1907)
1992  Ruth Pitter, English poet and author (b. 1897)
1996  Wes Farrell, American singer-songwriter and producer (b. 1939)
1996    Ralph Rowe, American baseball player, coach and manager (b. 1924)
2000  Dennis Danell, American guitarist (b. 1961)
2004  Kagamisato Kiyoji, Japanese sumo wrestler, the 42nd Yokozuna (b. 1923)
2004    Jerome Lawrence, American playwright and author (b. 1915)
2004    Harold Bernard St. John, Barbadian lawyer and politician, 3rd Prime Minister of Barbados (b. 1931)
2004    Lorrie Wilmot, South African cricketer (b. 1943)
2008  Janet Kagan, American author (b. 1946)
2008    Erik Ortvad, Danish painter and illustrator (b. 1917)
2008    Akira Yamada, Japanese scholar and philosopher (b. 1922)
2012  Roland Bautista, American guitarist (b. 1951)
2012    Davy Jones (musician)|Davy Jones, English singer, guitarist and actor (b. 1945)
2012    Sheldon Moldoff, American illustrator (b. 1920)
2012    P. K. Narayana Panicker, Indian social leader (b. 1930)
2016  Wenn V. Deramas, Filipino director and screenwriter (b. 1968)
2016    Gil Hill, American police officer, actor and politician (b. 1931)
2016    Josefin Nilsson, Swedish singer (b. 1969)
2016    Louise Rennison, English author (b. 1951)
==Holidays and observances==
 Christian feast day:
 Auguste Chapdelaine (one of Martyr Saints of China)
 Oswald of Worcester (in leap year only)
 February 29 (Eastern Orthodox liturgics)
Saint John Cassian
 The fourth day of Ayyám-i-Há (Bahá'í Faith) (Please note that this observance is only locked into this date the Gregorian calendar on this date if Bahá'í Naw-Rúz takes place on March 21, which it doesn't in all years)
 Rare Disease Day (in leap years, otherwise is February 28th)
Bachelor's Day (tradition)|Bachelor's Day (Ireland, United Kingdom)
 In Discordianism, February 29 is coterminus with St. Tibs' day in the Discordian calendar
==Folk traditions==
==References==
==External links==
 [http://news.bbc.co.uk/onthisday/hi/dates/stories/february/29 BBC: On This Day]
 {{NYT On this day|month=02|day=29}}
 [https://archive.is/20121209083011/http://www1.sympatico.ca/cgi-bin/on_this_day?mth=Feb&day=29 On This Day in Canada]
 {{Britannica|333933|Leap year (Calendar)}}
